{
    "Role i Współpraca": {
        "Jak zespół wielofunkcyjny jest zaangażowany w proces rozwoju produktu?": "Zespół wielofunkcyjny nie istnieje w procesie rozwoju produktu.",
        "Jak wszystkie strony zainteresowane są zaangażowane w zespół projektowy, nawet gdy są rozproszone globalnie?": "Niektóre strony zainteresowane są zaangażowane, ale tylko lokalnie.",
        "Jak jasno są zdefiniowane role i obowiązki każdej osoby?": "Role i obowiązki są zdefiniowane, ale często nie są jasne lub zrozumiałe dla wszystkich.",
        "Jak zapewniana jest wysoka elastyczność w wykonywaniu zadań w projekcie?": "Elastyczność w wykonywaniu zadań jest możliwa, ale nie dla wszystkich członków zespołu.",
        "Jakie jest zaplecze techniczne i poziom zaangażowania kierowników produktu w projektach?": "Większość kierowników produktu ma odpowiednie zaplecze techniczne i są zaangażowani w projekty.",
        "Jak w pełni klient jest zaangażowany w proces rozwoju produktu?": "Klient nie jest zaangażowany w proces rozwoju produktu.",
        "Czy doświadczeni projektanci są zaangażowani od najwcześniejszych etapów projektu?": "Doświadczeni projektanci są zaangażowani, ale tylko sporadycznie we wczesnych etapach."
    },
    "Szkolenie": {
        "Jak formalne programy wspierają rozwój umiejętności interdyscyplinarnych?": "Nie ma formalnych programów szkoleniowych.",
        "Jak oferowane są indywidualne sesje mentorskie wspierające rozwój umiejętności?": "Sesje mentorskie są dostępne w ograniczonym zakresie i dla wybranych pracowników.",
        "Jak KPI są wykorzystywane do oceny wyników szkoleń?": "KPI nie są używane do oceny wyników szkoleń."
    },
    "Działania i Przepływ": {
        "W jakim stopniu formalny model rozwoju produktu jest przestrzegany i dokumentowany?": "Nie ma formalnego modelu rozwoju produktu.",
        "W jakim stopniu współpraca jest częścią procesu rozwoju produktu?": "Współpraca istnieje, ale ogranicza się do kilku kluczowych etapów.",
        "Jak skutecznie kompleksowy zestaw KPI jest używany do mierzenia wydajności rozwoju produktu?": "Nie ma kompleksowego zestawu KPI.",
        "Na jakim poziomie frontloading jest wdrażany w procesie rozwoju produktu?": "Frontloading jest stosowany w większości projektów, ale nie zawsze skutecznie.",
        "W jakim stopniu podejmowane są inicjatywy ciągłego doskonalenia?": "Inicjatywy ciągłego doskonalenia są podejmowane, ale rzadko.",
        "Jak skutecznie projektowane są różne rozwiązania i eliminowane gorsze rozwiązania w miarę pojawiania się nowych informacji?": "Różne rozwiązania są projektowane, ale eliminacja słabszych opcji jest niesystematyczna.",
        "W jakim stopniu proces rozwoju produktu koncentruje się na wartości dla klienta?": "Proces częściowo koncentruje się na wartości dla klienta, ale nie jest to priorytet.",
        "Jak wdrażany jest proces analizy konkurencji (inżynieria wsteczna)?": "Proces analizy konkurencji jest wdrażany, ale w ograniczonym zakresie."
    },
    "Podejmowanie Decyzji": {
        "Jak uwzględniany jest proces projektowania i uprzemysłowienia części i modułów?": "Proces projektowania i uprzemysłowienia jest sporadycznie uwzględniany.",
        "W jakim stopniu uwzględniany jest proces produkcji komponentów i produktów półgotowych?": "Proces produkcji komponentów i produktów półgotowych jest sporadycznie uwzględniany.",
        "Na jakim poziomie proces montażu komponentów jest uwzględniany w rozwoju produktu?": "Proces montażu komponentów jest sporadycznie uwzględniany.",
        "Jak ważny jest proces testowania i eksperymentowania w rozwoju produktu?": "Proces testowania i eksperymentowania jest uwzględniany w większości przypadków, ale jego znaczenie jest ograniczone.",
        "Na jakim poziomie uwzględniany jest proces pakowania i przechowywania?": "Proces pakowania i przechowywania jest sporadycznie uwzględniany.",
        "Jak uwzględniany jest proces dostawy i dystrybucji?": "Proces dostawy i dystrybucji jest uwzględniany, ale jego rola nie zawsze jest krytyczna.",
        "W jakim stopniu użytkowanie przez klienta jest uwzględniane w rozwoju produktu?": "Użytkowanie przez klienta jest sporadycznie uwzględniane.",
        "Jak uwzględniany jest proces konserwacji i obsługi posprzedażnej?": "Proces konserwacji i obsługi posprzedażnej jest uwzględniany, ale nie kompleksowo.",
        "Na jakim poziomie uwzględniany jest proces demontażu, recyklingu i utylizacji?": "Proces demontażu, recyklingu i utylizacji jest sporadycznie uwzględniany.",
        "W jakim stopniu uwzględniany jest proces inspekcji, ponownego użycia, aktualizacji i odnowy?": "Proces inspekcji, ponownego użycia, aktualizacji i odnowy jest sporadycznie uwzględniany.",
        "Jak ważny jest finalny koszt/cena produktu w procesie podejmowania decyzji?": "Finalny koszt produktu jest uwzględniany, ale nie zawsze kompleksowo.",
        "W jakim stopniu koszty rozwoju/ROI są uwzględniane w procesie podejmowania decyzji?": "Koszty rozwoju/ROI są sporadycznie uwzględniane.",
        "Jak ważne są koszty cyklu życia i koszty operacyjne, takie jak konserwacja, usługi, recykling i utylizacja?": "Koszty cyklu życia i koszty operacyjne są sporadycznie uwzględniane.",
        "Jak czas wprowadzenia na rynek (TTM) i terminy dostaw są uwzględniane w podejmowaniu decyzji?": "TTM i terminy dostaw są uwzględniane, ale nie zawsze krytycznie.",
        "Jak liczba różnych produktów wpływa na decyzje projektowe?": "Liczba różnych produktów jest uwzględniana w ograniczonym zakresie.",
        "W jakim stopniu dostosowanie produktu jest uwzględniane?": "Dostosowanie produktu jest sporadycznie uwzględniane.",
        "Jak poziom innowacyjności jest uwzględniany w podejmowaniu decyzji?": "Poziom innowacyjności jest monitorowany, ale nie zawsze kompleksowo.",
        "Jak wizerunek marki wpływa na podejmowanie decyzji?": "Wizerunek marki jest uwzględniany, ale nie we wszystkich decyzjach.",
        "Jak ważna jest wydajność funkcjonalna (np. produktywność, szybkość, dokładność, łatwość konserwacji)?": "Wydajność funkcjonalna jest regularnie monitorowana i uwzględniana w każdej decyzji.",
        "Jak wydajność jakościowa (np. trwałość, niezawodność) jest uwzględniana w decyzjach projektowych?": "Wydajność jakościowa jest uwzględniana, ale nie zawsze jest priorytetem.",
        "Jak zgodność z przepisami i standardami regulacyjnymi wpływa na decyzje?": "Zgodność z przepisami jest uwzględniana, ale nie zawsze kompleksowo.",
        "Jakie inne czynniki, takie jak zrównoważony rozwój środowiskowy, estetyka czy aspekty społeczne, są uwzględniane?": "Inne czynniki, takie jak zrównoważoność, są uwzględniane, ale nie zawsze priorytetyzowane."
    },
    "Procesy ZW": {
        "Jak odzyskiwana jest poprzednia wiedza podczas fazy koncepcyjnej projektu?": "Wiedza z poprzednich projektów nie jest wykorzystywana podczas fazy koncepcyjnej.",
        "Jak odzyskiwana jest poprzednia wiedza podczas studium wykonalności?": "Wiedza z poprzednich projektów jest sporadycznie wykorzystywana podczas studium wykonalności, ale nie systematycznie.",
        "Jak odzyskiwana jest poprzednia wiedza podczas szczegółowej fazy projektowania produktu i jego komponentów?": "Wiedza z poprzednich projektów nie jest systematycznie odzyskiwana podczas szczegółowej fazy projektowania.",
        "Jak odzyskiwana jest poprzednia wiedza podczas testowania, prototypowania i eksperymentowania?": "Wiedza z poprzednich projektów jest czasami odzyskiwana podczas testowania i prototypowania.",
        "Jak odzyskiwana jest poprzednia wiedza podczas finalnej weryfikacji projektu?": "Wiedza z poprzednich projektów nie jest odzyskiwana podczas finalnej weryfikacji projektu.",
        "Jak formalny plan zarządzania wiedzą wspiera proces rozwoju produktu?": "Formalny plan zarządzania wiedzą istnieje, ale nie jest szeroko używany.",
        "W jakim stopniu firma wykorzystuje zasoby wiedzy z poprzednich projektów?": "Firma sporadycznie wykorzystuje zasoby wiedzy z poprzednich projektów.",
        "Jak zasady projektowe zdefiniowane przez firmę są uwzględniane (często przeglądane i aktualizowane) w procesie zarządzania wiedzą?": "Zasady projektowe zdefiniowane przez firmę są regularnie aktualizowane i wspierają proces ZW.",
        "Jak zasady projektowe zdefiniowane przez podmioty zewnętrzne (np. klienci, dostawcy) są uwzględniane (często przeglądane i aktualizowane) w procesie ZW?": "Zewnętrzne zasady projektowe są uwzględniane, ale w ograniczonym zakresie.",
        "Jak zasady projektowe zdefiniowane w pisemnych podręcznikach/standardach zasad projektowania są uwzględniane (często przeglądane i aktualizowane) w procesie ZW?": "Zasady projektowe zdefiniowane w podręcznikach/standardach są uwzględniane, ale nie we wszystkich projektach.",
        "Jak zasady zarządzania wiedzą wspierają uwzględnianie finalnych kosztów produktu?": "Zarządzanie wiedzą uwzględnia finalne koszty produktu, ale nie zawsze systematycznie.",
        "Jak zarządzanie wiedzą wpływa na ocenę kosztów rozwoju i ROI?": "Zarządzanie wiedzą wpływa na ocenę kosztów rozwoju, ale nie wszystkie projekty są objęte analizą ROI.",
        "Jak zarządzanie wiedzą wspiera uwzględnianie kosztów cyklu życia i kosztów operacyjnych (np. konserwacja, recykling)?": "Koszty cyklu życia i koszty operacyjne są uwzględniane, ale w ograniczonym zakresie.",
        "Jak zarządzanie wiedzą wpływa na czas wprowadzenia na rynek (TTM) i terminy dostaw?": "Czas wprowadzenia na rynek jest uwzględniany w procesie ZW, ale nie zawsze ma duży wpływ.",
        "Jak ZW wspiera ocenę liczby różnych produktów w portfolio firmy?": "ZW wspiera ocenę liczby różnych produktów, ale nie systematycznie.",
        "W jakim stopniu ZW uwzględnia poziom dostosowania produktu do potrzeb klienta?": "Poziom dostosowania produktu jest uwzględniany, ale nie we wszystkich projektach.",
        "Jak zarządzanie wiedzą wspiera innowacje w firmie?": "ZW wspiera innowacje w większości projektów, ale nie zawsze systematycznie.",
        "Jak zasady ZW wspierają budowanie wizerunku marki?": "Wizerunek marki jest wspierany przez ZW, ale nie jest priorytetem.",
        "Jak zarządzanie wiedzą wspiera wydajność funkcjonalną produktów (np. produktywność, szybkość, dokładność)?": "Wydajność funkcjonalna jest uwzględniana, ale nie jest regularnie monitorowana.",
        "Jak zarządzanie wiedzą wspiera monitorowanie wydajności jakościowej produktu (np. trwałość, niezawodność)?": "Wydajność jakościowa jest uwzględniana, ale nie zawsze jest priorytetem.",
        "Jak zarządzanie wiedzą wspiera zgodność z przepisami i standardami prawnymi?": "Zarządzanie wiedzą uwzględnia zgodność z przepisami, ale nie jako priorytet.",
        "Jakie inne aspekty (np. zrównoważony rozwój środowiskowy, estetyka) są uwzględniane w procesie ZW?": "Inne aspekty, takie jak zrównoważony rozwój środowiskowy, są uwzględniane, ale nie systematycznie we wszystkich projektach."
    },
    "Techniki ZW": {
        "W jakim stopniu komunikacja werbalna z kolegami jest używana do dzielenia się wiedzą?": "Komunikacja werbalna z kolegami jest sporadycznie używana do dzielenia się wiedzą.",
        "Jak często tworzone i wykorzystywane są dokumenty z wyciągniętymi wnioskami?": "Dokumenty z wyciągniętymi wnioskami są czasami tworzone, ale rzadko używane.",
        "W jakim stopniu specyfikacje projektowe są używane w procesach zarządzania wiedzą?": "Specyfikacje projektowe są sporadycznie używane do dzielenia się wiedzą, ale nie systematycznie.",
        "Jak skutecznie kwestionariusze i listy kontrolne wspierają zarządzanie wiedzą?": "Kwestionariusze i listy kontrolne są używane, ale ich skuteczność jest ograniczona.",
        "W jakim stopniu sale konferencyjne, plakaty i zarządzanie wizualne są używane do dzielenia się wiedzą?": "Sale konferencyjne, plakaty i zarządzanie wizualne są sporadycznie używane do dzielenia się wiedzą.",
        "Jak często wspólne foldery sieciowe są używane do przechowywania i dzielenia się wiedzą?": "Wspólne foldery sieciowe są sporadycznie używane do przechowywania i dzielenia się wiedzą, ale nie systematycznie.",
        "W jakim stopniu intranet wspiera proces zarządzania wiedzą?": "Intranet jest sporadycznie używany do wspierania zarządzania wiedzą, ale nie zawsze skutecznie.",
        "Jak strony internetowe są używane do pracy nad projektami współprawczymi (np. Wiki) w zarządzaniu wiedzą?": "Strony internetowe używane do pracy nad projektami współprawczymi są używane w większości przypadków, ale nie są jeszcze optymalne.",
        "Jak blogi, fora i tablice ogłoszeń są używane w zarządzaniu wiedzą?": "Blogi, fora i tablice ogłoszeń są używane w ograniczonym zakresie w zarządzaniu wiedzą.",
        "Jak systemy PDM/PLM wspierają zarządzanie wiedzą?": "Systemy PDM/PLM są skutecznie używane w większości projektów, ale nie zawsze kompleksowo.",
        "Jakie korzyści oprogramowanie KBE i automatyzacja projektowania przynoszą zarządzaniu wiedzą?": "Oprogramowanie KBE i automatyzacja projektowania są regularnie używane, ale nie kompleksowo."
    },
    "Metody": {
        "W jakim stopniu zasady modularyzacji i standaryzacji części są używane w procesie projektowania?": "Zasady modularyzacji i standaryzacji części są stosowane sporadycznie.",
        "W jakim stopniu Design for X (DFX) jest stosowany w odniesieniu do wydajności funkcjonalnej?": "Design for X (DFX) jest stosowany, ale w ograniczonym zakresie w odniesieniu do wydajności funkcjonalnej.",
        "Jak Design for X (DFX) wspiera wydajność jakościową produktu?": "Design for X (DFX) wspiera wydajność jakościową produktu, ale nie jest to powszechne.",
        "W jakim stopniu Design for X (DFX) uwzględnia inne czynniki postrzegalne przez klienta, takie jak estetyka czy ekodesign?": "Design for X (DFX) czasami uwzględnia inne czynniki, takie jak estetyka czy ekodesign, ale nie systematycznie.",
        "Jak skutecznie stosowany jest Design to Cost (DTC) i Target Cost Management (TCM)?": "Design to Cost (DTC) i Target Cost Management (TCM) są stosowane, ale rzadko.",
        "W jakim stopniu Analiza Kosztów Cyklu Życia (LCC) i Calkowity Koszt Posiadania (TCO) są uwzględniane w procesie projektowania?": "Analiza Kosztów Cyklu Życia (LCC) i Calkowity Koszt Posiadania (TCO) są sporadycznie uwzględniane w procesie projektowania.",
        "Jak skutecznie prowadzona jest Analiza i Inżynieria Cyklu Życia (LCA&E)?": "Analiza i Inżynieria Cyklu Życia (LCA&E) jest prowadzona, ale w ograniczonym zakresie.",
        "Jak Analiza i Inżynieria Wartości (VA&E) wspiera proces projektowania?": "Analiza i Inżynieria Wartości (VA&E) nie jest używana w procesie projektowania.",
        "Jak skutecznie Funkcje Jakości (QFD) są stosowane w procesie projektowania?": "Funkcje Jakości (QFD) są stosowane, ale nie we wszystkich projektach.",
        "W jakim stopniu Analiza Rodzajów i Skutków Uszkodzeń (FMEA/FMECA) wspiera rozwój produktu?": "Analiza Rodzajów i Skutków Uszkodzeń (FMEA/FMECA) jest stosowana, ale jej skuteczność jest ograniczona.",
        "W jakim stopniu systematyczne metody innowacji, takie jak TRIZ, są stosowane w procesie projektowania?": "Systematyczne metody innowacji, takie jak TRIZ, są stosowane w ograniczonym zakresie."
    },
    "Komputeryzacja i Oprogramowanie": {
        "W jakim stopniu automatyzacja biurowa (np. arkusze kalkulacyjne, procesory tekstu) wspiera proces rozwoju produktu?": "Automatyzacja biurowa jest sporadycznie używana do wspierania procesu rozwoju produktu.",
        "W jakim stopniu systemy CAD 2D są używane w procesie projektowania?": "Systemy CAD 2D są używane w ograniczonym zakresie w procesie projektowania.",
        "Jakie korzyści systemy CAD 3D przynoszą rozwojowi produktu?": "Systemy CAD 3D są używane, ale nie we wszystkich projektach.",
        "W jakim stopniu modele cyfrowe (DMU) wspierają rozwój produktu?": "Modele cyfrowe (DMU) są używane we wszystkich projektach i mają duży wpływ na rozwój produktu.",
        "W jakim stopniu komputerowe wspomaganie stylizacji (CAS) jest używane w projektach rozwoju produktu?": "Komputerowe wspomaganie stylizacji (CAS) jest używane w większości projektów, ale nie zawsze kompleksowo.",
        "W jakim stopniu komputerowe wspomaganie inżynierii (CAE) wspiera proces projektowania?": "Komputerowe wspomaganie inżynierii (CAE) jest używane, ale nie we wszystkich projektach.",
        "W jakim stopniu metoda analizy elementów skończonych (FEA/FEM) jest używana w procesach projektowania?": "Metoda analizy elementów skończonych (FEA/FEM) nie jest używana do projektowania.",
        "W jakim stopniu obliczeniowa dynamika płynów (CFD) jest używana w projektach?": "Obliczeniowa dynamika płynów (CFD) jest używana, ale nie we wszystkich projektach.",
        "W jakim stopniu KBE i automatyzacja projektowania wspierają procesy projektowania?": "KBE i automatyzacja projektowania są używane, ale ich zastosowanie jest ograniczone.",
        "W jakim stopniu komputerowe wspomaganie produkcji (CAM) jest używane w procesie produkcyjnym?": "Komputerowe wspomaganie produkcji (CAM) jest sporadycznie używane w procesie produkcyjnym.",
        "W jakim stopniu symulacja zdarzeń dyskretnych (DES) wspiera procesy rozwoju produktu?": "Symulacja zdarzeń dyskretnych (DES) jest stosowana we wszystkich projektach i wspiera procesy rozwoju produktu.",
        "W jakim stopniu komputerowe wspomaganie planowania procesów (CAPP)/fabryki cyfrowe wspierają proces rozwoju produktu?": "Komputerowe wspomaganie planowania procesów (CAPP)/fabryki cyfrowe są regularnie używane, ale nie we wszystkich projektach.",
        "W jakim stopniu rzeczywistość wirtualna (VR) i rzeczywistość rozszerzona (AR) są używane w rozwoju produktu?": "Rzeczywistość wirtualna (VR) i rzeczywistość rozszerzona (AR) są stosowane, ale nie we wszystkich projektach.",
        "Jak systemy PDM/PLM wspierają zarządzanie danymi produktu?": "Systemy PDM/PLM są regularnie stosowane w większości projektów, ale nie zawsze kompleksowo.",
        "Jakie korzyści systemy zarządzania dokumentami (DMS) przynoszą projektom?": "Systemy zarządzania dokumentami (DMS) są używane, ale nie zawsze kompleksowo.",
        "W jakim stopniu system zarządzania przepływem pracy (WMS) wspiera zarządzanie projektami?": "System zarządzania przepływem pracy (WMS) jest sporadycznie używany w projektach.",
        "W jakim stopniu planowanie zasobów przedsiębiorstwa (ERP) jest stosowane w procesach rozwoju produktu?": "Planowanie zasobów przedsiębiorstwa (ERP) jest regularnie stosowane, ale nie kompleksowo.",
        "Jak zarządzanie łańcuchem dostaw (SCM) wspiera rozwój produktu?": "Zarządzanie łańcuchem dostaw (SCM) wspiera rozwój produktu, ale nie systematycznie.",
        "W jakim stopniu systemy zarządzania relacjami z klientami (CRM) wpływają na rozwój produktu?": "Systemy zarządzania relacjami z klientami (CRM) mają ograniczony wpływ na rozwój produktu.",
        "Jak systemy zarządzania relacjami z dostawcami (SRM) wspierają proces rozwoju produktu?": "Systemy zarządzania relacjami z dostawcami (SRM) są stosowane, ale nie we wszystkich przypadkach.",
        "W jakim stopniu skomputeryzowany system zarządzania konserwacją (CMMS) jest stosowany w procesach rozwoju produktu?": "Skomputeryzowany system zarządzania konserwacją (CMMS) jest stosowany w ograniczonym zakresie.",
        "W jakim stopniu oprogramowanie do zarządzania projektami wpływa na rozwój produktu?": "Oprogramowanie do zarządzania projektami ma ograniczony wpływ na rozwój produktu."
    }
}