{
  "questionnaire": "OLIMP",
  "questionnaire_title": "OLIMP Model Questionnaire",
  "sections": [
    {
      "section_name": "TECHNOLOGY AND INFRASTRUCTURE",
      "question_count": 10,
      "questions": [
        {
          "question_text": "Czy Twoja organizacja posiada skalowalną infrastrukturę IT wspierającą AI?",
          "answer_options": {
            "A": "Brak skalowalnej infrastruktury, brak uwzględnienia Al",
            "B": "Podstawowa infrastruktura, ale nie skalowalna",
            "C": "Infrastruktura istnieje, ale skalowalność jest ograniczona",
            "D": "Skalowalna infrastruktura, ograniczona integracja Al",
            "E": "W pełni skalowalna infrastruktura zoptymalizowana pod Al"
          },
          "selected_answer": "E"
        },
        {
          "question_text": "Czy technologia generatywnej Al jest zintegrowana z innymi systemami (np. ERP, CRM)?",
          "answer_options": {
            "A": "Brak integracji Al z innymi systemami",
            "B": "Podstawowa integracja w jednym procesie lub systemie",
            "C": "Częściowa integracja z kluczowymi systemami (np. ERP)",
            "D": "Integracja z większością systemów, z pewnymi lukami",
            "E": "W pełni zintegrowana generatywna Al we wszystkich głównych systemach"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Na ile zautomatyzowane jest wdrażanie modeli generatywnej AI?",
          "answer_options": {
            "A": "Brak automatyzacji, ręczne wdrażanie",
            "B": "Podstawowa automatyzacja małych modeli",
            "C": "Częściowa automatyzacja z pewną ingerencją człowieka",
            "D": "W dużej mierze zautomatyzowane, sporadyczna ingerencja",
            "E": "W pełni zautomatyzowane wdrażanie modeli generatywnej Al"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Czy organizacja korzysta z chmury do przechowywania i przetwarzania danych AI?",
          "answer_options": {
            "A": "Brak wykorzystania chmury dla Al, dane przechowywane lokalnie",
            "B": "Minimalne korzystanie z chmury do przechowywania danych",
            "C": "Częściowa adopcja chmury do przechowywania i przetwarzania danych",
            "D": "Większość danych Al przechowywana i przetwarzana w chmurze",
            "E": "Pełna adopcja chmury dla wszystkich działań związanych z Al"
          },
          "selected_answer": "D"
        },
        {
          "question_text": "Czy organizacja korzysta z narzędzi do zarządzania cyklem życia modeli AI?",
          "answer_options": {
            "A": "Brak narzędzi do zarządzania cyklem życia modeli Al",
            "B": "Podstawowe narzędzia, ale niedostatecznie wykorzystywane",
            "C": "Niektóre narzędzia wykorzystywane, brak standaryzacji",
            "D": "Standaryzowane narzędzia dla większości procesów Al",
            "E": "W pełni wdrożone i zoptymalizowane narzędzia do zarządzania cyklem życia modeli Al"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Czy infrastruktura organizacji jest przygotowana do obsługi dużych zbiorów danych dla AI?",
          "answer_options": {
            "A": "Nie jest w stanie obsłużyć dużych zbiorów danych",
            "B": "Podstawowa infrastruktura z ograniczoną pojemnością",
            "C": "Infrastruktura obsługuje umiarkowanie duże zbiory danych",
            "D": "Infrastruktura obsługuje większość dużych zbiorów danych",
            "E": "Zoptymalizowana infrastruktura do obsługi ogromnych zbiorów danych"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy organizacja jest zdolna do przetwarzania danych w czasie rzeczywistym dla AI?",
          "answer_options": {
            "A": "Brak przetwarzania danych w czasie rzeczywistym",
            "B": "Podstawowe przetwarzanie wsadowe",
            "C": "Przetwarzanie danych w czasie rzeczywistym dla niektórych zadań",
            "D": "Przetwarzanie danych w czasie rzeczywistym, z niewielkimi opóźnieniami",
            "E": "W pełni zoptymalizowane przetwarzanie danych w czasie rzeczywistym dla wszystkich zadań Al"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Czy Twoja organizacja posiada moc obliczeniową niezbędną do wdrażania i utrzymania modeli Al?",
          "answer_options": {
            "A": "Brak mocy obliczeniowej dla wdrożenia i utrzymania modeli Al",
            "B": "Podstawowa moc obliczeniowa, wystarczająca dla małych modeli",
            "C": "Umiarkowana moc obliczeniowa, wystarczająca dla niektórych modeli",
            "D": "Wysoka moc obliczeniowa, wystarczająca dla większości aplikacji Al",
            "E": "Zaawansowana moc obliczeniowa zoptymalizowana pod potrzeby Al"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Czy w codziennej pracy wykorzystywane są wewnętrzne lub zewnętrzne narzędzia Al (np. ChatGPT, MS Copilot)?",
          "answer_options": {
            "A": "Brak narzędzi Al w codziennych zadaniach",
            "B": "Podstawowe wykorzystanie narzędzi Al do wybranych zadań",
            "C": "Niektóre narzędzia Al wykorzystywane, ale nie powszechnie",
            "D": "Narzędzia Al wykorzystywane w większości działów do różnych zadań",
            "E": "W pełni zintegrowane narzędzia Al w codziennej pracy w całej organizacji"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Jak skalowalne są rozwiązania generatywnej Al w Twojej organizacji?",
          "answer_options": {
            "A": "Brak skalowalności rozwiązań Al",
            "B": "Ograniczona skalowalność",
            "C": "Umiarkowana skalowalność dla niektórych rozwiązań",
            "D": "Większość rozwiązań Al jest skalowalna",
            "E": "W pełni skalowalne rozwiązania Al wdrożone w całej organizacji"
          },
          "selected_answer": "B"
        }
      ]
    },
    {
      "section_name": "DATA",
      "question_count": 9,
      "questions": [
        {
          "question_text": "Czy Twoja organizacja buduje wysokiej jakości zbiory danych?",
          "answer_options": {
            "A": "Brak systematycznego budowania zbiorów danych",
            "B": "Sporadyczne działania w kierunku poprawy jakości danych",
            "C": "Budowanie zbiorów danych z umiarkowaną jakością",
            "D": "Zbiory danych wysokiej jakości dla większości procesów",
            "E": "W pełni zoptymalizowane zbiory danych o najwyższej jakości"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Na ile Twoja organizacja automatyzuje analizę i przetwarzanie danych?",
          "answer_options": {
            "A": "Brak automatyzacji analiz i przetwarzania danych",
            "B": "Podstawowa automatyzacja w kilku obszarach",
            "C": "Częściowa automatyzacja dla niektórych procesów",
            "D": "Wysoka automatyzacja analiz i przetwarzania danych",
            "E": "W pełni zautomatyzowane procesy analizy i przetwarzania danych"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy Twoja organizacja centralizuje zbiory danych (np. jeden słownik danych)?",
          "answer_options": {
            "A": "Brak centralizacji zbiorów danych",
            "B": "Centralizacja w kilku wybranych obszarach",
            "C": "Częściowa centralizacja z danymi w różnych systemach",
            "D": "Większość danych zcentralizowana, kilka wyjątków",
            "E": "Pełna centralizacja danych, jeden słownik danych w całej organizacji"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy organizacja korzysta z zaawansowanych narzędzi do oceny jakości danych?",
          "answer_options": {
            "A": "Brak narzędzi do oceny jakości danych",
            "B": "Podstawowe narzędzia, ale rzadko używane",
            "C": "Częściowe wykorzystanie narzędzi do oceny jakości",
            "D": "Narzędzia do oceny jakości danych wykorzystywane w większości przypadków",
            "E": "W pełni zoptymalizowane narzędzia do oceny jakości danych"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy Twoja organizacja ma strategię zarządzania danymi?",
          "answer_options": {
            "A": "Brak strategii zarządzania danymi",
            "B": "Podstawowa strategia, ale niekompletnie wdrożona",
            "C": "Strategia zarządzania danymi stosowana w wybranych obszarach",
            "D": "Strategia zarządzania danymi wdrożona w większości procesów",
            "E": "W pełni wdrożona i zoptymalizowana strategia zarządzania danymi"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Na ile Twoja organizacja automatyzuje proces zbierania i czyszczenia danych?",
          "answer_options": {
            "A": "Brak automatyzacji, dane zbierane i czyszczone ręcznie",
            "B": "Podstawowa automatyzacja niektórych etapów procesu",
            "C": "Częściowa automatyzacja zbierania i czyszczenia danych",
            "D": "Automatyzacja dla większości procesów zbierania i czyszczenia danych",
            "E": "Pełna automatyzacja procesów zbierania i czyszczenia danych"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy organizacja identyfikuje i integruje dane z wewnętrznych i zewnętrznych źródeł?",
          "answer_options": {
            "A": "Brak identyfikacji i integracji danych z różnych źródeł",
            "B": "Dane zidentyfikowane, ale nie w pełni zintegrowane",
            "C": "Częściowa integracja danych z wybranych źródeł",
            "D": "Większość danych zidentyfikowana i zintegrowana",
            "E": "W pełni zintegrowane dane z wewnętrznych i zewnętrznych źródeł"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy organizacja posiada jeden standardowy model danych i zestaw metadanych?",
          "answer_options": {
            "A": "Brak standardowego modelu danych",
            "B": "Podstawowy model danych wdrożony w niektórych obszarach",
            "C": "Częściowe wdrożenie modelu danych i metadanych",
            "D": "Większość procesów oparta na jednym modelu danych",
            "E": "W pełni wdrożony jeden standardowy model danych i zbiór metadanych"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy Twoja organizacja korzysta z generatywnej Al do wspomagania wizualizacji danych?",
          "answer_options": {
            "A": "Brak użycia generatywnej Al do wizualizacji danych",
            "B": "Podstawowe wykorzystanie Al do prostych wizualizacji",
            "C": "Częściowe wykorzystanie generatywnej Al w wybranych obszarach",
            "D": "generatywna Al wykorzystywana do większości wizualizacji danych",
            "E": "W pełni zintegrowane narzędzia Al do wspomagania wizualizacji danych"
          },
          "selected_answer": "C"
        }
      ]
    },
    {
      "section_name": "PEOPLE AND COMPETENCIES",
      "question_count": 6,
      "questions": [
        {
          "question_text": "Czy Twoja organizacja rozwija świadomość i zrozumienie rozwiązań generatywnej AI?",
          "answer_options": {
            "A": "Brak świadomości rozwiązań generatywnej Al",
            "B": "Podstawowa świadomość wśród wybranych zespołów",
            "C": "Częściowe zrozumienie i świadomość w wybranych obszarach",
            "D": "Świadomość i zrozumienie w większości działów",
            "E": "Pełne zrozumienie i świadomość generatywnej Al w całej organizacji"
          },
          "selected_answer": "D"
        },
        {
          "question_text": "Czy organizacja szkoli zespoły w zakresie programowania (także promptingu) i analizy danych?",
          "answer_options": {
            "A": "Brak szkoleń z programowania i analizy danych",
            "B": "Podstawowe szkolenia w wybranych zespołach",
            "C": "Częściowe szkolenia, ale ograniczone do kilku zespołów",
            "D": "Regularne szkolenia obejmujące większość zespołów",
            "E": "W pełni rozwinięty program szkoleń dla wszystkich zespołów w zakresie Al i analizy danych"
          },
          "selected_answer": "D"
        },
        {
          "question_text": "Czy Twoja organizacja tworzy interdyscyplinarne zespoły ds. AI?",
          "answer_options": {
            "A": "Brak interdyscyplinarnych zespołów ds. Al",
            "B": "Tworzenie zespołów w niektórych projektach",
            "C": "Częściowe tworzenie zespołów, ale nie w każdej inicjatywie",
            "D": "Większość projektów posiada interdyscyplinarne zespoły",
            "E": "W pełni zintegrowane interdyscyplinarne zespoły ds. Al we wszystkich projektach"
          },
          "selected_answer": "D"
        },
        {
          "question_text": "Czy organizacja angażuje zewnętrznych konsultantów ds. generatywnej Al do zespołów?",
          "answer_options": {
            "A": "Brak angażowania zewnętrznych konsultantów",
            "B": "Sporadyczne zaangażowanie konsultantów do pojedynczych projektów",
            "C": "Konsultanci zewnętrzni angażowani przy wybranych projektach",
            "D": "Regularne angażowanie konsultantów do kluczowych inicjatyw",
            "E": "W pełni zintegrowane wsparcie konsultantów Al we wszystkich istotnych projektach"
          },
          "selected_answer": "D"
        },
        {
          "question_text": "Czy Twoja organizacja szkoli w zakresie zarządzania projektami opartymi o generatywną Al?",
          "answer_options": {
            "A": "Brak szkoleń z zarządzania projektami opartymi o generatywną Al",
            "B": "Podstawowe szkolenia dla wybranych osób",
            "C": "Częściowe szkolenia z zarządzania projektami dla wybranych zespołów",
            "D": "Regularne szkolenia w zakresie projektów opartych o generatywną Al",
            "E": "Pełny program szkoleń z zarządzania projektami generatywnymi Al dla wszystkich odpowiednich zespołów"
          },
          "selected_answer": "D"
        },
        {
          "question_text": "Czy istnieje zarządzanie wiedzą w dziedzinie generatywnej Al, aby ułatwić transfer wiedzy między wszystkimi pracownikami?",
          "answer_options": {
            "A": "Pracownicy utrzymują własne bazy wiedzy i nie dzielą się nimi z innymi.",
            "B": "Istnieją różne platformy, ale nie są one dobrze zorganizowane, co utrudnia pracownikom dostęp do istniejącej wiedzy.",
            "C": "Centralna platforma jest w trakcie budowy i jest używana przez poszczególnych pracowników do zarządzania wiedzą.",
            "D": "Scentralizowana platforma jest dostępna dla wszystkich pracowników, ale nie wszyscy z niej korzystają.",
            "E": "Scentralizowana platforma do gromadzenia wiedzy jest używana przez wszystkich pracowników i jest stale rozbudowywana."
          },
          "selected_answer": "D"
        }
      ]
    },
    {
      "section_name": "ORGANIZATION AND PROCESSES",
      "question_count": 7,
      "questions": [
        {
          "question_text": "Czy Twoja organizacja integruje Al z istniejącymi procesami rozwoju nowego produktu?",
          "answer_options": {
            "A": "Brak integracji Al w procesach rozwoju nowego produktu",
            "B": "Podstawowa integracja w procesach rozwoju wybranych produktów",
            "C": "Częściowa integracja w procesach rozwoju kilku produktów",
            "D": "Integracja Al w procesów rozwoju większości produktów",
            "E": "Pełna integracja Al w procesach rozwoju wszystkich produktów"
          },
          "selected_answer": "E"
        },
        {
          "question_text": "Na ile Twoja organizacja automatyzuje procesy rozwoju produktu z wykorzystaniem generatywnej AI?",
          "answer_options": {
            "A": "Brak automatyzacji procesów rozwoju produktu z Al",
            "B": "Podstawowa automatyzacja wybranych etapów rozwoju produktu",
            "C": "Częściowa automatyzacja procesów rozwoju produktu",
            "D": "Automatyzacja większości procesów rozwoju produktu",
            "E": "W pełni zautomatyzowane procesy rozwoju produktu z wykorzystaniem Al"
          },
          "selected_answer": "E"
        },
        {
          "question_text": "Czy organizacja wykorzystuje Al do wsparcia podejmowania decyzji?",
          "answer_options": {
            "A": "Brak wykorzystania Al do wsparcia podejmowania decyzji",
            "B": "Sporadyczne wykorzystanie Al w wybranych decyzjach",
            "C": "Al wspiera podejmowanie decyzji w ograniczonym zakresie",
            "D": "Al wspiera większość decyzji w kluczowych obszarach",
            "E": "Al zintegrowana we wszystkich procesach decyzyjnych organizacji"
          },
          "selected_answer": "E"
        },
        {
          "question_text": "Czy organizacja wdraża narzędzia wspierające pracę zespołów AI?",
          "answer_options": {
            "A": "Brak narzędzi wspierających pracę zespołów Al",
            "B": "Podstawowe narzędzia, ale nie są powszechnie używane",
            "C": "Częściowe wdrożenie narzędzi wspierających pracę zespołów Al",
            "D": "Narzędzia Al wspierają pracę większości zespołów",
            "E": "W pełni wdrożone narzędzia Al wspierające codzienną pracę zespołów"
          },
          "selected_answer": "E"
        },
        {
          "question_text": "Czy organizacja wprowadza cykle ciągłego doskonalenia we wdrażaniu rozwiązań generatywnej Al?",
          "answer_options": {
            "A": "Brak cykli ciągłego doskonalenia",
            "B": "Sporadyczne działania w kierunku doskonalenia procesów",
            "C": "Cykle doskonalenia w wybranych procesach Al",
            "D": "Doskonalenie wdrożeń Al w większości projektów",
            "E": "W pełni wdrożone cykle ciągłego doskonalenia dla wszystkich wdrożeń Al"
          },
          "selected_answer": "E"
        },
        {
          "question_text": "Czy organizacja zdefiniowała proces zarządzania cyklem życia dla oprogramowania AI?",
          "answer_options": {
            "A": "Brak zdefiniowanego procesu zarządzania cyklem życia oprogramowania",
            "B": "Proces częściowo zdefiniowany, ale niespójnie realizowany",
            "C": "Zdefiniowany proces zarządzania cyklem życia w kilku projektach",
            "D": "Zdefiniowany proces zarządzania cyklem życia w większości projektów",
            "E": "Pełny proces zarządzania cyklem życia dla oprogramowania Al wdrożony we wszystkich projektach"
          },
          "selected_answer": "E"
        },
        {
          "question_text": "Czy organizacja posiada przewodnik po procesie rozwoju produktu opartym o generatywną AI?",
          "answer_options": {
            "A": "Brak przewodnika Al po procesie rozwoju produktu",
            "B": "Podstawowy przewodnik opracowany, ale rzadko używany",
            "C": "Przewodnik częściowo wdrożony w kilku projektach",
            "D": "Przewodnik po procesie rozwoju produktu stosowany w większości projektów",
            "E": "W pełni wdrożony przewodnik Al po procesie rozwoju produktu w całej organizacji"
          },
          "selected_answer": "E"
        }
      ]
    },
    {
      "section_name": "STRATEGY AND MANAGEMENT",
      "question_count": 6,
      "questions": [
        {
          "question_text": "Czy Twoja organizacja opracowała długoterminową strategię inwestycji w generatywną AI?",
          "answer_options": {
            "A": "Brak strategii inwestycji w generatywną Al",
            "B": "Podstawowa strategia, ale ograniczona do krótkiego okresu",
            "C": "Strategia istnieje, ale nie jest w pełni wdrożona",
            "D": "Strategia długoterminowa jest wdrożona w większości obszarów",
            "E": "W pełni wdrożona, długoterminowa strategia inwestycji w generatywną Al"
          },
          "selected_answer": "E"
        },
        {
          "question_text": "Czy strategia Al jest wdrożona w rozwój produktów?",
          "answer_options": {
            "A": "Brak wdrożenia strategii Al w rozwój produktów",
            "B": "Wdrożenie tylko w pojedynczych produktach",
            "C": "Częściowe wdrożenie strategii Al w rozwój produktów",
            "D": "Strategia Al wdrożona w większości produktów",
            "E": "Pełne wdrożenie strategii Al we wszystkich produktach organizacji"
          },
          "selected_answer": "E"
        },
        {
          "question_text": "Czy Twoja organizacja określiła cele strategiczne dla generatywnej Al?",
          "answer_options": {
            "A": "Brak celów strategicznych dla generatywnej Al",
            "B": "Podstawowe cele, ale bez precyzyjnej realizacji",
            "C": "Cele zdefiniowane, ale nie w pełni realizowane",
            "D": "Cele strategiczne dla Al realizowane w większości obszarów",
            "E": "W pełni wdrożone i realizowane cele strategiczne dla generatywnej Al"
          },
          "selected_answer": "E"
        },
        {
          "question_text": "Czy organizacja ocenia wpływ biznesowy i wykonalność rozwiązań generatywnej Al z wyprzedzeniem?",
          "answer_options": {
            "A": "Brak oceny wpływu biznesowego i wykonalności rozwiązań Al",
            "B": "Ocena przeprowadzana jedynie w wybranych przypadkach",
            "C": "Częściowa ocena wpływu biznesowego i wykonalności",
            "D": "Regularna ocena dla większości projektów",
            "E": "W pełni systematyczna ocena wpływu biznesowego i wykonalności dla wszystkich rozwiązań Al"
          },
          "selected_answer": "E"
        },
        {
          "question_text": "Czy Twoja organizacja opracowała system monitorowania wyników wdrożenia AI?",
          "answer_options": {
            "A": "Brak systemu monitorowania wyników wdrożenia Al",
            "B": "Podstawowy system monitorowania, ale niedostatecznie wdrożony",
            "C": "Częściowy system monitorowania wyników w wybranych projektach",
            "D": "System monitorowania wyników wdrożenia Al działa w większości obszarów",
            "E": "W pełni wdrożony, zaawansowany system monitorowania wyników Al"
          },
          "selected_answer": "E"
        },
        {
          "question_text": "Czy organizacja analizuje konkurencję pod względem ich zdolności do wdrożeń generatywnej AI?",
          "answer_options": {
            "A": "Brak analiz konkurencji dotyczących Al",
            "B": "Sporadyczne analizy konkurencji dotyczące Al",
            "C": "Częściowe analizy, ale nie regularne",
            "D": "Regularne analizy konkurencji pod kątem wdrożeń Al",
            "E": "W pełni zintegrowane analizy konkurencji dotyczące generatywnej Al we wszystkich strategicznych obszarach"
          },
          "selected_answer": "E"
        }
      ]
    },
    {
      "section_name": "BUDGET",
      "question_count": 5,
      "questions": [
        {
          "question_text": "Czy Twoja organizacja prowadzi długoterminowe planowanie budżetu na rozwój rozwiązań i infrastruktury wspierającej generatywną AI?",
          "answer_options": {
            "A": "Brak planowania budżetu na rozwój rozwiązań generatywnej Al",
            "B": "Krótkoterminowe planowanie budżetowe w wybranych projektach",
            "C": "Częściowe planowanie długoterminowe, ograniczone do niektórych projektów",
            "D": "Długoterminowe planowanie budżetowe w większości projektów",
            "E": "Pełne długoterminowe planowanie budżetu na wszystkie projekty i infrastrukturę Al"
          },
          "selected_answer": "A"
        },
        {
          "question_text": "Czy Twoja organizacja przeznacza środki na rozwój kompetencji pracowników w zakresie generatywnej AI?",
          "answer_options": {
            "A": "Brak środków na rozwój kompetencji pracowników w zakresie Al",
            "B": "Sporadyczne finansowanie szkoleń dla wybranych pracowników",
            "C": "Częściowe przeznaczanie środków na rozwój kompetencji",
            "D": "Stałe finansowanie rozwoju kompetencji większości pracowników",
            "E": "Pełne finansowanie rozwoju kompetencji w zakresie Al dla wszystkich pracowników"
          },
          "selected_answer": "A"
        },
        {
          "question_text": "Czy Twoja organizacja finansuje projekty pilotażowe i innowacyjne związane z generatywną AI?",
          "answer_options": {
            "A": "Brak finansowania projektów pilotażowych związanych z Al",
            "B": "Ograniczone finansowanie pojedynczych projektów",
            "C": "Częściowe finansowanie projektów pilotażowych i innowacyjnych",
            "D": "Regularne finansowanie większości projektów pilotażowych",
            "E": "Pełne wsparcie finansowe dla wszystkich projektów pilotażowych i innowacyjnych związanych z Al"
          },
          "selected_answer": "A"
        },
        {
          "question_text": "Czy organizacja alokuje środki na zewnętrzne konsultacje dotyczące generatywnej AI?",
          "answer_options": {
            "A": "Brak alokacji środków na zewnętrzne konsultacje dotyczące Al",
            "B": "Sporadyczne alokowanie środków na konsultacje w wybranych projektach",
            "C": "Częściowa alokacja środków na zewnętrzne konsultacje",
            "D": "Regularna alokacja środków na konsultacje w większości projektów",
            "E": "Pełna alokacja środków na zewnętrzne konsultacje we wszystkich strategicznych projektach"
          },
          "selected_answer": "A"
        },
        {
          "question_text": "Czy organizacja priorytetyzuje projekty generujące wysoką wartość dodaną dzięki generatywnej AI?",
          "answer_options": {
            "A": "Brak priorytetyzacji projektów związanych z Al",
            "B": "Priorytetyzacja jedynie wybranych projektów",
            "C": "Częściowa priorytetyzacja projektów generujących wartość dodaną",
            "D": "Regularna priorytetyzacja większości projektów związanych z Al",
            "E": "Pełna priorytetyzacja projektów Al o najwyższej wartości dodanej"
          },
          "selected_answer": "A"
        }
      ]
    },
    {
      "section_name": "PRODUCTS AND SERVICES",
      "question_count": 11,
      "questions": [
        {
          "question_text": "Czy Twoja organizacja wykorzystuje generatywną Al do wspomagania lub automatyzacji procesów projektowania i wytwarzania produktów?",
          "answer_options": {
            "A": "Brak wykorzystania Al w procesach projektowania i wytwarzania produktów",
            "B": "Minimalne wykorzystanie Al w wybranych procesach",
            "C": "Częściowe wykorzystanie Al do automatyzacji procesów",
            "D": "Al wspiera większość procesów projektowania i wytwarzania",
            "E": "Pełne wykorzystanie Al w automatyzacji procesów"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Czy Twoja organizacja korzysta z generatywnej Al do personalizacji produktów?",
          "answer_options": {
            "A": "Brak wykorzystania Al do personalizacji produktów",
            "B": "Sporadyczne wykorzystanie Al do podstawowej personalizacji",
            "C": "Al stosowana do personalizacji w wybranych produktach",
            "D": "Personalizacja większości produktów z wykorzystaniem Al",
            "E": "Pełna personalizacja produktów przy wsparciu Al"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Czy organizacja korzysta z generatywnej Al do generowania pomysłów związanych z produktami (np. analiza sentymentu, analiza opinii)?",
          "answer_options": {
            "A": "Brak generowania pomysłów z wykorzystaniem Al",
            "B": "Sporadyczne generowanie pomysłów w wybranych projektach",
            "C": "Częściowe generowanie pomysłów z wykorzystaniem Al",
            "D": "Generowanie pomysłów w większości procesów rozwoju produktów",
            "E": "Pełne wykorzystanie Al do generowania pomysłów i analiz opinii dla produktów"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Czy Twoja organizacja wykorzystuje generatywną Al do wspomagania redukcji informacji (np. streszczenia tekstów)?",
          "answer_options": {
            "A": "Brak wykorzystania Al do redukcji informacji",
            "B": "Sporadyczne wykorzystanie Al w wybranych przypadkach",
            "C": "Częściowe wykorzystanie Al do redukcji informacji",
            "D": "Al stosowana regularnie do redukcji informacji w większości projektów",
            "E": "Pełne wykorzystanie Al do redukcji informacji we wszystkich obszarach"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Czy organizacja wspomaga ocenę koncepcji produktów przy użyciu generatywnej AI?",
          "answer_options": {
            "A": "Brak wspomagania oceny koncepcji przy użyciu Al",
            "B": "Sporadyczne wsparcie oceny koncepcji w wybranych projektach",
            "C": "Częściowe wykorzystanie Al do oceny koncepcji",
            "D": "Al wspiera ocenę koncepcji w większości projektów",
            "E": "Pełne wsparcie oceny koncepcji produktów z wykorzystaniem Al"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Czy Twoja organizacja wykorzystuje generatywną Al do skrócenia czasu testowania produktów?",
          "answer_options": {
            "A": "Brak wykorzystania Al do skracania czasu testowania",
            "B": "Al sporadycznie wykorzystywana w wybranych testach",
            "C": "Częściowe wykorzystanie Al do skracania czasu testów",
            "D": "Al stosowana regularnie do skracania czasu testowania produktów",
            "E": "Pełne wykorzystanie Al do maksymalnego skrócenia czasu testowania produktów"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Czy organizacja wspiera marketing produktowy z wykorzystaniem generatywnej Al (np. tworzenie reklam, słów kluczowych, filmów promocyjnych)?",
          "answer_options": {
            "A": "Brak wykorzystania Al do marketingu produktowego",
            "B": "Sporadyczne wykorzystanie Al w pojedynczych kampaniach",
            "C": "Częściowe wykorzystanie Al w wybranych aspektach marketingu",
            "D": "Al wspiera marketing większości produktów",
            "E": "Pełne wykorzystanie Al do wspomagania marketingu produktowego (tworzenie reklam, kampanii, analiz)"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Czy Twoja organizacja wykorzystuje generatywną Al do doskonalenia systemów rekomendacji produktów?",
          "answer_options": {
            "A": "Brak wykorzystania Al w systemach rekomendacji produktów",
            "B": "Podstawowe wykorzystanie Al do rekomendacji w wybranych obszarach",
            "C": "Częściowe wykorzystanie Al do rekomendacji produktów",
            "D": "Al regularnie wspiera systemy rekomendacji w większości procesów",
            "E": "Pełne wykorzystanie Al do optymalizacji systemów rekomendacji produktów"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Czy organizacja doskonali działanie baz danych produktów z wykorzystaniem generatywnej AI?",
          "answer_options": {
            "A": "Brak doskonalenia baz danych produktów przy użyciu Al",
            "B": "Podstawowe wykorzystanie Al w wybranych obszarach",
            "C": "Częściowe doskonalenie baz danych produktów z wykorzystaniem Al",
            "D": "Al wspiera doskonalenie baz danych produktów w większości obszarów",
            "E": "Pełne wykorzystanie Al do doskonalenia baz danych produktów"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Czy Twoja organizacja wykorzystuje generatywną Al jako komponent profesjonalnych aplikacji?",
          "answer_options": {
            "A": "Brak wykorzystania Al jako komponentu aplikacji",
            "B": "Al wykorzystywana jedynie w podstawowych aplikacjach",
            "C": "Częściowe wykorzystanie Al w wybranych profesjonalnych aplikacjach",
            "D": "Al wspiera działanie większości profesjonalnych aplikacji",
            "E": "Pełne wykorzystanie Al jako kluczowego komponentu profesjonalnych aplikacji"
          },
          "selected_answer": "B"
        },
        {
          "question_text": "Czy organizacja poszukuje nowych przypadków użycia rozwiązań generatywnej AI?",
          "answer_options": {
            "A": "Brak poszukiwań nowych przypadków użycia Al",
            "B": "Sporadyczne poszukiwania nowych przypadków użycia",
            "C": "Częściowe poszukiwanie nowych przypadków użycia Al",
            "D": "Regularne poszukiwanie nowych przypadków użycia Al",
            "E": "Pełne zaangażowanie w poszukiwanie nowych przypadków użycia generatywnej Al we wszystkich obszarach"
          },
          "selected_answer": "B"
        }
      ]
    },
    {
      "section_name": "ETHICS AND REGULATIONS",
      "question_count": 10,
      "questions": [
        {
          "question_text": "Czy Twoja organizacja przestrzega zasad etyki w projektowaniu generatywnej AI?",
          "answer_options": {
            "A": "Brak uwzględnienia zasad etyki w projektowaniu Al",
            "B": "Sporadyczne uwzględnienie etyki w wybranych projektach",
            "C": "Częściowe uwzględnienie zasad etyki w niektórych projektach",
            "D": "Większość projektów uwzględnia zasady etyki",
            "E": "W pełni uwzględnione zasady etyki we wszystkich projektach Al"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy Twoja organizacja zapewnia bezpieczeństwo i prywatność danych związanych z rozwojem produktów?",
          "answer_options": {
            "A": "Brak systemu zapewniającego bezpieczeństwo i prywatność danych",
            "B": "Podstawowe środki bezpieczeństwa wdrożone w wybranych projektach",
            "C": "Częściowe wdrożenie polityki bezpieczeństwa i prywatności danych",
            "D": "Większość projektów przestrzega polityk bezpieczeństwa i prywatności danych",
            "E": "W pełni wdrożone systemy bezpieczeństwa i prywatności danych dla wszystkich projektów"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy Twoja organizacja dba o zaufanie do danych i możliwość ich wyjaśnienia?",
          "answer_options": {
            "A": "Brak mechanizmów budowania zaufania do danych",
            "B": "Minimalne działania w zakresie zaufania i możliwości wyjaśnienia danych",
            "C": "Częściowe wdrożenie mechanizmów budujących zaufanie i możliwości wyjaśnienia",
            "D": "Większość danych posiada mechanizmy możliwości wyjaśnienia",
            "E": "Pełne zaufanie do danych i mechanizmy możliwości wyjaśnienia wdrożone we wszystkich procesach"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy organizacja wdraża standardy ochrony i mechanizmy dotyczące kopii zapasowych danych?",
          "answer_options": {
            "A": "Brak standardów ochrony i mechanizmów kopii zapasowych",
            "B": "Podstawowe mechanizmy wprowadzane w wybranych obszarach",
            "C": "Częściowe wdrożenie mechanizmów ochrony i kopii zapasowych",
            "D": "Większość obszarów objęta standardami ochrony i kopiami zapasowymi danych",
            "E": "W pełni wdrożone standardy ochrony i mechanizmy kopii zapasowych we wszystkich obszarach"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy Twoja organizacja przeciwdziała uprzedzeniom i niesprawiedliwości w algorytmach generatywnej Al?",
          "answer_options": {
            "A": "Brak działań w zakresie przeciwdziałania uprzedzeniom",
            "B": "Podstawowe działania w zakresie eliminacji uprzedzeń",
            "C": "Częściowe wdrożenie działań przeciwdziałających uprzedzeniom w algorytmach",
            "D": "Większość algorytmów jest weryfikowana pod kątem uprzedzeń",
            "E": "Pełna eliminacja uprzedzeń i niesprawiedliwości w algorytmach Al"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy organizacja regularnie ocenia zgodność algorytmów generatywnej Al z regulacjami prawnymi?",
          "answer_options": {
            "A": "Brak oceny zgodności algorytmów z regulacjami",
            "B": "Sporadyczne oceny zgodności z przepisami w wybranych projektach",
            "C": "Częściowe wdrożenie procedur oceny zgodności algorytmów",
            "D": "Większość algorytmów jest regularnie weryfikowana pod kątem zgodności z regulacjami",
            "E": "W pełni wdrożone procedury regularnej oceny zgodności algorytmów Al z przepisami"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy Twoja organizacja tworzy systemy audytu decyzji podejmowanych przez generatywną AI?",
          "answer_options": {
            "A": "Brak systemów audytu decyzji podejmowanych przez Al",
            "B": "Podstawowe systemy audytu wprowadzane w wybranych projektach",
            "C": "Częściowe wdrożenie systemów audytu decyzji Al",
            "D": "Systemy audytu funkcjonują dla większości decyzji Al",
            "E": "W pełni wdrożone systemy audytu i odpowiedzialności za decyzje podejmowane przez Al"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy Twoja organizacja poszerza świadomość dotyczącą ochrony danych wśród pracowników?",
          "answer_options": {
            "A": "Brak programów edukacyjnych dotyczących ochrony danych",
            "B": "Podstawowe programy szkoleniowe, ale ograniczone do wybranych zespołów",
            "C": "Częściowe programy szkoleniowe dla wybranych zespołów",
            "D": "Regularne szkolenia w zakresie ochrony danych w większości zespołów",
            "E": "Pełne programy edukacyjne dotyczące ochrony danych dla wszystkich pracowników"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy organizacja wykorzystuje technologie dotyczące cyberbezpieczeństwa?",
          "answer_options": {
            "A": "Brak wykorzystania technologii cyberbezpieczeństwa",
            "B": "Podstawowe technologie wdrożone w wybranych obszarach",
            "C": "Częściowe wdrożenie technologii cyberbezpieczeństwa",
            "D": "Większość obszarów objęta technologiami cyberbezpieczeństwa",
            "E": "W pełni wdrożone technologie cyberbezpieczeństwa we wszystkich obszarach organizacji"
          },
          "selected_answer": "C"
        },
        {
          "question_text": "Czy Twoja organizacja utrzymuje dokumentację dotyczącą użycia generatywnej Al (np. przypadki użycia, logi systemowe, kontrola wersji)?",
          "answer_options": {
            "A": "Brak dokumentacji dotyczącej użycia Al",
            "B": "Sporadyczne dokumentowanie wybranych przypadków użycia",
            "C": "Częściowa dokumentacja dla wybranych obszarów",
            "D": "Dokumentacja prowadzona regularnie w większości przypadków",
            "E": "Pełna i bieżąca dokumentacja dotycząca wszystkich przypadków użycia Al"
          },
          "selected_answer": "C"
        }
      ]
    }
  ]
}