{
    "Roles and Collaboration": {
        "How is the cross-functional team involved in the product development process?": "The cross-functional team does not exist in the product development process.",
        "How are all stakeholders engaged in the project team, even when they are globally dispersed?": "Some stakeholders are engaged, but only locally.",
        "How clearly defined are the roles and responsibilities of each individual?": "Roles and responsibilities are defined, but often not clear or understood by everyone.",
        "How is high flexibility in task execution ensured in the project?": "Flexibility in task execution is possible, but not for all team members.",
        "What is the technical background and engagement level of the product managers in the projects?": "Most product managers have an appropriate technical background and are engaged in the projects.",
        "How fully is the customer engaged in the product development process?": "The customer is not engaged in the product development process.",
        "Are experienced designers engaged from the earliest stages of the project?": "Experienced designers are engaged, but only sporadically in the early stages."
    },
    "Training": {
        "How formal programs support the development of interdisciplinary skills?": "There are no formal training programs.",
        "How are individual tutoring sessions offered to support skill development?": "Tutoring sessions are available in a limited scope and for selected employees.",
        "How are KPIs used to evaluate training outcomes?": "KPIs are not used to evaluate training outcomes."
    },
    "Activities and Flow": {
        "To what extent is a formal product development model followed and documented?": "There is no formal product development model.",
        "To what extent is collaboration a part of the product development process?": "Collaboration exists but is limited to a few key stages.",
        "How effectively is a comprehensive set of KPIs used to measure product development performance?": "There is no comprehensive set of KPIs.",
        "At what level is frontloading implemented in the product development process?": "Frontloading is applied in most projects, but not always effectively.",
        "To what extent are continuous improvement initiatives undertaken?": "Continuous improvement initiatives are undertaken, but rarely.",
        "How effectively are various solutions designed and poorer solutions eliminated as new information arises?": "Various solutions are designed, but the elimination of weaker options is unsystematic.",
        "To what extent does the product development process focus on customer value?": "The process partially focuses on customer value, but it is not a priority.",
        "How is the competitive analysis process (reverse engineering) implemented?": "The competitive analysis process is implemented but to a limited extent."
    },
    "Decision-Making": {
        "How is the process of designing and industrializing parts and modules considered?": "The design and industrialization process is occasionally considered.",
        "To what extent is the component and semi-finished product manufacturing process considered?": "The manufacturing process for components and semi-finished products is occasionally considered.",
        "At what level is the assembly process of components taken into account in product development?": "The component assembly process is occasionally considered.",
        "How important is the testing and experimentation process in product development?": "The testing and experimentation process is considered in most cases, but its significance is limited.",
        "At what level is the packaging and storage process considered?": "The packaging and storage process is occasionally considered.",
        "How is the delivery and distribution process considered?": "The delivery and distribution process is considered, but its role is not always critical.",
        "To what extent is customer usage considered in product development?": "Customer usage is occasionally considered.",
        "How is the maintenance and after-sales service process considered?": "The maintenance and after-sales service process is considered, but not comprehensively.",
        "At what level is the dismantling, recycling, and disposal process considered?": "The dismantling, recycling, and disposal process is occasionally considered.",
        "To what extent is the process of inspection, reuse, updating, and refurbishment considered?": "The process of inspection, reuse, updating, and refurbishment is occasionally considered.",
        "How important is the final product cost/price in the decision-making process?": "The final product cost is considered, but not always comprehensively.",
        "To what extent are development costs/ROI considered in the decision-making process?": "Development costs/ROI are occasionally considered.",
        "How important are lifecycle and operational costs, such as maintenance, services, recycling, and disposal?": "Lifecycle and operational costs are occasionally considered.",
        "How are time-to-market (TTM) and delivery deadlines considered in decision-making?": "TTM and delivery deadlines are taken into account, but not always critically.",
        "How does the number of different products impact design decisions?": "The number of different products is considered to a limited extent.",
        "To what extent is product customization considered?": "Product customization is occasionally considered.",
        "How is the level of innovation considered in decision-making?": "The level of innovation is monitored, but not always comprehensively.",
        "How does brand image influence decision-making?": "Brand image is considered, but not in all decisions.",
        "How important is functional performance (e.g., productivity, speed, accuracy, maintainability)?": "Functional performance is regularly monitored and considered in every decision.",
        "How is quality performance (e.g., durability, reliability) considered in design decisions?": "Quality performance is considered, but not always a priority.",
        "How do compliance and regulatory standards influence decisions?": "Compliance with regulations is considered, but not always comprehensively.",
        "What other factors, such as environmental sustainability, aesthetics, or social aspects, are considered?": "Other factors, such as sustainability, are considered, but not always prioritized."
    },
    "KM Processes": {
        "How is previous knowledge retrieved during the conceptual phase of a project?": "Knowledge from previous projects is not used during the conceptual phase.",
        "How is previous knowledge retrieved during the feasibility study?": "Knowledge from previous projects is sporadically used during the feasibility study, but not systematically.",
        "How is previous knowledge retrieved during the detailed design phase of the product and its components?": "Knowledge from previous projects is not systematically retrieved during the detailed design phase.",
        "How is previous knowledge retrieved during testing, prototyping, and experimentation?": "Knowledge from previous projects is sometimes retrieved during testing and prototyping.",
        "How is previous knowledge retrieved during the final project verification?": "Knowledge from previous projects is not retrieved during the final project verification.",
        "How does a formal knowledge management plan support the product development process?": "A formal knowledge management plan exists but is not widely used.",
        "To what extent does the company utilize knowledge resources from previous projects?": "The company sporadically utilizes knowledge resources from previous projects.",
        "How are design principles defined by the company considered (frequently reviewed and updated) in the knowledge management process?": "The design principles defined by the company are regularly updated and support the KM process.",
        "How are design principles defined by external entities (e.g., clients, suppliers) considered (frequently reviewed and updated) in the KM process?": "External design principles are considered, but to a limited extent.",
        "How are design principles defined by written design rules textbooks/standards considered (frequently reviewed and updated) in the KM process?": "Design principles defined in textbooks/standards are considered, but not in all projects.",
        "How do knowledge management principles support the consideration of final product costs?": "Knowledge management considers final product costs, but not always systematically.",
        "How does knowledge management influence the assessment of development costs and ROI?": "Knowledge management influences the assessment of development costs, but not all projects are included in ROI analysis.",
        "How does knowledge management support the consideration of lifecycle and operational costs (e.g., maintenance, recycling)?": "Lifecycle and operational costs are considered, but to a limited extent.",
        "How does knowledge management influence time-to-market (TTM) and delivery deadlines?": "Time-to-market is considered in the KM process but does not always have a major impact.",
        "How does KM support the evaluation of the number of different products in the company's portfolio?": "KM supports the evaluation of the number of different products, but not systematically.",
        "To what extent does KM consider the level of product customization to meet client needs?": "The level of product customization is considered, but not in all projects.",
        "How does knowledge management support innovation within the company?": "KM supports innovation in most projects, but not always systematically.",
        "How do KM principles support building brand image?": "Brand image is supported by KM, but it is not a priority.",
        "How does knowledge management support the functional performance of products (e.g., productivity, speed, accuracy)?": "Functional performance is considered, but not regularly monitored.",
        "How does knowledge management support monitoring product quality performance (e.g., durability, reliability)?": "Quality performance is considered, but it is not always a priority.",
        "How does knowledge management support compliance with regulations and legal standards?": "Knowledge management considers compliance with regulations, but not as a priority.",
        "What other aspects (e.g., environmental sustainability, aesthetics) are considered in the KM process?": "Other aspects, such as environmental sustainability, are considered, but not systematically in all projects."
    },
    "KM Techniques": {
        "To what extent is verbal communication with colleagues used for knowledge sharing?": "Verbal communication with colleagues is occasionally used for knowledge sharing.",
        "How frequently are documents with lessons learned created and utilized?": "Documents with lessons learned are sometimes created, but rarely used.",
        "To what extent are design specifications used in knowledge management processes?": "Design specifications are occasionally used for knowledge sharing, but not systematically.",
        "How effectively do questionnaires and checklists support knowledge management?": "Questionnaires and checklists are used, but their effectiveness is limited.",
        "To what extent are meeting rooms, posters, and visual management used for knowledge sharing?": "Meeting rooms, posters, and visual management are occasionally used for knowledge sharing.",
        "How often are shared network folders used for storing and sharing knowledge?": "Shared network folders are occasionally used for storing and sharing knowledge, but not systematically.",
        "To what extent does the intranet support the knowledge management process?": "The intranet is occasionally used to support knowledge management, but not always effectively.",
        "How are websites used to work on collaborative projects (e.g., Wiki) in knowledge management?": "Websites used to work on collaborative projects are used in most cases, but are not yet optimal.",
        "How are blogs, forums, and bulletin boards used in knowledge management?": "Blogs, forums, and bulletin boards are used to a limited extent in knowledge management.",
        "How do PDM/PLM systems support knowledge management?": "PDM/PLM systems are effectively used in most projects, but not always comprehensively.",
        "What benefits do KBE software and design automation bring to knowledge management?": "KBE software and design automation are regularly used, but not comprehensively."
    },
    "Methods": {
        "To what extent are principles of modularization and standardization of parts used in the design process?": "Principles of modularization and standardization of parts are applied sporadically.",
        "To what extent is Design for X (DFX) applied in terms of functional performance?": "Design for X (DFX) is applied, but to a limited extent in terms of functional performance.",
        "How does Design for X (DFX) support product quality performance?": "Design for X (DFX) supports product quality performance, but it is not common.",
        "To what extent does Design for X (DFX) take into account other customer-perceptible factors, such as aesthetics or eco-design?": "Design for X (DFX) sometimes considers other factors, like aesthetics or eco-design, but not systematically.",
        "How effectively is Design to Cost (DTC) and Target Cost Management (TCM) applied?": "Design to Cost (DTC) and Target Cost Management (TCM) are applied, but infrequently.",
        "To what extent is Lifecycle Cost Analysis (LCC) and Total Cost of Ownership (TCO) considered in the design process?": "Lifecycle Cost Analysis (LCC) and Total Cost of Ownership (TCO) are occasionally considered in the design process.",
        "How effectively is Lifecycle Analysis and Engineering (LCA&E) conducted?": "Lifecycle Analysis and Engineering (LCA&E) is conducted, but to a limited extent.",
        "How does Value Analysis and Engineering (VA&E) support the design process?": "Value Analysis and Engineering (VA&E) is not used in the design process.",
        "How effectively are Quality Functions (QFD) applied in the design process?": "Quality Functions (QFD) are applied, but not in all projects.",
        "To what extent does Failure Modes and Effects Analysis (FMEA/FMECA) support product development?": "Failure Modes and Effects Analysis (FMEA/FMECA) is applied, but its effectiveness is limited.",
        "To what extent are systematic innovation methods, such as TRIZ, applied in the design process?": "Systematic innovation methods, such as TRIZ, are applied to a limited extent."
    },
    "Computerization and Software": {
        "To what extent does office automation (e.g., spreadsheets, word processors) support the product development process?": "Office automation is occasionally used to support the product development process.",
        "To what extent are 2D CAD systems used in the design process?": "2D CAD systems are used to a limited extent in the design process.",
        "What benefits do 3D CAD systems bring to product development?": "3D CAD systems are used, but not in all projects.",
        "To what extent do digital models (DMU) support product development?": "Digital models (DMU) are used in all projects and have a major impact on product development.",
        "To what extent is computer-aided styling (CAS) used in product development projects?": "Computer-aided styling (CAS) is used in most projects, but not always comprehensively.",
        "To what extent does computer-aided engineering (CAE) support the design process?": "Computer-aided engineering (CAE) is used, but not in all projects.",
        "To what extent is the finite element analysis (FEA/FEM) method used in design processes?": "The finite element analysis (FEA/FEM) method is not used for design.",
        "To what extent is computational fluid dynamics (CFD) used in projects?": "Computational fluid dynamics (CFD) is used, but not in all projects.",
        "To what extent does KBE and design automation support the design processes?": "KBE and design automation are used, but their application is limited.",
        "To what extent is computer-aided manufacturing (CAM) used in the production process?": "Computer-aided manufacturing (CAM) is used occasionally in the production process.",
        "To what extent does discrete event simulation (DES) support product development processes?": "Discrete event simulation (DES) is applied in all projects and supports product development processes.",
        "To what extent does computer-aided process planning (CAPP)/digital factories support product development process?": "Computer-aided process planning (CAPP)/digital factories is regularly used, but not in all projects.",
        "To what extent are virtual reality (VR) and augmented reality (AR) used in product development?": "Virtual reality (VR) and augmented reality (AR) are applied, but not in all projects.",
        "How do PDM/PLM systems support product data management?": "PDM/PLM systems are regularly applied in most projects, but not always comprehensively.",
        "What benefits do document management systems (DMS) bring to projects?": "Document management systems (DMS) are used, but not always comprehensively.",
        "To what extent does workflow management system (WMS) support project management?": "Workflow management system (WMS) is sporadically used in projects.",
        "To what extent is enterprise resource planning (ERP) applied in product development processes?": "Enterprise resource planning (ERP) is regularly applied, but not comprehensively.",
        "How does supply chain management (SCM) support product development?": "Supply chain management (SCM) supports product development, but not systematically.",
        "To what extent do customer relationship management (CRM) systems impact product development?": "Customer relationship management (CRM) systems have limited impact on product development.",
        "How do supplier relationship management (SRM) systems support the product development process?": "Supplier relationship management (SRM) systems are applied, but not in all cases.",
        "To what extent is a computerized maintenance management system (CMMS) applied in product development processes?": "A computerized maintenance management system (CMMS) is applied to a limited extent.",
        "To what extent do software project management systems affect product development?": "Software project management systems have limited impact on product development."
    }
}