{
  "CLIMB_2": {
    "questionnaire": "CLIMB_2",
    "questionnaire_title": "Kwestionariusz dla modelu CLIMB2",
    "sections": [
      {
        "section_name": "ROLE I WSPÓŁPRACA",
        "question_count": 7,
        "questions": [
          {
            "question_text": "Jak zespół wielofunkcyjny jest zaangażowany w proces rozwoju produktu?",
            "answer_options": {
              "A": "Zespół wielofunkcyjny nie istnieje w procesie rozwoju produktu.",
              "B": "Zespół wielofunkcyjny istnieje, ale nie jest regularnie zaangażowany w proces.",
              "C": "Zespół wielofunkcyjny jest zaangażowany w większości etapów rozwoju produktu.",
              "D": "Zespół wielofunkcyjny jest zaangażowany w cały proces rozwoju produktu, ale współpraca nie jest jeszcze optymalna.",
              "E": "Zespół wielofunkcyjny jest w pełni zintegrowany i aktywnie zaangażowany na wszystkich etapach rozwoju produktu."
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Jak wszystkie strony zainteresowane są zaangażowane w zespół projektowy, nawet gdy są rozproszone globalnie?",
            "answer_options": {
              "A": "Strony zainteresowane nie są zaangażowane w zespół projektowy.",
              "B": "Niektóre strony zainteresowane są zaangażowane, ale tylko lokalnie.",
              "C": "Większość stron zainteresowanych jest zaangażowana, ale nie zawsze, szczególnie gdy są rozproszone globalnie.",
              "D": "Strony zainteresowane są zaangażowane nawet gdy są rozproszone globalnie, ale współpraca nadal wymaga poprawy.",
              "E": "Wszystkie strony zainteresowane są w pełni zaangażowane w zespół projektowy, niezależnie od lokalizacji geograficznej."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak jasno są zdefiniowane role i obowiązki każdej osoby?",
            "answer_options": {
              "A": "Role i obowiązki nie są jasno zdefiniowane.",
              "B": "Role i obowiązki są zdefiniowane, ale często nie są jasne lub zrozumiałe dla wszystkich.",
              "C": "Większość ról i obowiązków jest jasno zdefiniowana, ale nadal występują niejasności.",
              "D": "Role i obowiązki są dobrze zdefiniowane dla większości członków zespołu.",
              "E": "Role i obowiązki są w pełni jasne, dobrze zrozumiane i szanowane przez wszystkich członków zespołu."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak zapewniana jest wysoka elastyczność w wykonywaniu zadań w projekcie?",
            "answer_options": {
              "A": "Nie ma elastyczności w wykonywaniu zadań; wszystko jest ściśle zdefiniowane.",
              "B": "Elastyczność istnieje, ale jest ograniczona i dotyczy tylko niektórych zadań.",
              "C": "Elastyczność w wykonywaniu zadań jest możliwa, ale nie dla wszystkich członków zespołu.",
              "D": "Elastyczność w wykonywaniu zadań jest zapewniona, ale nie zawsze maksymalnie wykorzystywana.",
              "E": "Elastyczność w wykonywaniu zadań jest wysoka i wspiera efektywność zespołu na wszystkich etapach projektu."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Jakie jest zaplecze techniczne i poziom zaangażowania kierowników produktu w projektach?",
            "answer_options": {
              "A": "Kierownicy produktu prawdopodobnie nie mają zaplecza technicznego.",
              "B": "Niektórzy kierownicy produktu mają zaplecze techniczne, ale nie jest to standard.",
              "C": "Są kierownicy produktu ze średnim poziomem zaplecza technicznego lub tylko niektórzy kierownicy produktu go mają.",
              "D": "Większość kierowników produktu ma odpowiednie zaplecze techniczne i są zaangażowani w projekty.",
              "E": "Wszyscy kierownicy produktu mają zaplecze techniczne potwierdzone doświadczeniem i są w pełni zaangażowani w rozwój."
            },
            "selected_answer": "D"
          },
          {
            "question_text": "Jak w pełni klient jest zaangażowany w proces rozwoju produktu?",
            "answer_options": {
              "A": "Klient nie jest zaangażowany w proces rozwoju produktu.",
              "B": "Klient jest zaangażowany tylko w wybrane projekty i rzadko w pełni.",
              "C": "Klient jest czasami zaangażowany w rozwój produktu, ale nie na każdym etapie.",
              "D": "Klient jest regularnie zaangażowany, ale współpraca nie jest optymalna na wszystkich etapach.",
              "E": "Klient jest w pełni zaangażowany na wszystkich etapach rozwoju produktu, niezależnie od produktu."
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Czy doświadczeni projektanci są zaangażowani od najwcześniejszych etapów projektu?",
            "answer_options": {
              "A": "Doświadczeni projektanci nie są zaangażowani we wczesnych etapach projektów.",
              "B": "Doświadczeni projektanci są zaangażowani, ale tylko sporadycznie we wczesnych etapach.",
              "C": "Doświadczeni projektanci są zaangażowani we wczesnych etapach większości projektów.",
              "D": "Doświadczeni projektanci są zaangażowani we wczesnych etapach wszystkich projektów, ale ich udział nie zawsze jest optymalny.",
              "E": "Doświadczeni projektanci są zawsze zaangażowani od najwcześniejszych etapów projektów, a ich wkład jest kluczowy dla sukcesu projektu."
            },
            "selected_answer": "B"
          }
        ]
      },
      {
        "section_name": "SZKOLENIE",
        "question_count": 3,
        "questions": [
          {
            "question_text": "Jak formalne programy wspierają rozwój umiejętności interdyscyplinarnych?",
            "answer_options": {
              "A": "Nie ma formalnych programów szkoleniowych.",
              "B": "Programy istnieją, ale są ograniczone i sporadyczne.",
              "C": "Programy są wdrażane na średnim poziomie, ale nie obejmują wszystkich pracowników.",
              "D": "Programy są szeroko dostępne i regularnie stosowane.",
              "E": "Programy są systematyczne, dobrze zaplanowane i obejmują wszystkich pracowników."
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Jak oferowane są indywidualne sesje mentorskie wspierające rozwój umiejętności?",
            "answer_options": {
              "A": "Indywidualne sesje mentorskie nie są dostępne.",
              "B": "Sesje mentorskie są dostępne w ograniczonym zakresie i dla wybranych pracowników.",
              "C": "Sesje mentorskie są dostępne dla większości pracowników, ale rzadko są zindywidualizowane.",
              "D": "Sesje mentorskie są dobrze rozwinięte, ale nie zawsze dostępne dla wszystkich pracowników.",
              "E": "Sesje mentorskie są ustandaryzowane, zindywidualizowane i dostępne dla wszystkich pracowników."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak KPI są wykorzystywane do oceny wyników szkoleń?",
            "answer_options": {
              "A": "KPI nie są używane do oceny wyników szkoleń.",
              "B": "KPI są czasami używane, ale nie są regularnie monitorowane.",
              "C": "KPI są używane, ale nie wszystkie wyniki szkoleń są dokładnie oceniane.",
              "D": "KPI są systematycznie stosowane i obejmują większość programów szkoleniowych.",
              "E": "KPI są kompleksowo używane do oceny wszystkich aspektów szkoleń i są regularnie aktualizowane."
            },
            "selected_answer": "A"
          }
        ]
      },
      {
        "section_name": "DZIAŁANIA I PRZEPŁYW",
        "question_count": 8,
        "questions": [
          {
            "question_text": "W jakim stopniu formalny model rozwoju produktu jest przestrzegany i dokumentowany?",
            "answer_options": {
              "A": "Nie ma formalnego modelu rozwoju produktu.",
              "B": "Model istnieje, ale rzadko jest przestrzegany i dokumentowany.",
              "C": "Model jest przestrzegany, ale nie zawsze dokumentowany.",
              "D": "Model jest przestrzegany i dokumentowany przez większość zespołów.",
              "E": "Model jest standardem, przestrzeganym i dokumentowanym w każdym projekcie."
            },
            "selected_answer": "A"
          },
          {
            "question_text": "W jakim stopniu współpraca jest częścią procesu rozwoju produktu?",
            "answer_options": {
              "A": "Współpraca jest minimalna i sporadyczna.",
              "B": "Współpraca istnieje, ale ogranicza się do kilku kluczowych etapów.",
              "C": "Współpraca obejmuje większość etapów, ale nie jest systematyczna.",
              "D": "Współpraca obejmuje prawie wszystkie etapy rozwoju produktu.",
              "E": "Współpraca jest integralną częścią procesu, obejmującą wszystkie etapy."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak skutecznie kompleksowy zestaw KPI jest używany do mierzenia wydajności rozwoju produktu?",
            "answer_options": {
              "A": "Nie ma kompleksowego zestawu KPI.",
              "B": "Zestaw KPI istnieje, ale jest używany sporadycznie.",
              "C": "Kompleksowy zestaw KPI jest używany, ale nie we wszystkich fazach.",
              "D": "Kompleksowy zestaw KPI jest systematycznie używany w większości projektów.",
              "E": "Kompleksowy zestaw KPI jest używany we wszystkich projektach i fazach rozwoju produktu."
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Na jakim poziomie frontloading jest wdrażany w procesie rozwoju produktu?",
            "answer_options": {
              "A": "Frontloading nie jest stosowany.",
              "B": "Frontloading jest stosowany tylko w niektórych projektach.",
              "C": "Frontloading jest stosowany w większości projektów, ale nie zawsze skutecznie.",
              "D": "Frontloading jest skutecznie wdrażany we wszystkich projektach.",
              "E": "Frontloading jest wdrażany na bardzo wysokim poziomie we wszystkich projektach."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "W jakim stopniu podejmowane są inicjatywy ciągłego doskonalenia?",
            "answer_options": {
              "A": "Inicjatywy ciągłego doskonalenia nie są podejmowane.",
              "B": "Inicjatywy ciągłego doskonalenia są podejmowane, ale rzadko.",
              "C": "Inicjatywy ciągłego doskonalenia są podejmowane, ale ich wpływ jest ograniczony.",
              "D": "Inicjatywy ciągłego doskonalenia są regularnie podejmowane i mają realny wpływ na proces.",
              "E": "Inicjatywy ciągłego doskonalenia są standardem i znacząco wpływają na efektywność procesu."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak skutecznie projektowane są różne rozwiązania i eliminowane gorsze rozwiązania w miarę pojawiania się nowych informacji?",
            "answer_options": {
              "A": "Różne rozwiązania nie są projektowane; proces jest sztywny.",
              "B": "Różne rozwiązania są projektowane, ale eliminacja słabszych opcji jest niesystematyczna.",
              "C": "Różne rozwiązania są projektowane, ale eliminowanie gorszych opcji nie jest systematyczne.",
              "D": "Różne rozwiązania są projektowane, a gorsze rozwiązania są regularnie eliminowane.",
              "E": "Różne rozwiązania są projektowane w każdym projekcie, a słabsze opcje są regularnie i skutecznie eliminowane."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu proces rozwoju produktu koncentruje się na wartości dla klienta?",
            "answer_options": {
              "A": "Proces rozwoju produktu nie koncentruje się na wartości dla klienta.",
              "B": "Proces częściowo koncentruje się na wartości dla klienta, ale nie jest to priorytet.",
              "C": "Proces koncentruje się na wartości dla klienta, ale nie zawsze.",
              "D": "Proces konsekwentnie koncentruje się na wartości dla klienta.",
              "E": "Proces w pełni koncentruje się na maksymalizacji wartości dla klienta."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak wdrażany jest proces analizy konkurencji (inżynieria wsteczna)?",
            "answer_options": {
              "A": "Proces analizy konkurencji nie jest wdrażany.",
              "B": "Proces analizy konkurencji jest wdrażany, ale w ograniczonym zakresie.",
              "C": "Proces analizy konkurencji jest systematycznie wdrażany, ale nie w pełni.",
              "D": "Proces analizy konkurencji jest skutecznie wdrażany we wszystkich projektach.",
              "E": "Proces analizy konkurencji jest kluczową częścią rozwoju produktu i wdrażany w każdym projekcie."
            },
            "selected_answer": "B"
          }
        ]
      },
      {
        "section_name": "PODEJMOWANIE DECYZJI",
        "question_count": 22,
        "questions": [
          {
            "question_text": "Jak uwzględniany jest proces projektowania i uprzemysłowienia części i modułów?",
            "answer_options": {
              "A": "Proces projektowania i uprzemysłowienia nie jest uwzględniany.",
              "B": "Proces projektowania i uprzemysłowienia jest sporadycznie uwzględniany.",
              "C": "Proces projektowania i uprzemysłowienia jest regularnie uwzględniany, ale nie zawsze systematycznie.",
              "D": "Proces projektowania i uprzemysłowienia jest uwzględniany we wszystkich projektach i jest dobrze zorganizowany.",
              "E": "Proces projektowania i uprzemysłowienia jest w pełni uwzględniany i zintegrowany na każdym etapie rozwoju produktu."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu uwzględniany jest proces produkcji komponentów i produktów półgotowych?",
            "answer_options": {
              "A": "Proces produkcji komponentów i produktów półgotowych nie jest uwzględniany.",
              "B": "Proces produkcji komponentów i produktów półgotowych jest sporadycznie uwzględniany.",
              "C": "Proces produkcji komponentów i produktów półgotowych jest uwzględniany w większości projektów.",
              "D": "Proces produkcji komponentów i produktów półgotowych jest kluczowym elementem w każdym projekcie.",
              "E": "Proces produkcji komponentów i produktów półgotowych jest priorytetem i uwzględniany w każdym projekcie."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Na jakim poziomie proces montażu komponentów jest uwzględniany w rozwoju produktu?",
            "answer_options": {
              "A": "Proces montażu komponentów nie jest uwzględniany.",
              "B": "Proces montażu komponentów jest sporadycznie uwzględniany.",
              "C": "Proces montażu komponentów jest uwzględniany, ale nie zawsze optymalizowany.",
              "D": "Proces montażu komponentów jest optymalizowany i uwzględniany na wszystkich etapach.",
              "E": "Proces montażu komponentów jest kluczowym elementem rozwoju produktu i jest optymalizowany we wszystkich projektach."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak ważny jest proces testowania i eksperymentowania w rozwoju produktu?",
            "answer_options": {
              "A": "Proces testowania i eksperymentowania nie jest uwzględniany.",
              "B": "Proces testowania i eksperymentowania jest sporadycznie uwzględniany.",
              "C": "Proces testowania i eksperymentowania jest uwzględniany w większości przypadków, ale jego znaczenie jest ograniczone.",
              "D": "Proces testowania i eksperymentowania jest systematycznie stosowany i ma duży wpływ na rozwój produktu.",
              "E": "Proces testowania i eksperymentowania ma najwyższe znaczenie i wpływa na każdą decyzję."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Na jakim poziomie uwzględniany jest proces pakowania i przechowywania?",
            "answer_options": {
              "A": "Proces pakowania i przechowywania nie jest uwzględniany.",
              "B": "Proces pakowania i przechowywania jest sporadycznie uwzględniany.",
              "C": "Proces pakowania i przechowywania jest uwzględniany, ale nie we wszystkich projektach.",
              "D": "Proces pakowania i przechowywania jest uwzględniany i optymalizowany w większości projektów.",
              "E": "Proces pakowania i przechowywania jest kluczowy i w pełni uwzględniany w każdym projekcie."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak uwzględniany jest proces dostawy i dystrybucji?",
            "answer_options": {
              "A": "Proces dostawy i dystrybucji nie jest uwzględniany.",
              "B": "Proces dostawy i dystrybucji jest sporadycznie uwzględniany.",
              "C": "Proces dostawy i dystrybucji jest uwzględniany, ale jego rola nie zawsze jest krytyczna.",
              "D": "Proces dostawy i dystrybucji jest skutecznie uwzględniany w każdym projekcie.",
              "E": "Proces dostawy i dystrybucji jest integralną częścią każdego procesu podejmowania decyzji."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "W jakim stopniu użytkowanie przez klienta jest uwzględniane w rozwoju produktu?",
            "answer_options": {
              "A": "Użytkowanie przez klienta nie jest uwzględniane w procesie rozwoju produktu.",
              "B": "Użytkowanie przez klienta jest sporadycznie uwzględniane.",
              "C": "Użytkowanie przez klienta jest uwzględniane, ale nie zawsze monitorowane.",
              "D": "Użytkowanie przez klienta jest regularnie monitorowane i uwzględniane na wszystkich etapach.",
              "E": "Użytkowanie przez klienta jest ciągle monitorowane i w pełni uwzględniane w decyzjach projektowych."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak uwzględniany jest proces konserwacji i obsługi posprzedażnej?",
            "answer_options": {
              "A": "Proces konserwacji i obsługi posprzedażnej nie jest uwzględniany.",
              "B": "Proces konserwacji i obsługi posprzedażnej jest sporadycznie uwzględniany.",
              "C": "Proces konserwacji i obsługi posprzedażnej jest uwzględniany, ale nie kompleksowo.",
              "D": "Proces konserwacji i obsługi posprzedażnej jest kluczowy i zawsze uwzględniany.",
              "E": "Proces konserwacji i obsługi posprzedażnej jest priorytetem i uwzględniany na wszystkich etapach rozwoju."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Na jakim poziomie uwzględniany jest proces demontażu, recyklingu i utylizacji?",
            "answer_options": {
              "A": "Proces demontażu, recyklingu i utylizacji nie jest uwzględniany.",
              "B": "Proces demontażu, recyklingu i utylizacji jest sporadycznie uwzględniany.",
              "C": "Proces demontażu, recyklingu i utylizacji jest uwzględniany, ale jego rola jest ograniczona.",
              "D": "Proces demontażu, recyklingu i utylizacji jest w pełni uwzględniany w każdym projekcie.",
              "E": "Proces demontażu, recyklingu i utylizacji jest zintegrowany z każdym projektem i regularnie monitorowany."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu uwzględniany jest proces inspekcji, ponownego użycia, aktualizacji i odnowy?",
            "answer_options": {
              "A": "Proces inspekcji, ponownego użycia, aktualizacji i odnowy nie jest uwzględniany.",
              "B": "Proces inspekcji, ponownego użycia, aktualizacji i odnowy jest sporadycznie uwzględniany.",
              "C": "Proces inspekcji, ponownego użycia, aktualizacji i odnowy jest uwzględniany, ale nie zawsze priorytetyzowany.",
              "D": "Proces inspekcji, ponownego użycia, aktualizacji i odnowy jest uwzględniany w większości projektów.",
              "E": "Proces inspekcji, ponownego użycia, aktualizacji i odnowy jest w pełni uwzględniany i zintegrowany z rozwojem produktu."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak ważny jest finalny koszt/cena produktu w procesie podejmowania decyzji?",
            "answer_options": {
              "A": "Finalny koszt produktu nie jest uwzględniany.",
              "B": "Finalny koszt produktu jest uwzględniany, ale w ograniczonym zakresie.",
              "C": "Finalny koszt produktu jest uwzględniany, ale nie zawsze kompleksowo.",
              "D": "Finalny koszt produktu jest kluczowym elementem decyzji we wszystkich projektach.",
              "E": "Finalny koszt/cena produktu jest priorytetem w każdej decyzji projektowej."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "W jakim stopniu koszty rozwoju/ROI są uwzględniane w procesie podejmowania decyzji?",
            "answer_options": {
              "A": "Koszty rozwoju/ROI nie są uwzględniane.",
              "B": "Koszty rozwoju/ROI są sporadycznie uwzględniane.",
              "C": "Koszty rozwoju/ROI są regularnie monitorowane, ale nie zawsze uwzględniane w decyzjach.",
              "D": "Koszty rozwoju/ROI są starannie monitorowane i uwzględniane w każdym projekcie.",
              "E": "Koszty rozwoju/ROI są kluczowym elementem każdej decyzji i są starannie monitorowane."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak ważne są koszty cyklu życia i koszty operacyjne, takie jak konserwacja, usługi, recykling i utylizacja?",
            "answer_options": {
              "A": "Koszty cyklu życia i koszty operacyjne nie są uwzględniane.",
              "B": "Koszty cyklu życia i koszty operacyjne są sporadycznie uwzględniane.",
              "C": "Koszty cyklu życia i koszty operacyjne są uwzględniane, ale nie kompleksowo.",
              "D": "Koszty cyklu życia i koszty operacyjne są systematycznie uwzględniane i znacznie wpływają na decyzje.",
              "E": "Koszty cyklu życia i koszty operacyjne są integralną częścią procesu podejmowania decyzji i mają duży wpływ na decyzje."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak czas wprowadzenia na rynek (TTM) i terminy dostaw są uwzględniane w podejmowaniu decyzji?",
            "answer_options": {
              "A": "TTM i terminy dostaw nie są uwzględniane w podejmowaniu decyzji.",
              "B": "TTM i terminy dostaw są uwzględniane, ale tylko w niektórych projektach.",
              "C": "TTM i terminy dostaw są uwzględniane, ale nie zawsze krytycznie.",
              "D": "TTM i terminy dostaw są kluczowymi czynnikami w każdej decyzji projektowej.",
              "E": "TTM i terminy dostaw są najważniejszymi kryteriami w każdej decyzji projektowej."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Jak liczba różnych produktów wpływa na decyzje projektowe?",
            "answer_options": {
              "A": "Liczba różnych produktów nie jest uwzględniana.",
              "B": "Liczba różnych produktów jest uwzględniana w ograniczonym zakresie.",
              "C": "Liczba różnych produktów jest uwzględniana, ale nie zawsze ma wpływ na finalne decyzje.",
              "D": "Liczba różnych produktów jest uwzględniana w większości projektów i ma bezpośredni wpływ na decyzje.",
              "E": "Liczba różnych produktów jest kluczowym czynnikiem w każdej decyzji i wpływa na wybory projektowe."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu dostosowanie produktu jest uwzględniane?",
            "answer_options": {
              "A": "Dostosowanie produktu nie jest uwzględniane.",
              "B": "Dostosowanie produktu jest sporadycznie uwzględniane.",
              "C": "Dostosowanie produktu jest regularnie uwzględniane, ale nie zawsze kompleksowo.",
              "D": "Dostosowanie produktu jest monitorowane i uwzględniane w każdym projekcie.",
              "E": "Dostosowanie produktu jest w pełni uwzględniane w każdym projekcie i jest priorytetem w podejmowaniu decyzji."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak poziom innowacyjności jest uwzględniany w podejmowaniu decyzji?",
            "answer_options": {
              "A": "Poziom innowacyjności nie jest uwzględniany.",
              "B": "Poziom innowacyjności jest uwzględniany, ale nie systematycznie.",
              "C": "Poziom innowacyjności jest monitorowany, ale nie zawsze kompleksowo.",
              "D": "Poziom innowacyjności jest systematycznie monitorowany i uwzględniany we wszystkich projektach.",
              "E": "Poziom innowacyjności jest monitorowany i ma największy wpływ na każdą decyzję."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Jak wizerunek marki wpływa na podejmowanie decyzji?",
            "answer_options": {
              "A": "Wizerunek marki nie jest uwzględniany.",
              "B": "Wizerunek marki jest uwzględniany w ograniczonym zakresie.",
              "C": "Wizerunek marki jest uwzględniany, ale nie we wszystkich decyzjach.",
              "D": "Wizerunek marki jest kluczowym czynnikiem w decyzjach projektowych.",
              "E": "Wizerunek marki jest priorytetem w każdej decyzji projektowej i jest ściśle monitorowany."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Jak ważna jest wydajność funkcjonalna (np. produktywność, szybkość, dokładność, łatwość konserwacji)?",
            "answer_options": {
              "A": "Wydajność funkcjonalna nie jest uwzględniana.",
              "B": "Wydajność funkcjonalna jest sporadycznie uwzględniana.",
              "C": "Wydajność funkcjonalna jest uwzględniana, ale nie zawsze kompleksowo.",
              "D": "Wydajność funkcjonalna jest regularnie monitorowana i uwzględniana w każdej decyzji.",
              "E": "Wydajność funkcjonalna jest priorytetem i uwzględniana we wszystkich decyzjach projektowych."
            },
            "selected_answer": "D"
          },
          {
            "question_text": "Jak wydajność jakościowa (np. trwałość, niezawodność) jest uwzględniana w decyzjach projektowych?",
            "answer_options": {
              "A": "Wydajność jakościowa nie jest uwzględniana.",
              "B": "Wydajność jakościowa jest sporadycznie uwzględniana.",
              "C": "Wydajność jakościowa jest uwzględniana, ale nie zawsze jest priorytetem.",
              "D": "Wydajność jakościowa jest istotna i uwzględniana we wszystkich decyzjach.",
              "E": "Wydajność jakościowa jest priorytetem i najważniejszym elementem każdej decyzji projektowej."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Jak zgodność z przepisami i standardami regulacyjnymi wpływa na decyzje?",
            "answer_options": {
              "A": "Zgodność z przepisami nie jest uwzględniana.",
              "B": "Zgodność z przepisami jest sporadycznie uwzględniana.",
              "C": "Zgodność z przepisami jest uwzględniana, ale nie zawsze kompleksowo.",
              "D": "Zgodność z przepisami jest regularnie monitorowana i uwzględniana w każdej decyzji.",
              "E": "Zgodność z przepisami i standardami jest integralną częścią każdej decyzji i jest ściśle monitorowana."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Jakie inne czynniki, takie jak zrównoważony rozwój środowiskowy, estetyka czy aspekty społeczne, są uwzględniane?",
            "answer_options": {
              "A": "Inne czynniki, takie jak zrównoważoność, nie są uwzględniane.",
              "B": "Inne czynniki, takie jak zrównoważoność, są czasami uwzględniane, ale nie systematycznie.",
              "C": "Inne czynniki, takie jak zrównoważoność, są uwzględniane, ale nie zawsze priorytetyzowane.",
              "D": "Inne czynniki, takie jak zrównoważoność, są regularnie uwzględniane i znacząco wpływają na decyzje.",
              "E": "Inne czynniki, takie jak zrównoważoność, są kluczowe i priorytetyzowane w procesie podejmowania decyzji."
            },
            "selected_answer": "C"
          }
        ]
      },
      {
        "section_name": "PROCESY ZW",
        "question_count": 22,
        "questions": [
          {
            "question_text": "Jak odzyskiwana jest poprzednia wiedza podczas fazy koncepcyjnej projektu?",
            "answer_options": {
              "A": "Wiedza z poprzednich projektów nie jest wykorzystywana podczas fazy koncepcyjnej.",
              "B": "Wiedza z poprzednich projektów jest sporadycznie wykorzystywana podczas fazy koncepcyjnej.",
              "C": "Wiedza z poprzednich projektów jest regularnie wykorzystywana podczas fazy koncepcyjnej, ale nie w pełni systematycznie.",
              "D": "Wiedza z poprzednich projektów jest systematycznie wykorzystywana podczas fazy koncepcyjnej we wszystkich projektach.",
              "E": "Wiedza z poprzednich projektów jest w pełni zintegrowana z każdą fazą koncepcyjną i jest priorytetem."
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Jak odzyskiwana jest poprzednia wiedza podczas studium wykonalności?",
            "answer_options": {
              "A": "Wiedza z poprzednich projektów jest rzadko wykorzystywana podczas studium wykonalności.",
              "B": "Wiedza z poprzednich projektów jest sporadycznie wykorzystywana podczas studium wykonalności, ale nie systematycznie.",
              "C": "Wiedza z poprzednich projektów jest regularnie wykorzystywana podczas studium wykonalności, ale nie zawsze w każdym przypadku.",
              "D": "Wiedza z poprzednich projektów jest uwzględniana podczas studium wykonalności w każdym projekcie.",
              "E": "Wiedza z poprzednich projektów jest wykorzystywana w każdym projekcie i ma kluczowy wpływ na studium wykonalności."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak odzyskiwana jest poprzednia wiedza podczas szczegółowej fazy projektowania produktu i jego komponentów?",
            "answer_options": {
              "A": "Wiedza z poprzednich projektów nie jest systematycznie odzyskiwana podczas szczegółowej fazy projektowania.",
              "B": "Wiedza z poprzednich projektów jest wykorzystywana, ale niesystematycznie, podczas szczegółowej fazy projektowania.",
              "C": "Wiedza z poprzednich projektów jest systematycznie odzyskiwana, ale nie zawsze kompleksowo.",
              "D": "Wiedza z poprzednich projektów jest systematycznie odzyskiwana i wykorzystywana podczas szczegółowej fazy projektowania.",
              "E": "Wiedza z poprzednich projektów jest w pełni odzyskiwana i wykorzystywana podczas szczegółowej fazy projektowania."
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Jak odzyskiwana jest poprzednia wiedza podczas testowania, prototypowania i eksperymentowania?",
            "answer_options": {
              "A": "Wiedza z poprzednich projektów nie jest odzyskiwana podczas testowania, prototypowania i eksperymentowania.",
              "B": "Wiedza z poprzednich projektów jest czasami odzyskiwana podczas testowania i prototypowania.",
              "C": "Wiedza z poprzednich projektów jest regularnie odzyskiwana podczas testowania, prototypowania i eksperymentowania, ale nie zawsze.",
              "D": "Wiedza z poprzednich projektów jest w pełni odzyskiwana podczas testowania i prototypowania.",
              "E": "Wiedza z poprzednich projektów jest integralną częścią testowania, prototypowania i eksperymentowania."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak odzyskiwana jest poprzednia wiedza podczas finalnej weryfikacji projektu?",
            "answer_options": {
              "A": "Wiedza z poprzednich projektów nie jest odzyskiwana podczas finalnej weryfikacji projektu.",
              "B": "Wiedza z poprzednich projektów jest sporadycznie odzyskiwana podczas finalnej weryfikacji projektu.",
              "C": "Wiedza z poprzednich projektów jest odzyskiwana podczas finalnej weryfikacji, ale nie kompleksowo.",
              "D": "Wiedza z poprzednich projektów jest odzyskiwana podczas finalnej weryfikacji projektu w większości przypadków.",
              "E": "Wiedza z poprzednich projektów jest priorytetem w procesie finalnej weryfikacji projektu."
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Jak formalny plan zarządzania wiedzą wspiera proces rozwoju produktu?",
            "answer_options": {
              "A": "Formalny plan zarządzania wiedzą nie istnieje lub nie jest używany.",
              "B": "Formalny plan zarządzania wiedzą istnieje, ale nie jest szeroko używany.",
              "C": "Formalny plan zarządzania wiedzą istnieje i jest wdrażany, ale nie we wszystkich przypadkach.",
              "D": "Formalny plan zarządzania wiedzą jest w pełni wdrażany i wspiera rozwój produktu we wszystkich projektach.",
              "E": "Formalny plan zarządzania wiedzą jest w pełni wdrażany i systematycznie używany we wszystkich projektach."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu firma wykorzystuje zasoby wiedzy z poprzednich projektów?",
            "answer_options": {
              "A": "Firma rzadko wykorzystuje zasoby wiedzy z poprzednich projektów.",
              "B": "Firma sporadycznie wykorzystuje zasoby wiedzy z poprzednich projektów.",
              "C": "Firma wykorzystuje zasoby wiedzy, ale nie wszystkie projekty są objęte systematycznym procesem ZW.",
              "D": "Firma regularnie wykorzystuje zasoby wiedzy z poprzednich projektów i stosuje je w nowych projektach.",
              "E": "Firma w pełni wykorzystuje zasoby wiedzy z poprzednich projektów i regularnie aktualizuje proces ZW."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak zasady projektowe zdefiniowane przez firmę są uwzględniane (często przeglądane i aktualizowane) w procesie zarządzania wiedzą?",
            "answer_options": {
              "A": "Zasady projektowe zdefiniowane przez firmę nie wspierają procesu zarządzania wiedzą.",
              "B": "Zasady projektowe zdefiniowane przez firmę wspierają proces ZW, ale nie zawsze.",
              "C": "Zasady projektowe zdefiniowane przez firmę wspierają proces ZW, ale nie zawsze są w pełni aktualizowane.",
              "D": "Zasady projektowe zdefiniowane przez firmę są regularnie aktualizowane i wspierają proces ZW.",
              "E": "Zasady projektowe zdefiniowane przez firmę są ciągle aktualizowane i w pełni wspierają proces ZW."
            },
            "selected_answer": "D"
          },
          {
            "question_text": "Jak zasady projektowe zdefiniowane przez podmioty zewnętrzne (np. klienci, dostawcy) są uwzględniane (często przeglądane i aktualizowane) w procesie ZW?",
            "answer_options": {
              "A": "Zewnętrzne zasady projektowe nie są uwzględniane w procesie ZW.",
              "B": "Zewnętrzne zasady projektowe są uwzględniane, ale w ograniczonym zakresie.",
              "C": "Zewnętrzne zasady projektowe są uwzględniane, ale nie we wszystkich projektach.",
              "D": "Zewnętrzne zasady projektowe są regularnie uwzględniane i mają znaczący wpływ na projekty.",
              "E": "Zewnętrzne zasady projektowe są kluczowe i są systematycznie uwzględniane we wszystkich projektach."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak zasady projektowe zdefiniowane w pisemnych podręcznikach/standardach zasad projektowania są uwzględniane (często przeglądane i aktualizowane) w procesie ZW?",
            "answer_options": {
              "A": "Zasady projektowe zdefiniowane w podręcznikach/standardach nie są uwzględniane w procesie ZW.",
              "B": "Zasady projektowe zdefiniowane w podręcznikach/standardach są uwzględniane, ale w ograniczonym zakresie.",
              "C": "Zasady projektowe zdefiniowane w podręcznikach/standardach są uwzględniane, ale nie we wszystkich projektach.",
              "D": "Zasady projektowe zdefiniowane w podręcznikach/standardach są regularnie uwzględniane i mają znaczący wpływ na projekty.",
              "E": "Zasady projektowe zdefiniowane w podręcznikach/standardach są kluczowe i są systematycznie uwzględniane we wszystkich projektach."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Jak zasady zarządzania wiedzą wspierają uwzględnianie finalnych kosztów produktu?",
            "answer_options": {
              "A": "Zarządzanie wiedzą nie uwzględnia finalnych kosztów produktu.",
              "B": "Zarządzanie wiedzą uwzględnia finalne koszty produktu, ale nie zawsze systematycznie.",
              "C": "Zarządzanie wiedzą uwzględnia finalne koszty produktu, ale nie kompleksowo.",
              "D": "Zarządzanie wiedzą systematycznie uwzględnia finalne koszty produktu i wpływa na decyzje.",
              "E": "Zarządzanie wiedzą w pełni uwzględnia finalne koszty produktu i jest integralną częścią podejmowania decyzji."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak zarządzanie wiedzą wpływa na ocenę kosztów rozwoju i ROI?",
            "answer_options": {
              "A": "Zarządzanie wiedzą nie wpływa na ocenę kosztów rozwoju i ROI.",
              "B": "Zarządzanie wiedzą wpływa na ocenę kosztów rozwoju i ROI, ale nie zawsze jest kluczowym czynnikiem.",
              "C": "Zarządzanie wiedzą wpływa na ocenę kosztów rozwoju, ale nie wszystkie projekty są objęte analizą ROI.",
              "D": "Zarządzanie wiedzą ma duży wpływ na ocenę kosztów rozwoju i ROI we wszystkich projektach.",
              "E": "Zarządzanie wiedzą ma kluczowy wpływ na ocenę kosztów rozwoju i ROI i jest stosowane we wszystkich projektach."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Jak zarządzanie wiedzą wspiera uwzględnianie kosztów cyklu życia i kosztów operacyjnych (np. konserwacja, recykling)?",
            "answer_options": {
              "A": "Koszty cyklu życia i koszty operacyjne nie są uwzględniane w procesie ZW.",
              "B": "Koszty cyklu życia i koszty operacyjne są uwzględniane, ale w ograniczonym zakresie.",
              "C": "Koszty cyklu życia i koszty operacyjne są uwzględniane w większości projektów, ale nie kompleksowo.",
              "D": "Koszty cyklu życia i koszty operacyjne są w pełni uwzględniane w większości projektów.",
              "E": "Koszty cyklu życia i koszty operacyjne są w pełni uwzględniane i mają największy wpływ na decyzje projektowe."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak zarządzanie wiedzą wpływa na czas wprowadzenia na rynek (TTM) i terminy dostaw?",
            "answer_options": {
              "A": "Czas wprowadzenia na rynek i terminy dostaw nie są wspierane przez zarządzanie wiedzą.",
              "B": "Czas wprowadzenia na rynek jest uwzględniany, ale nie ma krytycznego wpływu na decyzje.",
              "C": "Czas wprowadzenia na rynek jest uwzględniany w procesie ZW, ale nie zawsze ma duży wpływ.",
              "D": "Czas wprowadzenia na rynek jest regularnie uwzględniany i wpływa na decyzje ZW.",
              "E": "Czas wprowadzenia na rynek jest kluczowy i w pełni uwzględniany w procesie ZW."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Jak ZW wspiera ocenę liczby różnych produktów w portfolio firmy?",
            "answer_options": {
              "A": "ZW nie wspiera oceny liczby różnych produktów w portfolio.",
              "B": "ZW wspiera ocenę liczby różnych produktów, ale nie systematycznie.",
              "C": "ZW wspiera ocenę liczby produktów, ale nie systematycznie we wszystkich przypadkach.",
              "D": "ZW wspiera ocenę liczby różnych produktów i wpływa na decyzje strategiczne.",
              "E": "ZW w pełni wspiera ocenę liczby różnych produktów i jest integralną częścią procesu podejmowania decyzji."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu ZW uwzględnia poziom dostosowania produktu do potrzeb klienta?",
            "answer_options": {
              "A": "Poziom dostosowania produktu nie jest uwzględniany w procesie ZW.",
              "B": "Poziom dostosowania produktu jest uwzględniany, ale nie we wszystkich projektach.",
              "C": "Poziom dostosowania produktu jest regularnie uwzględniany, ale nie kompleksowo.",
              "D": "Poziom dostosowania produktu jest kluczowym czynnikiem i jest uwzględniany w większości projektów.",
              "E": "Poziom dostosowania produktu jest w pełni uwzględniany i ma duży wpływ na decyzje projektowe."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak zarządzanie wiedzą wspiera innowacje w firmie?",
            "answer_options": {
              "A": "Proces innowacji nie jest wspierany przez ZW.",
              "B": "ZW wspiera innowacje, ale w ograniczonym zakresie.",
              "C": "ZW wspiera innowacje w większości projektów, ale nie zawsze systematycznie.",
              "D": "ZW wspiera innowacje we wszystkich projektach i ma wpływ na rozwój produktu.",
              "E": "ZW jest priorytetem w innowacjach i wspiera wszystkie projekty kompleksowo."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Jak zasady ZW wspierają budowanie wizerunku marki?",
            "answer_options": {
              "A": "Wizerunek marki nie jest wspierany przez zasady ZW.",
              "B": "Wizerunek marki jest wspierany przez ZW, ale nie jest priorytetem.",
              "C": "Wizerunek marki jest uwzględniany w większości projektów, ale nie zawsze ma duży wpływ.",
              "D": "Wizerunek marki jest kluczowym elementem w ZW i wpływa na decyzje projektowe.",
              "E": "Wizerunek marki jest w pełni zintegrowany z ZW i ma duży wpływ na decyzje."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak zarządzanie wiedzą wspiera wydajność funkcjonalną produktów (np. produktywność, szybkość, dokładność)?",
            "answer_options": {
              "A": "Wydajność funkcjonalna nie jest monitorowana jako część ZW.",
              "B": "Wydajność funkcjonalna jest uwzględniana, ale nie jest regularnie monitorowana.",
              "C": "Wydajność funkcjonalna jest uwzględniana, ale nie jest monitorowana we wszystkich projektach.",
              "D": "Wydajność funkcjonalna jest systematycznie monitorowana i uwzględniana w procesie ZW.",
              "E": "Wydajność funkcjonalna jest integralną częścią ZW i ma znaczący wpływ na decyzje."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak zarządzanie wiedzą wspiera monitorowanie wydajności jakościowej produktu (np. trwałość, niezawodność)?",
            "answer_options": {
              "A": "Wydajność jakościowa nie jest uwzględniana w procesie ZW.",
              "B": "Wydajność jakościowa jest uwzględniana, ale nie kompleksowo.",
              "C": "Wydajność jakościowa jest uwzględniana, ale nie zawsze jest priorytetem.",
              "D": "Wydajność jakościowa jest priorytetem i regularnie monitorowana w procesie ZW.",
              "E": "Wydajność jakościowa jest priorytetem i w pełni monitorowana we wszystkich projektach."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Jak zarządzanie wiedzą wspiera zgodność z przepisami i standardami prawnymi?",
            "answer_options": {
              "A": "Zarządzanie wiedzą nie wspiera zgodności z przepisami i standardami.",
              "B": "Zarządzanie wiedzą uwzględnia zgodność z przepisami, ale nie jako priorytet.",
              "C": "Zarządzanie wiedzą wspiera zgodność z przepisami, ale nie kompleksowo.",
              "D": "Zarządzanie wiedzą wspiera zgodność z przepisami i standardami w większości projektów.",
              "E": "Zarządzanie wiedzą w pełni wspiera zgodność z przepisami i standardami i ma duży wpływ na decyzje."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jakie inne aspekty (np. zrównoważony rozwój środowiskowy, estetyka) są uwzględniane w procesie ZW?",
            "answer_options": {
              "A": "Inne aspekty, takie jak zrównoważony rozwój środowiskowy, nie są uwzględniane w ZW.",
              "B": "Inne aspekty, takie jak zrównoważony rozwój środowiskowy, są sporadycznie uwzględniane, ale nie systematycznie.",
              "C": "Inne aspekty, takie jak zrównoważony rozwój środowiskowy, są uwzględniane, ale nie systematycznie we wszystkich projektach.",
              "D": "Inne aspekty, takie jak zrównoważony rozwój środowiskowy, są regularnie uwzględniane i wpływają na decyzje.",
              "E": "Inne aspekty, takie jak zrównoważony rozwój środowiskowy, są integralną częścią procesu ZW i mają duży wpływ na decyzje projektowe."
            },
            "selected_answer": "C"
          }
        ]
      },
      {
        "section_name": "TECHNIKI ZW",
        "question_count": 11,
        "questions": [
          {
            "question_text": "W jakim stopniu komunikacja werbalna z kolegami jest używana do dzielenia się wiedzą?",
            "answer_options": {
              "A": "Komunikacja werbalna z kolegami jest rzadko używana do dzielenia się wiedzą.",
              "B": "Komunikacja werbalna z kolegami jest sporadycznie używana do dzielenia się wiedzą.",
              "C": "Komunikacja werbalna z kolegami jest regularnie używana do dzielenia się wiedzą, ale nie we wszystkich przypadkach.",
              "D": "Komunikacja werbalna z kolegami jest skutecznie używana do dzielenia się wiedzą we wszystkich projektach.",
              "E": "Komunikacja werbalna z kolegami jest priorytetem i w pełni używana do dzielenia się wiedzą na wszystkich etapach projektu."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak często tworzone i wykorzystywane są dokumenty z wyciągniętymi wnioskami?",
            "answer_options": {
              "A": "Dokumenty z wyciągniętymi wnioskami nie są regularnie tworzone ani używane.",
              "B": "Dokumenty z wyciągniętymi wnioskami są czasami tworzone, ale rzadko używane.",
              "C": "Dokumenty z wyciągniętymi wnioskami są regularnie tworzone i używane w niektórych projektach.",
              "D": "Dokumenty z wyciągniętymi wnioskami są systematycznie tworzone i używane w większości projektów.",
              "E": "Dokumenty z wyciągniętymi wnioskami są w pełni zintegrowane z procesem i regularnie używane we wszystkich projektach."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu specyfikacje projektowe są używane w procesach zarządzania wiedzą?",
            "answer_options": {
              "A": "Specyfikacje projektowe są rzadko używane do dzielenia się wiedzą.",
              "B": "Specyfikacje projektowe są sporadycznie używane do dzielenia się wiedzą, ale nie systematycznie.",
              "C": "Specyfikacje projektowe są systematycznie używane do dzielenia się wiedzą, ale nie we wszystkich projektach.",
              "D": "Specyfikacje projektowe są w pełni używane do dzielenia się wiedzą we wszystkich projektach.",
              "E": "Specyfikacje projektowe są w pełni i systematycznie używane do dzielenia się wiedzą w każdym projekcie."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak skutecznie kwestionariusze i listy kontrolne wspierają zarządzanie wiedzą?",
            "answer_options": {
              "A": "Kwestionariusze i listy kontrolne nie są skutecznie używane w zarządzaniu wiedzą.",
              "B": "Kwestionariusze i listy kontrolne są używane, ale ich skuteczność jest ograniczona.",
              "C": "Kwestionariusze i listy kontrolne są skutecznie używane, ale nie są priorytetem w zarządzaniu wiedzą.",
              "D": "Kwestionariusze i listy kontrolne są skutecznie używane i mają duży wpływ na zarządzanie wiedzą.",
              "E": "Kwestionariusze i listy kontrolne są priorytetem i skutecznie wspierają zarządzanie wiedzą na każdym etapie."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu sale konferencyjne, plakaty i zarządzanie wizualne są używane do dzielenia się wiedzą?",
            "answer_options": {
              "A": "Sale konferencyjne, plakaty i zarządzanie wizualne są rzadko używane do dzielenia się wiedzą.",
              "B": "Sale konferencyjne, plakaty i zarządzanie wizualne są sporadycznie używane do dzielenia się wiedzą.",
              "C": "Sale konferencyjne, plakaty i zarządzanie wizualne są regularnie używane do dzielenia się wiedzą, ale nie we wszystkich przypadkach.",
              "D": "Sale konferencyjne, plakaty i zarządzanie wizualne są w pełni używane do dzielenia się wiedzą.",
              "E": "Sale konferencyjne, plakaty i zarządzanie wizualne są kluczową częścią procesu dzielenia się wiedzą i są w pełni używane."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak często wspólne foldery sieciowe są używane do przechowywania i dzielenia się wiedzą?",
            "answer_options": {
              "A": "Wspólne foldery sieciowe są rzadko używane do przechowywania i dzielenia się wiedzą.",
              "B": "Wspólne foldery sieciowe są sporadycznie używane do przechowywania i dzielenia się wiedzą, ale nie systematycznie.",
              "C": "Wspólne foldery sieciowe są systematycznie używane do przechowywania i dzielenia się wiedzą, ale nie kompleksowo.",
              "D": "Wspólne foldery sieciowe są regularnie używane i wspierają proces zarządzania wiedzą.",
              "E": "Wspólne foldery sieciowe są priorytetem do przechowywania i dzielenia się wiedzą, regularnie aktualizowane i używane."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu intranet wspiera proces zarządzania wiedzą?",
            "answer_options": {
              "A": "Intranet nie jest regularnie używany do wspierania zarządzania wiedzą.",
              "B": "Intranet jest sporadycznie używany do wspierania zarządzania wiedzą, ale nie zawsze skutecznie.",
              "C": "Intranet jest regularnie używany do wspierania zarządzania wiedzą, ale nie zawsze efektywnie.",
              "D": "Intranet jest skutecznie używany do wspierania zarządzania wiedzą we wszystkich projektach.",
              "E": "Intranet jest integralnym narzędziem wspierającym zarządzanie wiedzą i jest używany we wszystkich projektach."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak strony internetowe są używane do pracy nad projektami współprawczymi (np. Wiki) w zarządzaniu wiedzą?",
            "answer_options": {
              "A": "Strony internetowe używane do pracy nad projektami współprawczymi nie są używane do zarządzania wiedzą.",
              "B": "Strony internetowe używane do pracy nad projektami współprawczymi są używane w ograniczonym zakresie w zarządzaniu wiedzą.",
              "C": "Strony internetowe używane do pracy nad projektami współprawczymi są używane w większości przypadków, ale nie są jeszcze optymalne.",
              "D": "Strony internetowe używane do pracy nad projektami współprawczymi są skutecznie używane do zarządzania wiedzą.",
              "E": "Strony internetowe używane do pracy nad projektami współprawczymi są w pełni zintegrowane z procesem zarządzania wiedzą i wspierają projekty na wszystkich etapach."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Jak blogi, fora i tablice ogłoszeń są używane w zarządzaniu wiedzą?",
            "answer_options": {
              "A": "Blogi, fora i tablice ogłoszeń nie są używane do zarządzania wiedzą.",
              "B": "Blogi, fora i tablice ogłoszeń są używane w ograniczonym zakresie w zarządzaniu wiedzą.",
              "C": "Blogi, fora i tablice ogłoszeń są używane w większości przypadków, ale nie są jeszcze optymalne.",
              "D": "Blogi, fora i tablice ogłoszeń są skutecznie używane do zarządzania wiedzą.",
              "E": "Blogi, fora i tablice ogłoszeń są w pełni zintegrowane z procesem zarządzania wiedzą i wspierają projekty na wszystkich etapach."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak systemy PDM/PLM wspierają zarządzanie wiedzą?",
            "answer_options": {
              "A": "Systemy PDM/PLM nie są skutecznie używane do zarządzania wiedzą.",
              "B": "Systemy PDM/PLM są sporadycznie używane do zarządzania wiedzą, ale nie systematycznie.",
              "C": "Systemy PDM/PLM są skutecznie używane w większości projektów, ale nie zawsze kompleksowo.",
              "D": "Systemy PDM/PLM są w pełni zintegrowane z procesem zarządzania wiedzą we wszystkich projektach.",
              "E": "Systemy PDM/PLM są w pełni wdrożone i wspierają zarządzanie wiedzą na każdym etapie rozwoju produktu."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Jakie korzyści oprogramowanie KBE i automatyzacja projektowania przynoszą zarządzaniu wiedzą?",
            "answer_options": {
              "A": "Oprogramowanie KBE i automatyzacja projektowania nie są używane do zarządzania wiedzą.",
              "B": "Oprogramowanie KBE i automatyzacja projektowania są używane w ograniczonym zakresie w zarządzaniu wiedzą.",
              "C": "Oprogramowanie KBE i automatyzacja projektowania są regularnie używane, ale nie kompleksowo.",
              "D": "Oprogramowanie KBE i automatyzacja projektowania są skutecznie używane w zarządzaniu wiedzą w większości projektów.",
              "E": "Oprogramowanie KBE i automatyzacja projektowania są integralną częścią zarządzania wiedzą i są używane we wszystkich projektach."
            },
            "selected_answer": "C"
          }
        ]
      },
      {
        "section_name": "METODY",
        "question_count": 11,
        "questions": [
          {
            "question_text": "W jakim stopniu zasady modularyzacji i standaryzacji części są używane w procesie projektowania?",
            "answer_options": {
              "A": "Zasady modularyzacji i standaryzacji części nie są używane w procesie projektowania.",
              "B": "Zasady modularyzacji i standaryzacji części są stosowane sporadycznie.",
              "C": "Zasady modularyzacji i standaryzacji części są regularnie stosowane, ale nie we wszystkich projektach.",
              "D": "Zasady modularyzacji i standaryzacji części są skutecznie stosowane we wszystkich projektach.",
              "E": "Zasady modularyzacji i standaryzacji części są priorytetem i stosowane we wszystkich projektach na każdym etapie."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu Design for X (DFX) jest stosowany w odniesieniu do wydajności funkcjonalnej?",
            "answer_options": {
              "A": "Design for X (DFX) nie jest stosowany w odniesieniu do wydajności funkcjonalnej.",
              "B": "Design for X (DFX) jest stosowany, ale w ograniczonym zakresie w odniesieniu do wydajności funkcjonalnej.",
              "C": "Design for X (DFX) jest stosowany w większości projektów, ale nie w pełni kompleksowo.",
              "D": "Design for X (DFX) jest kluczowym elementem w projektach w odniesieniu do wydajności funkcjonalnej.",
              "E": "Design for X (DFX) jest integralną częścią każdego projektu i w pełni wspiera wydajność funkcjonalną."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak Design for X (DFX) wspiera wydajność jakościową produktu?",
            "answer_options": {
              "A": "Design for X (DFX) nie wspiera wydajności jakościowej produktu.",
              "B": "Design for X (DFX) wspiera wydajność jakościową produktu, ale nie jest to powszechne.",
              "C": "Design for X (DFX) wspiera wydajność jakościową produktu w większości przypadków, ale nie zawsze.",
              "D": "Design for X (DFX) w pełni wspiera wydajność jakościową produktu.",
              "E": "Design for X (DFX) jest priorytetem i w pełni wspiera wydajność jakościową produktu."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu Design for X (DFX) uwzględnia inne czynniki postrzegalne przez klienta, takie jak estetyka czy ekodesign?",
            "answer_options": {
              "A": "Design for X (DFX) rzadko uwzględnia inne czynniki postrzegalne przez klienta, takie jak estetyka czy ekodesign.",
              "B": "Design for X (DFX) czasami uwzględnia inne czynniki, takie jak estetyka czy ekodesign, ale nie systematycznie.",
              "C": "Design for X (DFX) regularnie uwzględnia inne czynniki postrzegalne przez klienta, ale nie zawsze systematycznie.",
              "D": "Design for X (DFX) uwzględnia czynniki takie jak estetyka i ekodesign w większości projektów.",
              "E": "Design for X (DFX) uwzględnia wszystkie czynniki postrzegalne przez klienta, takie jak estetyka i ekodesign, i jest kluczowy w każdym projekcie."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak skutecznie stosowany jest Design to Cost (DTC) i Target Cost Management (TCM)?",
            "answer_options": {
              "A": "Design to Cost (DTC) i Target Cost Management (TCM) nie są stosowane.",
              "B": "Design to Cost (DTC) i Target Cost Management (TCM) są stosowane, ale rzadko.",
              "C": "Design to Cost (DTC) i Target Cost Management (TCM) są stosowane w większości projektów, ale nie zawsze kompleksowo.",
              "D": "Design to Cost (DTC) i Target Cost Management (TCM) są skutecznie stosowane we wszystkich projektach.",
              "E": "Design to Cost (DTC) i Target Cost Management (TCM) są integralną częścią każdego projektu i mają duży wpływ na koszty."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu Analiza Kosztów Cyklu Życia (LCC) i Calkowity Koszt Posiadania (TCO) są uwzględniane w procesie projektowania?",
            "answer_options": {
              "A": "Analiza Kosztów Cyklu Życia (LCC) i Calkowity Koszt Posiadania (TCO) nie są uwzględniane w procesie projektowania.",
              "B": "Analiza Kosztów Cyklu Życia (LCC) i Calkowity Koszt Posiadania (TCO) są sporadycznie uwzględniane w procesie projektowania.",
              "C": "Analiza Kosztów Cyklu Życia (LCC) i Calkowity Koszt Posiadania (TCO) są regularnie uwzględniane, ale nie kompleksowo.",
              "D": "Analiza Kosztów Cyklu Życia (LCC) i Calkowity Koszt Posiadania (TCO) są w pełni uwzględniane w procesie projektowania.",
              "E": "Analiza Kosztów Cyklu Życia (LCC) i Calkowity Koszt Posiadania (TCO) są w pełni uwzględniane na każdym etapie procesu projektowania."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak skutecznie prowadzona jest Analiza i Inżynieria Cyklu Życia (LCA&E)?",
            "answer_options": {
              "A": "Analiza i Inżynieria Cyklu Życia (LCA&E) nie jest prowadzona.",
              "B": "Analiza i Inżynieria Cyklu Życia (LCA&E) jest prowadzona, ale w ograniczonym zakresie.",
              "C": "Analiza i Inżynieria Cyklu życia (LCA&E) jest prowadzona w większości projektów, ale nie zawsze.",
              "D": "Analiza i Inżynieria Cyklu Życia (LCA&E) jest skutecznie prowadzona we wszystkich projektach.",
              "E": "Analiza i Inżynieria Cyklu Życia (LCA&E) jest priorytetem w każdym projekcie i systematycznie prowadzona."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak Analiza i Inżynieria Wartości (VA&E) wspiera proces projektowania?",
            "answer_options": {
              "A": "Analiza i Inżynieria Wartości (VA&E) nie jest używana w procesie projektowania.",
              "B": "Analiza i Inżynieria Wartości (VA&E) jest używana, ale jej wpływ jest ograniczony.",
              "C": "Analiza i Inżynieria Wartości (VA&E) jest używana, ale jej wpływ nie jest jeszcze zmaksymalizowany.",
              "D": "Analiza i Inżynieria Wartości (VA&E) jest używana we wszystkich projektach i ma znaczący wpływ na proces projektowania.",
              "E": "Analiza i Inżynieria Wartości (VA&E) jest kluczowym elementem każdego projektu i znacząco wpływa na finalny wynik."
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Jak skutecznie Funkcje Jakości (QFD) są stosowane w procesie projektowania?",
            "answer_options": {
              "A": "Funkcje Jakości (QFD) nie są stosowane w procesie projektowania.",
              "B": "Funkcje Jakości (QFD) są stosowane, ale nie we wszystkich projektach.",
              "C": "Funkcje Jakości (QFD) są stosowane systematycznie, ale nie na wszystkich etapach projektu.",
              "D": "Funkcje Jakości (QFD) są regularnie stosowane w każdym projekcie i wspierają cały proces rozwoju.",
              "E": "Funkcje Jakości (QFD) są w pełni stosowane na każdym etapie rozwoju produktu i są integralną częścią procesu."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu Analiza Rodzajów i Skutków Uszkodzeń (FMEA/FMECA) wspiera rozwój produktu?",
            "answer_options": {
              "A": "Analiza Rodzajów i Skutków Uszkodzeń (FMEA/FMECA) nie jest stosowana.",
              "B": "Analiza Rodzajów i Skutków Uszkodzeń (FMEA/FMECA) jest stosowana, ale jej skuteczność jest ograniczona.",
              "C": "Analiza Rodzajów i Skutków Uszkodzeń (FMEA/FMECA) jest skutecznie stosowana w większości projektów.",
              "D": "Analiza Rodzajów i Skutków Uszkodzeń (FMEA/FMECA) jest stosowana systematycznie i ma duży wpływ na rozwój produktu.",
              "E": "Analiza Rodzajów i Skutków Uszkodzeń (FMEA/FMECA) jest stosowana we wszystkich projektach i ma kluczowy wpływ na decyzje projektowe."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu systematyczne metody innowacji, takie jak TRIZ, są stosowane w procesie projektowania?",
            "answer_options": {
              "A": "Systematyczne metody innowacji, takie jak TRIZ, nie są stosowane.",
              "B": "Systematyczne metody innowacji, takie jak TRIZ, są stosowane w ograniczonym zakresie.",
              "C": "Systematyczne metody innowacji, takie jak TRIZ, są regularnie stosowane, ale nie zawsze kompleksowo.",
              "D": "Systematyczne metody innowacji, takie jak TRIZ, są stosowane w większości projektów i wspierają innowacje.",
              "E": "Systematyczne metody innowacji, takie jak TRIZ, są w pełni zintegrowane z procesem projektowania i stosowane we wszystkich projektach."
            },
            "selected_answer": "B"
          }
        ]
      },
      {
        "section_name": "KOMPUTERYZACJA I OPROGRAMOWANIE",
        "question_count": 22,
        "questions": [
          {
            "question_text": "W jakim stopniu automatyzacja biurowa (np. arkusze kalkulacyjne, procesory tekstu) wspiera proces rozwoju produktu?",
            "answer_options": {
              "A": "Automatyzacja biurowa nie jest używana do wspierania procesu rozwoju produktu.",
              "B": "Automatyzacja biurowa jest sporadycznie używana do wspierania procesu rozwoju produktu.",
              "C": "Automatyzacja biurowa jest regularnie używana do wspierania procesu rozwoju produktu, ale nie we wszystkich projektach.",
              "D": "Automatyzacja biurowa jest skutecznie używana do wspierania procesu rozwoju produktu we wszystkich projektach.",
              "E": "Automatyzacja biurowa jest priorytetem i w pełni wspiera proces rozwoju produktu w każdym projekcie."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu systemy CAD 2D są używane w procesie projektowania?",
            "answer_options": {
              "A": "Systemy CAD 2D nie są powszechnie używane w procesie projektowania.",
              "B": "Systemy CAD 2D są używane w ograniczonym zakresie w procesie projektowania.",
              "C": "Systemy CAD 2D są używane w większości projektów, ale nie zawsze kompleksowo.",
              "D": "Systemy CAD 2D są w pełni używane we wszystkich projektach.",
              "E": "Systemy CAD 2D są w pełni zintegrowane z każdym projektem i wspierają cały proces projektowania."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jakie korzyści systemy CAD 3D przynoszą rozwojowi produktu?",
            "answer_options": {
              "A": "Systemy CAD 3D są rzadko używane w procesie rozwoju produktu.",
              "B": "Systemy CAD 3D są używane, ale nie we wszystkich projektach.",
              "C": "Systemy CAD 3D są używane w większości projektów i wspierają rozwój produktu, ale nie zawsze w pełni.",
              "D": "Systemy CAD 3D są skutecznie używane i wspierają rozwój produktu we wszystkich projektach.",
              "E": "Systemy CAD 3D są priorytetem i wspierają rozwój produktu na każdym etapie."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu modele cyfrowe (DMU) wspierają rozwój produktu?",
            "answer_options": {
              "A": "Modele cyfrowe (DMU) nie są używane w procesie rozwoju produktu.",
              "B": "Modele cyfrowe (DMU) są używane, ale nie systematycznie.",
              "C": "Modele cyfrowe (DMU) są regularnie używane, ale nie zawsze kompleksowo.",
              "D": "Modele cyfrowe (DMU) są używane we wszystkich projektach i mają duży wpływ na rozwój produktu.",
              "E": "Modele cyfrowe (DMU) są integralną częścią każdego projektu i w pełni wspierają rozwój produktu."
            },
            "selected_answer": "D"
          },
          {
            "question_text": "W jakim stopniu komputerowe wspomaganie stylizacji (CAS) jest używane w projektach rozwoju produktu?",
            "answer_options": {
              "A": "Komputerowe wspomaganie stylizacji (CAS) nie jest używane w projektach.",
              "B": "Komputerowe wspomaganie stylizacji (CAS) jest sporadycznie używane w projektach.",
              "C": "Komputerowe wspomaganie stylizacji (CAS) jest używane w większości projektów, ale nie zawsze kompleksowo.",
              "D": "Komputerowe wspomaganie stylizacji (CAS) jest skutecznie używane we wszystkich projektach.",
              "E": "Komputerowe wspomaganie stylizacji (CAS) jest kluczowym elementem w każdym projekcie."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "W jakim stopniu komputerowe wspomaganie inżynierii (CAE) wspiera proces projektowania?",
            "answer_options": {
              "A": "Komputerowe wspomaganie inżynierii (CAE) nie wspiera procesu projektowania.",
              "B": "Komputerowe wspomaganie inżynierii (CAE) jest używane, ale nie we wszystkich projektach.",
              "C": "Komputerowe wspomaganie inżynierii (CAE) jest używane w większości projektów, ale nie zawsze w pełni.",
              "D": "Komputerowe wspomaganie inżynierii (CAE) jest w pełni używane we wszystkich projektach.",
              "E": "Komputerowe wspomaganie inżynierii (CAE) jest w pełni zintegrowane z każdym projektem i wspiera cały proces rozwoju."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu metoda analizy elementów skończonych (FEA/FEM) jest używana w procesach projektowania?",
            "answer_options": {
              "A": "Metoda analizy elementów skończonych (FEA/FEM) nie jest używana do projektowania.",
              "B": "Metoda analizy elementów skończonych (FEA/FEM) jest stosowana, ale nie we wszystkich przypadkach.",
              "C": "Metoda analizy elementów skończonych (FEA/FEM) jest regularnie stosowana, ale nie kompleksowo.",
              "D": "Metoda analizy elementów skończonych (FEA/FEM) jest skutecznie stosowana we wszystkich projektach.",
              "E": "Metoda analizy elementów skończonych (FEA/FEM) jest priorytetem i używana w każdym projekcie."
            },
            "selected_answer": "A"
          },
          {
            "question_text": "W jakim stopniu obliczeniowa dynamika płynów (CFD) jest używana w projektach?",
            "answer_options": {
              "A": "Obliczeniowa dynamika płynów (CFD) nie jest używana w projektach.",
              "B": "Obliczeniowa dynamika płynów (CFD) jest używana, ale nie we wszystkich projektach.",
              "C": "Obliczeniowa dynamika płynów (CFD) jest używana w większości projektów, ale nie kompleksowo.",
              "D": "Obliczeniowa dynamika płynów (CFD) jest w pełni używana we wszystkich projektach.",
              "E": "Obliczeniowa dynamika płynów (CFD) jest w pełni używana we wszystkich projektach i wspiera procesy rozwoju."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu KBE i automatyzacja projektowania wspierają procesy projektowania?",
            "answer_options": {
              "A": "KBE i automatyzacja projektowania nie są używane w procesie projektowania.",
              "B": "KBE i automatyzacja projektowania są używane, ale ich zastosowanie jest ograniczone.",
              "C": "KBE i automatyzacja projektowania są regularnie używane, ale nie we wszystkich projektach.",
              "D": "KBE i automatyzacja projektowania są skutecznie używane w większości projektów.",
              "E": "KBE i automatyzacja projektowania są priorytetem i są stosowane kompleksowo w każdym projekcie."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu komputerowe wspomaganie produkcji (CAM) jest używane w procesie produkcyjnym?",
            "answer_options": {
              "A": "Komputerowe wspomaganie produkcji (CAM) nie jest używane w procesie produkcyjnym.",
              "B": "Komputerowe wspomaganie produkcji (CAM) jest sporadycznie używane w procesie produkcyjnym.",
              "C": "Komputerowe wspomaganie produkcji (CAM) jest używane w większości projektów, ale nie zawsze kompleksowo.",
              "D": "Komputerowe wspomaganie produkcji (CAM) jest systematycznie używane we wszystkich projektach.",
              "E": "Komputerowe wspomaganie produkcji (CAM) jest w pełni używane we wszystkich projektach."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu symulacja zdarzeń dyskretnych (DES) wspiera procesy rozwoju produktu?",
            "answer_options": {
              "A": "Symulacja zdarzeń dyskretnych (DES) nie wspiera procesów rozwoju produktu.",
              "B": "Symulacja zdarzeń dyskretnych (DES) jest stosowana, ale nie kompleksowo.",
              "C": "Symulacja zdarzeń dyskretnych (DES) jest stosowana w większości projektów, ale nie zawsze systematycznie.",
              "D": "Symulacja zdarzeń dyskretnych (DES) jest stosowana we wszystkich projektach i wspiera procesy rozwoju produktu.",
              "E": "Symulacja zdarzeń dyskretnych (DES) jest priorytetem i w pełni wspiera wszystkie procesy rozwoju produktu."
            },
            "selected_answer": "D"
          },
          {
            "question_text": "W jakim stopniu komputerowe wspomaganie planowania procesów (CAPP)/fabryki cyfrowe wspierają proces rozwoju produktu?",
            "answer_options": {
              "A": "Komputerowe wspomaganie planowania procesów (CAPP)/fabryki cyfrowe nie wspierają procesu rozwoju produktu.",
              "B": "Komputerowe wspomaganie planowania procesów (CAPP)/fabryki cyfrowe są sporadycznie używane w procesie rozwoju produktu.",
              "C": "Komputerowe wspomaganie planowania procesów (CAPP)/fabryki cyfrowe są regularnie używane, ale nie we wszystkich projektach.",
              "D": "Komputerowe wspomaganie planowania procesów (CAPP)/fabryki cyfrowe są w pełni używane w procesie rozwoju produktu.",
              "E": "Komputerowe wspomaganie planowania procesów (CAPP)/fabryki cyfrowe są integralną częścią każdego procesu rozwoju produktu."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "W jakim stopniu rzeczywistość wirtualna (VR) i rzeczywistość rozszerzona (AR) są używane w rozwoju produktu?",
            "answer_options": {
              "A": "Rzeczywistość wirtualna (VR) i rzeczywistość rozszerzona (AR) nie są używane w rozwoju produktu.",
              "B": "Rzeczywistość wirtualna (VR) i rzeczywistość rozszerzona (AR) są stosowane, ale nie we wszystkich projektach.",
              "C": "Rzeczywistość wirtualna (VR) i rzeczywistość rozszerzona (AR) są stosowane w większości projektów, ale nie kompleksowo.",
              "D": "Rzeczywistość wirtualna (VR) i rzeczywistość rozszerzona (AR) są skutecznie używane we wszystkich projektach.",
              "E": "Rzeczywistość wirtualna (VR) i rzeczywistość rozszerzona (AR) są w pełni zintegrowane z każdym projektem i mają znaczący wpływ na rozwój produktu."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak systemy PDM/PLM wspierają zarządzanie danymi produktu?",
            "answer_options": {
              "A": "Systemy PDM/PLM nie wspierają zarządzania danymi produktu.",
              "B": "Systemy PDM/PLM są stosowane, ale nie systematycznie we wszystkich projektach.",
              "C": "Systemy PDM/PLM są regularnie stosowane w większości projektów, ale nie zawsze kompleksowo.",
              "D": "Systemy PDM/PLM są w pełni stosowane we wszystkich projektach i wspierają zarządzanie danymi produktu.",
              "E": "Systemy PDM/PLM są w pełni stosowane we wszystkich projektach i są kluczowym narzędziem w zarządzaniu danymi produktu."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Jakie korzyści systemy zarządzania dokumentami (DMS) przynoszą projektom?",
            "answer_options": {
              "A": "Systemy zarządzania dokumentami (DMS) nie są używane w projektach.",
              "B": "Systemy zarządzania dokumentami (DMS) są używane, ale nie zawsze kompleksowo.",
              "C": "Systemy zarządzania dokumentami (DMS) są regularnie stosowane, ale nie we wszystkich projektach.",
              "D": "Systemy zarządzania dokumentami (DMS) są w pełni stosowane we wszystkich projektach.",
              "E": "Systemy zarządzania dokumentami (DMS) są integralną częścią każdego projektu i w pełni wspierają zarządzanie dokumentami."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu system zarządzania przepływem pracy (WMS) wspiera zarządzanie projektami?",
            "answer_options": {
              "A": "System zarządzania przepływem pracy (WMS) nie wspiera zarządzania projektami.",
              "B": "System zarządzania przepływem pracy (WMS) jest sporadycznie używany w projektach.",
              "C": "System zarządzania przepływem pracy (WMS) jest regularnie używany, ale nie kompleksowo.",
              "D": "System zarządzania przepływem pracy (WMS) jest skutecznie używany we wszystkich projektach.",
              "E": "System zarządzania przepływem pracy (WMS) jest w pełni używany w każdym projekcie."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu planowanie zasobów przedsiębiorstwa (ERP) jest stosowane w procesach rozwoju produktu?",
            "answer_options": {
              "A": "Planowanie zasobów przedsiębiorstwa (ERP) nie jest stosowane w procesach rozwoju produktu.",
              "B": "Planowanie zasobów przedsiębiorstwa (ERP) jest stosowane, ale nie we wszystkich projektach.",
              "C": "Planowanie zasobów przedsiębiorstwa (ERP) jest regularnie stosowane, ale nie kompleksowo.",
              "D": "Planowanie zasobów przedsiębiorstwa (ERP) jest stosowane we wszystkich projektach i wspiera procesy rozwoju produktu.",
              "E": "Planowanie zasobów przedsiębiorstwa (ERP) jest kluczowym narzędziem wspierającym procesy rozwoju produktu i jest w pełni stosowane."
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Jak zarządzanie łańcuchem dostaw (SCM) wspiera rozwój produktu?",
            "answer_options": {
              "A": "Zarządzanie łańcuchem dostaw (SCM) nie wspiera rozwoju produktu.",
              "B": "Zarządzanie łańcuchem dostaw (SCM) wspiera rozwój produktu, ale nie systematycznie.",
              "C": "Zarządzanie łańcuchem dostaw (SCM) wspiera rozwój produktu, ale nie kompleksowo.",
              "D": "Zarządzanie łańcuchem dostaw (SCM) wspiera rozwój produktu we wszystkich projektach.",
              "E": "Zarządzanie łańcuchem dostaw (SCM) jest w pełni zintegrowane w każdym projekcie i w pełni wspiera procesy rozwoju."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu systemy zarządzania relacjami z klientami (CRM) wpływają na rozwój produktu?",
            "answer_options": {
              "A": "Systemy zarządzania relacjami z klientami (CRM) nie wpływają na rozwój produktu.",
              "B": "Systemy zarządzania relacjami z klientami (CRM) mają ograniczony wpływ na rozwój produktu.",
              "C": "Systemy zarządzania relacjami z klientami (CRM) są regularnie stosowane, ale nie we wszystkich projektach.",
              "D": "Systemy zarządzania relacjami z klientami (CRM) są w pełni stosowane we wszystkich projektach.",
              "E": "Systemy zarządzania relacjami z klientami (CRM) są krytyczne dla rozwoju produktu i w pełni stosowane."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Jak systemy zarządzania relacjami z dostawcami (SRM) wspierają proces rozwoju produktu?",
            "answer_options": {
              "A": "Systemy zarządzania relacjami z dostawcami (SRM) nie wspierają procesu rozwoju produktu.",
              "B": "Systemy zarządzania relacjami z dostawcami (SRM) są stosowane, ale nie we wszystkich przypadkach.",
              "C": "Systemy zarządzania relacjami z dostawcami (SRM) są regularnie stosowane, ale nie we wszystkich projektach.",
              "D": "Systemy zarządzania relacjami z dostawcami (SRM) są skutecznie stosowane we wszystkich projektach.",
              "E": "Systemy zarządzania relacjami z dostawcami (SRM) są priorytetem i są stosowane kompleksowo w każdym projekcie."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu skomputeryzowany system zarządzania konserwacją (CMMS) jest stosowany w procesach rozwoju produktu?",
            "answer_options": {
              "A": "Skomputeryzowany system zarządzania konserwacją (CMMS) nie jest stosowany w procesach rozwoju produktu.",
              "B": "Skomputeryzowany system zarządzania konserwacją (CMMS) jest stosowany w ograniczonym zakresie.",
              "C": "Skomputeryzowany system zarządzania konserwacją (CMMS) jest regularnie stosowany, ale nie kompleksowo.",
              "D": "Skomputeryzowany system zarządzania konserwacją (CMMS) jest stosowany we wszystkich projektach.",
              "E": "Skomputeryzowany system zarządzania konserwacją (CMMS) jest integralną częścią każdego projektu i wspiera wszystkie procesy rozwoju produktu."
            },
            "selected_answer": "B"
          },
          {
            "question_text": "W jakim stopniu oprogramowanie do zarządzania projektami wpływa na rozwój produktu?",
            "answer_options": {
              "A": "Oprogramowanie do zarządzania projektami nie wpływa na rozwój produktu.",
              "B": "Oprogramowanie do zarządzania projektami ma ograniczony wpływ na rozwój produktu.",
              "C": "Oprogramowanie do zarządzania projektami jest regularnie używane, ale nie we wszystkich projektach.",
              "D": "Oprogramowanie do zarządzania projektami jest w pełni wykorzystywane we wszystkich projektach.",
              "E": "Oprogramowanie do zarządzania projektami jest kluczowe dla rozwoju produktu i jest używane w pełnym zakresie."
            },
            "selected_answer": "B"
          }
        ]
      }
    ]
  },
  "OLIMP": {
    "questionnaire": "OLIMP",
    "questionnaire_title": "OLIMP Model Questionnaire",
    "sections": [
      {
        "section_name": "TECHNOLOGY AND INFRASTRUCTURE",
        "question_count": 10,
        "questions": [
          {
            "question_text": "Czy Twoja organizacja posiada skalowalną infrastrukturę IT wspierającą AI?",
            "answer_options": {
              "A": "Brak skalowalnej infrastruktury, brak uwzględnienia Al",
              "B": "Podstawowa infrastruktura, ale nie skalowalna",
              "C": "Infrastruktura istnieje, ale skalowalność jest ograniczona",
              "D": "Skalowalna infrastruktura, ograniczona integracja Al",
              "E": "W pełni skalowalna infrastruktura zoptymalizowana pod Al"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Czy technologia generatywnej Al jest zintegrowana z innymi systemami (np. ERP, CRM)?",
            "answer_options": {
              "A": "Brak integracji Al z innymi systemami",
              "B": "Podstawowa integracja w jednym procesie lub systemie",
              "C": "Częściowa integracja z kluczowymi systemami (np. ERP)",
              "D": "Integracja z większością systemów, z pewnymi lukami",
              "E": "W pełni zintegrowana generatywna Al we wszystkich głównych systemach"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Na ile zautomatyzowane jest wdrażanie modeli generatywnej AI?",
            "answer_options": {
              "A": "Brak automatyzacji, ręczne wdrażanie",
              "B": "Podstawowa automatyzacja małych modeli",
              "C": "Częściowa automatyzacja z pewną ingerencją człowieka",
              "D": "W dużej mierze zautomatyzowane, sporadyczna ingerencja",
              "E": "W pełni zautomatyzowane wdrażanie modeli generatywnej Al"
            },
            "selected_answer": "E"
          },
          {
            "question_text": "Czy organizacja korzysta z chmury do przechowywania i przetwarzania danych AI?",
            "answer_options": {
              "A": "Brak wykorzystania chmury dla Al, dane przechowywane lokalnie",
              "B": "Minimalne korzystanie z chmury do przechowywania danych",
              "C": "Częściowa adopcja chmury do przechowywania i przetwarzania danych",
              "D": "Większość danych Al przechowywana i przetwarzana w chmurze",
              "E": "Pełna adopcja chmury dla wszystkich działań związanych z Al"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Czy organizacja korzysta z narzędzi do zarządzania cyklem życia modeli AI?",
            "answer_options": {
              "A": "Brak narzędzi do zarządzania cyklem życia modeli Al",
              "B": "Podstawowe narzędzia, ale niedostatecznie wykorzystywane",
              "C": "Niektóre narzędzia wykorzystywane, brak standaryzacji",
              "D": "Standaryzowane narzędzia dla większości procesów Al",
              "E": "W pełni wdrożone i zoptymalizowane narzędzia do zarządzania cyklem życia modeli Al"
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Czy infrastruktura organizacji jest przygotowana do obsługi dużych zbiorów danych dla AI?",
            "answer_options": {
              "A": "Nie jest w stanie obsłużyć dużych zbiorów danych",
              "B": "Podstawowa infrastruktura z ograniczoną pojemnością",
              "C": "Infrastruktura obsługuje umiarkowanie duże zbiory danych",
              "D": "Infrastruktura obsługuje większość dużych zbiorów danych",
              "E": "Zoptymalizowana infrastruktura do obsługi ogromnych zbiorów danych"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Czy organizacja jest zdolna do przetwarzania danych w czasie rzeczywistym dla AI?",
            "answer_options": {
              "A": "Brak przetwarzania danych w czasie rzeczywistym",
              "B": "Podstawowe przetwarzanie wsadowe",
              "C": "Przetwarzanie danych w czasie rzeczywistym dla niektórych zadań",
              "D": "Przetwarzanie danych w czasie rzeczywistym, z niewielkimi opóźnieniami",
              "E": "W pełni zoptymalizowane przetwarzanie danych w czasie rzeczywistym dla wszystkich zadań Al"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Czy Twoja organizacja posiada moc obliczeniową niezbędną do wdrażania i utrzymania modeli Al?",
            "answer_options": {
              "A": "Brak mocy obliczeniowej dla wdrożenia i utrzymania modeli Al",
              "B": "Podstawowa moc obliczeniowa, wystarczająca dla małych modeli",
              "C": "Umiarkowana moc obliczeniowa, wystarczająca dla niektórych modeli",
              "D": "Wysoka moc obliczeniowa, wystarczająca dla większości aplikacji Al",
              "E": "Zaawansowana moc obliczeniowa zoptymalizowana pod potrzeby Al"
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Czy w codziennej pracy wykorzystywane są wewnętrzne lub zewnętrzne narzędzia Al (np. ChatGPT, MS Copilot)?",
            "answer_options": {
              "A": "Brak narzędzi Al w codziennych zadaniach",
              "B": "Podstawowe wykorzystanie narzędzi Al do wybranych zadań",
              "C": "Niektóre narzędzia Al wykorzystywane, ale nie powszechnie",
              "D": "Narzędzia Al wykorzystywane w większości działów do różnych zadań",
              "E": "W pełni zintegrowane narzędzia Al w codziennej pracy w całej organizacji"
            },
            "selected_answer": "E"
          },
          {
            "question_text": "Jak skalowalne są rozwiązania generatywnej Al w Twojej organizacji?",
            "answer_options": {
              "A": "Brak skalowalności rozwiązań Al",
              "B": "Ograniczona skalowalność",
              "C": "Umiarkowana skalowalność dla niektórych rozwiązań",
              "D": "Większość rozwiązań Al jest skalowalna",
              "E": "W pełni skalowalne rozwiązania Al wdrożone w całej organizacji"
            },
            "selected_answer": "B"
          }
        ]
      },
      {
        "section_name": "DATA",
        "question_count": 9,
        "questions": [
          {
            "question_text": "Czy Twoja organizacja buduje wysokiej jakości zbiory danych?",
            "answer_options": {
              "A": "Brak systematycznego budowania zbiorów danych",
              "B": "Sporadyczne działania w kierunku poprawy jakości danych",
              "C": "Budowanie zbiorów danych z umiarkowaną jakością",
              "D": "Zbiory danych wysokiej jakości dla większości procesów",
              "E": "W pełni zoptymalizowane zbiory danych o najwyższej jakości"
            },
            "selected_answer": "D"
          },
          {
            "question_text": "Na ile Twoja organizacja automatyzuje analizę i przetwarzanie danych?",
            "answer_options": {
              "A": "Brak automatyzacji analiz i przetwarzania danych",
              "B": "Podstawowa automatyzacja w kilku obszarach",
              "C": "Częściowa automatyzacja dla niektórych procesów",
              "D": "Wysoka automatyzacja analiz i przetwarzania danych",
              "E": "W pełni zautomatyzowane procesy analizy i przetwarzania danych"
            },
            "selected_answer": "E"
          },
          {
            "question_text": "Czy Twoja organizacja centralizuje zbiory danych (np. jeden słownik danych)?",
            "answer_options": {
              "A": "Brak centralizacji zbiorów danych",
              "B": "Centralizacja w kilku wybranych obszarach",
              "C": "Częściowa centralizacja z danymi w różnych systemach",
              "D": "Większość danych zcentralizowana, kilka wyjątków",
              "E": "Pełna centralizacja danych, jeden słownik danych w całej organizacji"
            },
            "selected_answer": "E"
          },
          {
            "question_text": "Czy organizacja korzysta z zaawansowanych narzędzi do oceny jakości danych?",
            "answer_options": {
              "A": "Brak narzędzi do oceny jakości danych",
              "B": "Podstawowe narzędzia, ale rzadko używane",
              "C": "Częściowe wykorzystanie narzędzi do oceny jakości",
              "D": "Narzędzia do oceny jakości danych wykorzystywane w większości przypadków",
              "E": "W pełni zoptymalizowane narzędzia do oceny jakości danych"
            },
            "selected_answer": "E"
          },
          {
            "question_text": "Czy Twoja organizacja ma strategię zarządzania danymi?",
            "answer_options": {
              "A": "Brak strategii zarządzania danymi",
              "B": "Podstawowa strategia, ale niekompletnie wdrożona",
              "C": "Strategia zarządzania danymi stosowana w wybranych obszarach",
              "D": "Strategia zarządzania danymi wdrożona w większości procesów",
              "E": "W pełni wdrożona i zoptymalizowana strategia zarządzania danymi"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Na ile Twoja organizacja automatyzuje proces zbierania i czyszczenia danych?",
            "answer_options": {
              "A": "Brak automatyzacji, dane zbierane i czyszczone ręcznie",
              "B": "Podstawowa automatyzacja niektórych etapów procesu",
              "C": "Częściowa automatyzacja zbierania i czyszczenia danych",
              "D": "Automatyzacja dla większości procesów zbierania i czyszczenia danych",
              "E": "Pełna automatyzacja procesów zbierania i czyszczenia danych"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Czy organizacja identyfikuje i integruje dane z wewnętrznych i zewnętrznych źródeł?",
            "answer_options": {
              "A": "Brak identyfikacji i integracji danych z różnych źródeł",
              "B": "Dane zidentyfikowane, ale nie w pełni zintegrowane",
              "C": "Częściowa integracja danych z wybranych źródeł",
              "D": "Większość danych zidentyfikowana i zintegrowana",
              "E": "W pełni zintegrowane dane z wewnętrznych i zewnętrznych źródeł"
            },
            "selected_answer": "D"
          },
          {
            "question_text": "Czy organizacja posiada jeden standardowy model danych i zestaw metadanych?",
            "answer_options": {
              "A": "Brak standardowego modelu danych",
              "B": "Podstawowy model danych wdrożony w niektórych obszarach",
              "C": "Częściowe wdrożenie modelu danych i metadanych",
              "D": "Większość procesów oparta na jednym modelu danych",
              "E": "W pełni wdrożony jeden standardowy model danych i zbiór metadanych"
            },
            "selected_answer": "D"
          },
          {
            "question_text": "Czy Twoja organizacja korzysta z generatywnej Al do wspomagania wizualizacji danych?",
            "answer_options": {
              "A": "Brak użycia generatywnej Al do wizualizacji danych",
              "B": "Podstawowe wykorzystanie Al do prostych wizualizacji",
              "C": "Częściowe wykorzystanie generatywnej Al w wybranych obszarach",
              "D": "generatywna Al wykorzystywana do większości wizualizacji danych",
              "E": "W pełni zintegrowane narzędzia Al do wspomagania wizualizacji danych"
            },
            "selected_answer": "C"
          }
        ]
      },
      {
        "section_name": "PEOPLE AND COMPETENCIES",
        "question_count": 6,
        "questions": [
          {
            "question_text": "Czy Twoja organizacja rozwija świadomość i zrozumienie rozwiązań generatywnej AI?",
            "answer_options": {
              "A": "Brak świadomości rozwiązań generatywnej Al",
              "B": "Podstawowa świadomość wśród wybranych zespołów",
              "C": "Częściowe zrozumienie i świadomość w wybranych obszarach",
              "D": "Świadomość i zrozumienie w większości działów",
              "E": "Pełne zrozumienie i świadomość generatywnej Al w całej organizacji"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Czy organizacja szkoli zespoły w zakresie programowania (także promptingu) i analizy danych?",
            "answer_options": {
              "A": "Brak szkoleń z programowania i analizy danych",
              "B": "Podstawowe szkolenia w wybranych zespołach",
              "C": "Częściowe szkolenia, ale ograniczone do kilku zespołów",
              "D": "Regularne szkolenia obejmujące większość zespołów",
              "E": "W pełni rozwinięty program szkoleń dla wszystkich zespołów w zakresie Al i analizy danych"
            },
            "selected_answer": "D"
          },
          {
            "question_text": "Czy Twoja organizacja tworzy interdyscyplinarne zespoły ds. AI?",
            "answer_options": {
              "A": "Brak interdyscyplinarnych zespołów ds. Al",
              "B": "Tworzenie zespołów w niektórych projektach",
              "C": "Częściowe tworzenie zespołów, ale nie w każdej inicjatywie",
              "D": "Większość projektów posiada interdyscyplinarne zespoły",
              "E": "W pełni zintegrowane interdyscyplinarne zespoły ds. Al we wszystkich projektach"
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Czy organizacja angażuje zewnętrznych konsultantów ds. generatywnej Al do zespołów?",
            "answer_options": {
              "A": "Brak angażowania zewnętrznych konsultantów",
              "B": "Sporadyczne zaangażowanie konsultantów do pojedynczych projektów",
              "C": "Konsultanci zewnętrzni angażowani przy wybranych projektach",
              "D": "Regularne angażowanie konsultantów do kluczowych inicjatyw",
              "E": "W pełni zintegrowane wsparcie konsultantów Al we wszystkich istotnych projektach"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Czy Twoja organizacja szkoli w zakresie zarządzania projektami opartymi o generatywną Al?",
            "answer_options": {
              "A": "Brak szkoleń z zarządzania projektami opartymi o generatywną Al",
              "B": "Podstawowe szkolenia dla wybranych osób",
              "C": "Częściowe szkolenia z zarządzania projektami dla wybranych zespołów",
              "D": "Regularne szkolenia w zakresie projektów opartych o generatywną Al",
              "E": "Pełny program szkoleń z zarządzania projektami generatywnymi Al dla wszystkich odpowiednich zespołów"
            },
            "selected_answer": "E"
          },
          {
            "question_text": "Czy istnieje zarządzanie wiedzą w dziedzinie generatywnej Al, aby ułatwić transfer wiedzy między wszystkimi pracownikami?",
            "answer_options": {
              "A": "Pracownicy utrzymują własne bazy wiedzy i nie dzielą się nimi z innymi.",
              "B": "Istnieją różne platformy, ale nie są one dobrze zorganizowane, co utrudnia pracownikom dostęp do istniejącej wiedzy.",
              "C": "Centralna platforma jest w trakcie budowy i jest używana przez poszczególnych pracowników do zarządzania wiedzą.",
              "D": "Scentralizowana platforma jest dostępna dla wszystkich pracowników, ale nie wszyscy z niej korzystają.",
              "E": "Scentralizowana platforma do gromadzenia wiedzy jest używana przez wszystkich pracowników i jest stale rozbudowywana."
            },
            "selected_answer": "C"
          }
        ]
      },
      {
        "section_name": "ORGANIZATION AND PROCESSES",
        "question_count": 7,
        "questions": [
          {
            "question_text": "Czy Twoja organizacja integruje Al z istniejącymi procesami rozwoju nowego produktu?",
            "answer_options": {
              "A": "Brak integracji Al w procesach rozwoju nowego produktu",
              "B": "Podstawowa integracja w procesach rozwoju wybranych produktów",
              "C": "Częściowa integracja w procesach rozwoju kilku produktów",
              "D": "Integracja Al w procesów rozwoju większości produktów",
              "E": "Pełna integracja Al w procesach rozwoju wszystkich produktów"
            },
            "selected_answer": "D"
          },
          {
            "question_text": "Na ile Twoja organizacja automatyzuje procesy rozwoju produktu z wykorzystaniem generatywnej AI?",
            "answer_options": {
              "A": "Brak automatyzacji procesów rozwoju produktu z Al",
              "B": "Podstawowa automatyzacja wybranych etapów rozwoju produktu",
              "C": "Częściowa automatyzacja procesów rozwoju produktu",
              "D": "Automatyzacja większości procesów rozwoju produktu",
              "E": "W pełni zautomatyzowane procesy rozwoju produktu z wykorzystaniem Al"
            },
            "selected_answer": "E"
          },
          {
            "question_text": "Czy organizacja wykorzystuje Al do wsparcia podejmowania decyzji?",
            "answer_options": {
              "A": "Brak wykorzystania Al do wsparcia podejmowania decyzji",
              "B": "Sporadyczne wykorzystanie Al w wybranych decyzjach",
              "C": "Al wspiera podejmowanie decyzji w ograniczonym zakresie",
              "D": "Al wspiera większość decyzji w kluczowych obszarach",
              "E": "Al zintegrowana we wszystkich procesach decyzyjnych organizacji"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Czy organizacja wdraża narzędzia wspierające pracę zespołów AI?",
            "answer_options": {
              "A": "Brak narzędzi wspierających pracę zespołów Al",
              "B": "Podstawowe narzędzia, ale nie są powszechnie używane",
              "C": "Częściowe wdrożenie narzędzi wspierających pracę zespołów Al",
              "D": "Narzędzia Al wspierają pracę większości zespołów",
              "E": "W pełni wdrożone narzędzia Al wspierające codzienną pracę zespołów"
            },
            "selected_answer": "D"
          },
          {
            "question_text": "Czy organizacja wprowadza cykle ciągłego doskonalenia we wdrażaniu rozwiązań generatywnej Al?",
            "answer_options": {
              "A": "Brak cykli ciągłego doskonalenia",
              "B": "Sporadyczne działania w kierunku doskonalenia procesów",
              "C": "Cykle doskonalenia w wybranych procesach Al",
              "D": "Doskonalenie wdrożeń Al w większości projektów",
              "E": "W pełni wdrożone cykle ciągłego doskonalenia dla wszystkich wdrożeń Al"
            },
            "selected_answer": "D"
          },
          {
            "question_text": "Czy organizacja zdefiniowała proces zarządzania cyklem życia dla oprogramowania AI?",
            "answer_options": {
              "A": "Brak zdefiniowanego procesu zarządzania cyklem życia oprogramowania",
              "B": "Proces częściowo zdefiniowany, ale niespójnie realizowany",
              "C": "Zdefiniowany proces zarządzania cyklem życia w kilku projektach",
              "D": "Zdefiniowany proces zarządzania cyklem życia w większości projektów",
              "E": "Pełny proces zarządzania cyklem życia dla oprogramowania Al wdrożony we wszystkich projektach"
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Czy organizacja posiada przewodnik po procesie rozwoju produktu opartym o generatywną AI?",
            "answer_options": {
              "A": "Brak przewodnika Al po procesie rozwoju produktu",
              "B": "Podstawowy przewodnik opracowany, ale rzadko używany",
              "C": "Przewodnik częściowo wdrożony w kilku projektach",
              "D": "Przewodnik po procesie rozwoju produktu stosowany w większości projektów",
              "E": "W pełni wdrożony przewodnik Al po procesie rozwoju produktu w całej organizacji"
            },
            "selected_answer": "E"
          }
        ]
      },
      {
        "section_name": "STRATEGY AND MANAGEMENT",
        "question_count": 6,
        "questions": [
          {
            "question_text": "Czy Twoja organizacja opracowała długoterminową strategię inwestycji w generatywną AI?",
            "answer_options": {
              "A": "Brak strategii inwestycji w generatywną Al",
              "B": "Podstawowa strategia, ale ograniczona do krótkiego okresu",
              "C": "Strategia istnieje, ale nie jest w pełni wdrożona",
              "D": "Strategia długoterminowa jest wdrożona w większości obszarów",
              "E": "W pełni wdrożona, długoterminowa strategia inwestycji w generatywną Al"
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Czy strategia Al jest wdrożona w rozwój produktów?",
            "answer_options": {
              "A": "Brak wdrożenia strategii Al w rozwój produktów",
              "B": "Wdrożenie tylko w pojedynczych produktach",
              "C": "Częściowe wdrożenie strategii Al w rozwój produktów",
              "D": "Strategia Al wdrożona w większości produktów",
              "E": "Pełne wdrożenie strategii Al we wszystkich produktach organizacji"
            },
            "selected_answer": "D"
          },
          {
            "question_text": "Czy Twoja organizacja określiła cele strategiczne dla generatywnej Al?",
            "answer_options": {
              "A": "Brak celów strategicznych dla generatywnej Al",
              "B": "Podstawowe cele, ale bez precyzyjnej realizacji",
              "C": "Cele zdefiniowane, ale nie w pełni realizowane",
              "D": "Cele strategiczne dla Al realizowane w większości obszarów",
              "E": "W pełni wdrożone i realizowane cele strategiczne dla generatywnej Al"
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Czy organizacja ocenia wpływ biznesowy i wykonalność rozwiązań generatywnej Al z wyprzedzeniem?",
            "answer_options": {
              "A": "Brak oceny wpływu biznesowego i wykonalności rozwiązań Al",
              "B": "Ocena przeprowadzana jedynie w wybranych przypadkach",
              "C": "Częściowa ocena wpływu biznesowego i wykonalności",
              "D": "Regularna ocena dla większości projektów",
              "E": "W pełni systematyczna ocena wpływu biznesowego i wykonalności dla wszystkich rozwiązań Al"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Czy Twoja organizacja opracowała system monitorowania wyników wdrożenia AI?",
            "answer_options": {
              "A": "Brak systemu monitorowania wyników wdrożenia Al",
              "B": "Podstawowy system monitorowania, ale niedostatecznie wdrożony",
              "C": "Częściowy system monitorowania wyników w wybranych projektach",
              "D": "System monitorowania wyników wdrożenia Al działa w większości obszarów",
              "E": "W pełni wdrożony, zaawansowany system monitorowania wyników Al"
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Czy organizacja analizuje konkurencję pod względem ich zdolności do wdrożeń generatywnej AI?",
            "answer_options": {
              "A": "Brak analiz konkurencji dotyczących Al",
              "B": "Sporadyczne analizy konkurencji dotyczące Al",
              "C": "Częściowe analizy, ale nie regularne",
              "D": "Regularne analizy konkurencji pod kątem wdrożeń Al",
              "E": "W pełni zintegrowane analizy konkurencji dotyczące generatywnej Al we wszystkich strategicznych obszarach"
            },
            "selected_answer": "B"
          }
        ]
      },
      {
        "section_name": "BUDGET",
        "question_count": 5,
        "questions": [
          {
            "question_text": "Czy Twoja organizacja prowadzi długoterminowe planowanie budżetu na rozwój rozwiązań i infrastruktury wspierającej generatywną AI?",
            "answer_options": {
              "A": "Brak planowania budżetu na rozwój rozwiązań generatywnej Al",
              "B": "Krótkoterminowe planowanie budżetowe w wybranych projektach",
              "C": "Częściowe planowanie długoterminowe, ograniczone do niektórych projektów",
              "D": "Długoterminowe planowanie budżetowe w większości projektów",
              "E": "Pełne długoterminowe planowanie budżetu na wszystkie projekty i infrastrukturę Al"
            },
            "selected_answer": "E"
          },
          {
            "question_text": "Czy Twoja organizacja przeznacza środki na rozwój kompetencji pracowników w zakresie generatywnej AI?",
            "answer_options": {
              "A": "Brak środków na rozwój kompetencji pracowników w zakresie Al",
              "B": "Sporadyczne finansowanie szkoleń dla wybranych pracowników",
              "C": "Częściowe przeznaczanie środków na rozwój kompetencji",
              "D": "Stałe finansowanie rozwoju kompetencji większości pracowników",
              "E": "Pełne finansowanie rozwoju kompetencji w zakresie Al dla wszystkich pracowników"
            },
            "selected_answer": "E"
          },
          {
            "question_text": "Czy Twoja organizacja finansuje projekty pilotażowe i innowacyjne związane z generatywną AI?",
            "answer_options": {
              "A": "Brak finansowania projektów pilotażowych związanych z Al",
              "B": "Ograniczone finansowanie pojedynczych projektów",
              "C": "Częściowe finansowanie projektów pilotażowych i innowacyjnych",
              "D": "Regularne finansowanie większości projektów pilotażowych",
              "E": "Pełne wsparcie finansowe dla wszystkich projektów pilotażowych i innowacyjnych związanych z Al"
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Czy organizacja alokuje środki na zewnętrzne konsultacje dotyczące generatywnej AI?",
            "answer_options": {
              "A": "Brak alokacji środków na zewnętrzne konsultacje dotyczące Al",
              "B": "Sporadyczne alokowanie środków na konsultacje w wybranych projektach",
              "C": "Częściowa alokacja środków na zewnętrzne konsultacje",
              "D": "Regularna alokacja środków na konsultacje w większości projektów",
              "E": "Pełna alokacja środków na zewnętrzne konsultacje we wszystkich strategicznych projektach"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Czy organizacja priorytetyzuje projekty generujące wysoką wartość dodaną dzięki generatywnej AI?",
            "answer_options": {
              "A": "Brak priorytetyzacji projektów związanych z Al",
              "B": "Priorytetyzacja jedynie wybranych projektów",
              "C": "Częściowa priorytetyzacja projektów generujących wartość dodaną",
              "D": "Regularna priorytetyzacja większości projektów związanych z Al",
              "E": "Pełna priorytetyzacja projektów Al o najwyższej wartości dodanej"
            },
            "selected_answer": "A"
          }
        ]
      },
      {
        "section_name": "PRODUCTS AND SERVICES",
        "question_count": 11,
        "questions": [
          {
            "question_text": "Czy Twoja organizacja wykorzystuje generatywną Al do wspomagania lub automatyzacji procesów projektowania i wytwarzania produktów?",
            "answer_options": {
              "A": "Brak wykorzystania Al w procesach projektowania i wytwarzania produktów",
              "B": "Minimalne wykorzystanie Al w wybranych procesach",
              "C": "Częściowe wykorzystanie Al do automatyzacji procesów",
              "D": "Al wspiera większość procesów projektowania i wytwarzania",
              "E": "Pełne wykorzystanie Al w automatyzacji procesów"
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Czy Twoja organizacja korzysta z generatywnej Al do personalizacji produktów?",
            "answer_options": {
              "A": "Brak wykorzystania Al do personalizacji produktów",
              "B": "Sporadyczne wykorzystanie Al do podstawowej personalizacji",
              "C": "Al stosowana do personalizacji w wybranych produktach",
              "D": "Personalizacja większości produktów z wykorzystaniem Al",
              "E": "Pełna personalizacja produktów przy wsparciu Al"
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Czy organizacja korzysta z generatywnej Al do generowania pomysłów związanych z produktami (np. analiza sentymentu, analiza opinii)?",
            "answer_options": {
              "A": "Brak generowania pomysłów z wykorzystaniem Al",
              "B": "Sporadyczne generowanie pomysłów w wybranych projektach",
              "C": "Częściowe generowanie pomysłów z wykorzystaniem Al",
              "D": "Generowanie pomysłów w większości procesów rozwoju produktów",
              "E": "Pełne wykorzystanie Al do generowania pomysłów i analiz opinii dla produktów"
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Czy Twoja organizacja wykorzystuje generatywną Al do wspomagania redukcji informacji (np. streszczenia tekstów)?",
            "answer_options": {
              "A": "Brak wykorzystania Al do redukcji informacji",
              "B": "Sporadyczne wykorzystanie Al w wybranych przypadkach",
              "C": "Częściowe wykorzystanie Al do redukcji informacji",
              "D": "Al stosowana regularnie do redukcji informacji w większości projektów",
              "E": "Pełne wykorzystanie Al do redukcji informacji we wszystkich obszarach"
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Czy organizacja wspomaga ocenę koncepcji produktów przy użyciu generatywnej AI?",
            "answer_options": {
              "A": "Brak wspomagania oceny koncepcji przy użyciu Al",
              "B": "Sporadyczne wsparcie oceny koncepcji w wybranych projektach",
              "C": "Częściowe wykorzystanie Al do oceny koncepcji",
              "D": "Al wspiera ocenę koncepcji w większości projektów",
              "E": "Pełne wsparcie oceny koncepcji produktów z wykorzystaniem Al"
            },
            "selected_answer": "D"
          },
          {
            "question_text": "Czy Twoja organizacja wykorzystuje generatywną Al do skrócenia czasu testowania produktów?",
            "answer_options": {
              "A": "Brak wykorzystania Al do skracania czasu testowania",
              "B": "Al sporadycznie wykorzystywana w wybranych testach",
              "C": "Częściowe wykorzystanie Al do skracania czasu testów",
              "D": "Al stosowana regularnie do skracania czasu testowania produktów",
              "E": "Pełne wykorzystanie Al do maksymalnego skrócenia czasu testowania produktów"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Czy organizacja wspiera marketing produktowy z wykorzystaniem generatywnej Al (np. tworzenie reklam, słów kluczowych, filmów promocyjnych)?",
            "answer_options": {
              "A": "Brak wykorzystania Al do marketingu produktowego",
              "B": "Sporadyczne wykorzystanie Al w pojedynczych kampaniach",
              "C": "Częściowe wykorzystanie Al w wybranych aspektach marketingu",
              "D": "Al wspiera marketing większości produktów",
              "E": "Pełne wykorzystanie Al do wspomagania marketingu produktowego (tworzenie reklam, kampanii, analiz)"
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Czy Twoja organizacja wykorzystuje generatywną Al do doskonalenia systemów rekomendacji produktów?",
            "answer_options": {
              "A": "Brak wykorzystania Al w systemach rekomendacji produktów",
              "B": "Podstawowe wykorzystanie Al do rekomendacji w wybranych obszarach",
              "C": "Częściowe wykorzystanie Al do rekomendacji produktów",
              "D": "Al regularnie wspiera systemy rekomendacji w większości procesów",
              "E": "Pełne wykorzystanie Al do optymalizacji systemów rekomendacji produktów"
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Czy organizacja doskonali działanie baz danych produktów z wykorzystaniem generatywnej AI?",
            "answer_options": {
              "A": "Brak doskonalenia baz danych produktów przy użyciu Al",
              "B": "Podstawowe wykorzystanie Al w wybranych obszarach",
              "C": "Częściowe doskonalenie baz danych produktów z wykorzystaniem Al",
              "D": "Al wspiera doskonalenie baz danych produktów w większości obszarów",
              "E": "Pełne wykorzystanie Al do doskonalenia baz danych produktów"
            },
            "selected_answer": "E"
          },
          {
            "question_text": "Czy Twoja organizacja wykorzystuje generatywną Al jako komponent profesjonalnych aplikacji?",
            "answer_options": {
              "A": "Brak wykorzystania Al jako komponentu aplikacji",
              "B": "Al wykorzystywana jedynie w podstawowych aplikacjach",
              "C": "Częściowe wykorzystanie Al w wybranych profesjonalnych aplikacjach",
              "D": "Al wspiera działanie większości profesjonalnych aplikacji",
              "E": "Pełne wykorzystanie Al jako kluczowego komponentu profesjonalnych aplikacji"
            },
            "selected_answer": "E"
          },
          {
            "question_text": "Czy organizacja poszukuje nowych przypadków użycia rozwiązań generatywnej AI?",
            "answer_options": {
              "A": "Brak poszukiwań nowych przypadków użycia Al",
              "B": "Sporadyczne poszukiwania nowych przypadków użycia",
              "C": "Częściowe poszukiwanie nowych przypadków użycia Al",
              "D": "Regularne poszukiwanie nowych przypadków użycia Al",
              "E": "Pełne zaangażowanie w poszukiwanie nowych przypadków użycia generatywnej Al we wszystkich obszarach"
            },
            "selected_answer": "C"
          }
        ]
      },
      {
        "section_name": "ETHICS AND REGULATIONS",
        "question_count": 10,
        "questions": [
          {
            "question_text": "Czy Twoja organizacja przestrzega zasad etyki w projektowaniu generatywnej AI?",
            "answer_options": {
              "A": "Brak uwzględnienia zasad etyki w projektowaniu Al",
              "B": "Sporadyczne uwzględnienie etyki w wybranych projektach",
              "C": "Częściowe uwzględnienie zasad etyki w niektórych projektach",
              "D": "Większość projektów uwzględnia zasady etyki",
              "E": "W pełni uwzględnione zasady etyki we wszystkich projektach Al"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Czy Twoja organizacja zapewnia bezpieczeństwo i prywatność danych związanych z rozwojem produktów?",
            "answer_options": {
              "A": "Brak systemu zapewniającego bezpieczeństwo i prywatność danych",
              "B": "Podstawowe środki bezpieczeństwa wdrożone w wybranych projektach",
              "C": "Częściowe wdrożenie polityki bezpieczeństwa i prywatności danych",
              "D": "Większość projektów przestrzega polityk bezpieczeństwa i prywatności danych",
              "E": "W pełni wdrożone systemy bezpieczeństwa i prywatności danych dla wszystkich projektów"
            },
            "selected_answer": "B"
          },
          {
            "question_text": "Czy Twoja organizacja dba o zaufanie do danych i możliwość ich wyjaśnienia?",
            "answer_options": {
              "A": "Brak mechanizmów budowania zaufania do danych",
              "B": "Minimalne działania w zakresie zaufania i możliwości wyjaśnienia danych",
              "C": "Częściowe wdrożenie mechanizmów budujących zaufanie i możliwości wyjaśnienia",
              "D": "Większość danych posiada mechanizmy możliwości wyjaśnienia",
              "E": "Pełne zaufanie do danych i mechanizmy możliwości wyjaśnienia wdrożone we wszystkich procesach"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Czy organizacja wdraża standardy ochrony i mechanizmy dotyczące kopii zapasowych danych?",
            "answer_options": {
              "A": "Brak standardów ochrony i mechanizmów kopii zapasowych",
              "B": "Podstawowe mechanizmy wprowadzane w wybranych obszarach",
              "C": "Częściowe wdrożenie mechanizmów ochrony i kopii zapasowych",
              "D": "Większość obszarów objęta standardami ochrony i kopiami zapasowymi danych",
              "E": "W pełni wdrożone standardy ochrony i mechanizmy kopii zapasowych we wszystkich obszarach"
            },
            "selected_answer": "C"
          },
          {
            "question_text": "Czy Twoja organizacja przeciwdziała uprzedzeniom i niesprawiedliwości w algorytmach generatywnej Al?",
            "answer_options": {
              "A": "Brak działań w zakresie przeciwdziałania uprzedzeniom",
              "B": "Podstawowe działania w zakresie eliminacji uprzedzeń",
              "C": "Częściowe wdrożenie działań przeciwdziałających uprzedzeniom w algorytmach",
              "D": "Większość algorytmów jest weryfikowana pod kątem uprzedzeń",
              "E": "Pełna eliminacja uprzedzeń i niesprawiedliwości w algorytmach Al"
            },
            "selected_answer": "E"
          },
          {
            "question_text": "Czy organizacja regularnie ocenia zgodność algorytmów generatywnej Al z regulacjami prawnymi?",
            "answer_options": {
              "A": "Brak oceny zgodności algorytmów z regulacjami",
              "B": "Sporadyczne oceny zgodności z przepisami w wybranych projektach",
              "C": "Częściowe wdrożenie procedur oceny zgodności algorytmów",
              "D": "Większość algorytmów jest regularnie weryfikowana pod kątem zgodności z regulacjami",
              "E": "W pełni wdrożone procedury regularnej oceny zgodności algorytmów Al z przepisami"
            },
            "selected_answer": "D"
          },
          {
            "question_text": "Czy Twoja organizacja tworzy systemy audytu decyzji podejmowanych przez generatywną AI?",
            "answer_options": {
              "A": "Brak systemów audytu decyzji podejmowanych przez Al",
              "B": "Podstawowe systemy audytu wprowadzane w wybranych projektach",
              "C": "Częściowe wdrożenie systemów audytu decyzji Al",
              "D": "Systemy audytu funkcjonują dla większości decyzji Al",
              "E": "W pełni wdrożone systemy audytu i odpowiedzialności za decyzje podejmowane przez Al"
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Czy Twoja organizacja poszerza świadomość dotyczącą ochrony danych wśród pracowników?",
            "answer_options": {
              "A": "Brak programów edukacyjnych dotyczących ochrony danych",
              "B": "Podstawowe programy szkoleniowe, ale ograniczone do wybranych zespołów",
              "C": "Częściowe programy szkoleniowe dla wybranych zespołów",
              "D": "Regularne szkolenia w zakresie ochrony danych w większości zespołów",
              "E": "Pełne programy edukacyjne dotyczące ochrony danych dla wszystkich pracowników"
            },
            "selected_answer": "D"
          },
          {
            "question_text": "Czy organizacja wykorzystuje technologie dotyczące cyberbezpieczeństwa?",
            "answer_options": {
              "A": "Brak wykorzystania technologii cyberbezpieczeństwa",
              "B": "Podstawowe technologie wdrożone w wybranych obszarach",
              "C": "Częściowe wdrożenie technologii cyberbezpieczeństwa",
              "D": "Większość obszarów objęta technologiami cyberbezpieczeństwa",
              "E": "W pełni wdrożone technologie cyberbezpieczeństwa we wszystkich obszarach organizacji"
            },
            "selected_answer": "A"
          },
          {
            "question_text": "Czy Twoja organizacja utrzymuje dokumentację dotyczącą użycia generatywnej Al (np. przypadki użycia, logi systemowe, kontrola wersji)?",
            "answer_options": {
              "A": "Brak dokumentacji dotyczącej użycia Al",
              "B": "Sporadyczne dokumentowanie wybranych przypadków użycia",
              "C": "Częściowa dokumentacja dla wybranych obszarów",
              "D": "Dokumentacja prowadzona regularnie w większości przypadków",
              "E": "Pełna i bieżąca dokumentacja dotycząca wszystkich przypadków użycia Al"
            },
            "selected_answer": "D"
          }
        ]
      }
    ]
  }
}