{
  "BUDGET": {
    "Czy Twoja organizacja prowadzi długoterminowe planowanie budżetu na rozwój rozwiązań i infrastruktury wspierającej generatywną AI?": {
      "present": {
        "level": "E",
        "description": "Pełne długoterminowe planowanie budżetu na wszystkie projekty i infrastrukturę Al"
      },
      "steps": []
    },
    "Czy Twoja organizacja przeznacza środki na rozwój kompetencji pracowników w zakresie generatywnej AI?": {
      "present": {
        "level": "E",
        "description": "Pełne finansowanie rozwoju kompetencji w zakresie Al dla wszystkich pracowników"
      },
      "steps": []
    },
    "Czy Twoja organizacja finansuje projekty pilotażowe i innowacyjne związane z generatywną AI?": {
      "present": {
        "level": "C",
        "description": "Częściowe finansowanie projektów pilotażowych i innowacyjnych"
      },
      "steps": [
        {
          "level": "D",
          "description": "Regularne finansowanie większości projektów pilotażowych"
        },
        {
          "level": "E",
          "description": "Pełne wsparcie finansowe dla wszystkich projektów pilotażowych i innowacyjnych związanych z Al"
        }
      ]
    },
    "Czy organizacja alokuje środki na zewnętrzne konsultacje dotyczące generatywnej AI?": {
      "present": {
        "level": "E",
        "description": "Pełna alokacja środków na zewnętrzne konsultacje we wszystkich strategicznych projektach"
      },
      "steps": []
    },
    "Czy organizacja priorytetyzuje projekty generujące wysoką wartość dodaną dzięki generatywnej AI?": {
      "present": {
        "level": "E",
        "description": "Pełna priorytetyzacja projektów Al o najwyższej wartości dodanej"
      },
      "steps": []
    }
  },
  "PRODUCTS AND SERVICES": {
    "Czy Twoja organizacja wykorzystuje generatywną Al do wspomagania lub automatyzacji procesów projektowania i wytwarzania produktów?": {
      "present": {
        "level": "E",
        "description": "Pełne wykorzystanie Al w automatyzacji procesów"
      },
      "steps": []
    },
    "Czy Twoja organizacja korzysta z generatywnej Al do personalizacji produktów?": {
      "present": {
        "level": "D",
        "description": "Personalizacja większości produktów z wykorzystaniem Al"
      },
      "steps": [
        {
          "level": "E",
          "description": "Pełna personalizacja produktów przy wsparciu Al"
        }
      ]
    },
    "Czy organizacja korzysta z generatywnej Al do generowania pomysłów związanych z produktami (np. analiza sentymentu, analiza opinii)?": {
      "present": {
        "level": "B",
        "description": "Sporadyczne generowanie pomysłów w wybranych projektach"
      },
      "steps": [
        {
          "level": "C",
          "description": "Częściowe generowanie pomysłów z wykorzystaniem Al"
        },
        {
          "level": "D",
          "description": "Generowanie pomysłów w większości procesów rozwoju produktów"
        },
        {
          "level": "E",
          "description": "Pełne wykorzystanie Al do generowania pomysłów i analiz opinii dla produktów"
        }
      ]
    },
    "Czy Twoja organizacja wykorzystuje generatywną Al do wspomagania redukcji informacji (np. streszczenia tekstów)?": {
      "present": {
        "level": "B",
        "description": "Sporadyczne wykorzystanie Al w wybranych przypadkach"
      },
      "steps": [
        {
          "level": "C",
          "description": "Częściowe wykorzystanie Al do redukcji informacji"
        },
        {
          "level": "D",
          "description": "Al stosowana regularnie do redukcji informacji w większości projektów"
        },
        {
          "level": "E",
          "description": "Pełne wykorzystanie Al do redukcji informacji we wszystkich obszarach"
        }
      ]
    },
    "Czy organizacja wspomaga ocenę koncepcji produktów przy użyciu generatywnej AI?": {
      "present": {
        "level": "D",
        "description": "Al wspiera ocenę koncepcji w większości projektów"
      },
      "steps": [
        {
          "level": "E",
          "description": "Pełne wsparcie oceny koncepcji produktów z wykorzystaniem Al"
        }
      ]
    },
    "Czy Twoja organizacja wykorzystuje generatywną Al do skrócenia czasu testowania produktów?": {
      "present": {
        "level": "D",
        "description": "Al stosowana regularnie do skracania czasu testowania produktów"
      },
      "steps": [
        {
          "level": "E",
          "description": "Pełne wykorzystanie Al do maksymalnego skrócenia czasu testowania produktów"
        }
      ]
    },
    "Czy organizacja wspiera marketing produktowy z wykorzystaniem generatywnej Al (np. tworzenie reklam, słów kluczowych, filmów promocyjnych)?": {
      "present": {
        "level": "D",
        "description": "Al wspiera marketing większości produktów"
      },
      "steps": [
        {
          "level": "E",
          "description": "Pełne wykorzystanie Al do wspomagania marketingu produktowego (tworzenie reklam, kampanii, analiz)"
        }
      ]
    },
    "Czy Twoja organizacja wykorzystuje generatywną Al do doskonalenia systemów rekomendacji produktów?": {
      "present": {
        "level": "B",
        "description": "Podstawowe wykorzystanie Al do rekomendacji w wybranych obszarach"
      },
      "steps": [
        {
          "level": "C",
          "description": "Częściowe wykorzystanie Al do rekomendacji produktów"
        },
        {
          "level": "D",
          "description": "Al regularnie wspiera systemy rekomendacji w większości procesów"
        },
        {
          "level": "E",
          "description": "Pełne wykorzystanie Al do optymalizacji systemów rekomendacji produktów"
        }
      ]
    },
    "Czy organizacja doskonali działanie baz danych produktów z wykorzystaniem generatywnej AI?": {
      "present": {
        "level": "A",
        "description": "Brak doskonalenia baz danych produktów przy użyciu Al"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowe wykorzystanie Al w wybranych obszarach"
        },
        {
          "level": "C",
          "description": "Częściowe doskonalenie baz danych produktów z wykorzystaniem Al"
        },
        {
          "level": "D",
          "description": "Al wspiera doskonalenie baz danych produktów w większości obszarów"
        },
        {
          "level": "E",
          "description": "Pełne wykorzystanie Al do doskonalenia baz danych produktów"
        }
      ]
    },
    "Czy Twoja organizacja wykorzystuje generatywną Al jako komponent profesjonalnych aplikacji?": {
      "present": {
        "level": "A",
        "description": "Brak wykorzystania Al jako komponentu aplikacji"
      },
      "steps": [
        {
          "level": "B",
          "description": "Al wykorzystywana jedynie w podstawowych aplikacjach"
        },
        {
          "level": "C",
          "description": "Częściowe wykorzystanie Al w wybranych profesjonalnych aplikacjach"
        },
        {
          "level": "D",
          "description": "Al wspiera działanie większości profesjonalnych aplikacji"
        },
        {
          "level": "E",
          "description": "Pełne wykorzystanie Al jako kluczowego komponentu profesjonalnych aplikacji"
        }
      ]
    },
    "Czy organizacja poszukuje nowych przypadków użycia rozwiązań generatywnej AI?": {
      "present": {
        "level": "A",
        "description": "Brak poszukiwań nowych przypadków użycia Al"
      },
      "steps": [
        {
          "level": "B",
          "description": "Sporadyczne poszukiwania nowych przypadków użycia"
        },
        {
          "level": "C",
          "description": "Częściowe poszukiwanie nowych przypadków użycia Al"
        },
        {
          "level": "D",
          "description": "Regularne poszukiwanie nowych przypadków użycia Al"
        },
        {
          "level": "E",
          "description": "Pełne zaangażowanie w poszukiwanie nowych przypadków użycia generatywnej Al we wszystkich obszarach"
        }
      ]
    }
  },
  "ETHICS AND REGULATIONS": {
    "Czy Twoja organizacja przestrzega zasad etyki w projektowaniu generatywnej AI?": {
      "present": {
        "level": "A",
        "description": "Brak uwzględnienia zasad etyki w projektowaniu Al"
      },
      "steps": [
        {
          "level": "B",
          "description": "Sporadyczne uwzględnienie etyki w wybranych projektach"
        },
        {
          "level": "C",
          "description": "Częściowe uwzględnienie zasad etyki w niektórych projektach"
        },
        {
          "level": "D",
          "description": "Większość projektów uwzględnia zasady etyki"
        },
        {
          "level": "E",
          "description": "W pełni uwzględnione zasady etyki we wszystkich projektach Al"
        }
      ]
    },
    "Czy Twoja organizacja zapewnia bezpieczeństwo i prywatność danych związanych z rozwojem produktów?": {
      "present": {
        "level": "B",
        "description": "Podstawowe środki bezpieczeństwa wdrożone w wybranych projektach"
      },
      "steps": [
        {
          "level": "C",
          "description": "Częściowe wdrożenie polityki bezpieczeństwa i prywatności danych"
        },
        {
          "level": "D",
          "description": "Większość projektów przestrzega polityk bezpieczeństwa i prywatności danych"
        },
        {
          "level": "E",
          "description": "W pełni wdrożone systemy bezpieczeństwa i prywatności danych dla wszystkich projektów"
        }
      ]
    },
    "Czy Twoja organizacja dba o zaufanie do danych i możliwość ich wyjaśnienia?": {
      "present": {
        "level": "C",
        "description": "Częściowe wdrożenie mechanizmów budujących zaufanie i możliwości wyjaśnienia"
      },
      "steps": [
        {
          "level": "D",
          "description": "Większość danych posiada mechanizmy możliwości wyjaśnienia"
        },
        {
          "level": "E",
          "description": "Pełne zaufanie do danych i mechanizmy możliwości wyjaśnienia wdrożone we wszystkich procesach"
        }
      ]
    },
    "Czy organizacja wdraża standardy ochrony i mechanizmy dotyczące kopii zapasowych danych?": {
      "present": {
        "level": "D",
        "description": "Większość obszarów objęta standardami ochrony i kopiami zapasowymi danych"
      },
      "steps": [
        {
          "level": "E",
          "description": "W pełni wdrożone standardy ochrony i mechanizmy kopii zapasowych we wszystkich obszarach"
        }
      ]
    },
    "Czy Twoja organizacja przeciwdziała uprzedzeniom i niesprawiedliwości w algorytmach generatywnej Al?": {
      "present": {
        "level": "E",
        "description": "Pełna eliminacja uprzedzeń i niesprawiedliwości w algorytmach Al"
      },
      "steps": []
    },
    "Czy organizacja regularnie ocenia zgodność algorytmów generatywnej Al z regulacjami prawnymi?": {
      "present": {
        "level": "A",
        "description": "Brak oceny zgodności algorytmów z regulacjami"
      },
      "steps": [
        {
          "level": "B",
          "description": "Sporadyczne oceny zgodności z przepisami w wybranych projektach"
        },
        {
          "level": "C",
          "description": "Częściowe wdrożenie procedur oceny zgodności algorytmów"
        },
        {
          "level": "D",
          "description": "Większość algorytmów jest regularnie weryfikowana pod kątem zgodności z regulacjami"
        },
        {
          "level": "E",
          "description": "W pełni wdrożone procedury regularnej oceny zgodności algorytmów Al z przepisami"
        }
      ]
    },
    "Czy Twoja organizacja tworzy systemy audytu decyzji podejmowanych przez generatywną AI?": {
      "present": {
        "level": "A",
        "description": "Brak systemów audytu decyzji podejmowanych przez Al"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowe systemy audytu wprowadzane w wybranych projektach"
        },
        {
          "level": "C",
          "description": "Częściowe wdrożenie systemów audytu decyzji Al"
        },
        {
          "level": "D",
          "description": "Systemy audytu funkcjonują dla większości decyzji Al"
        },
        {
          "level": "E",
          "description": "W pełni wdrożone systemy audytu i odpowiedzialności za decyzje podejmowane przez Al"
        }
      ]
    },
    "Czy Twoja organizacja poszerza świadomość dotyczącą ochrony danych wśród pracowników?": {
      "present": {
        "level": "A",
        "description": "Brak programów edukacyjnych dotyczących ochrony danych"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowe programy szkoleniowe, ale ograniczone do wybranych zespołów"
        },
        {
          "level": "C",
          "description": "Częściowe programy szkoleniowe dla wybranych zespołów"
        },
        {
          "level": "D",
          "description": "Regularne szkolenia w zakresie ochrony danych w większości zespołów"
        },
        {
          "level": "E",
          "description": "Pełne programy edukacyjne dotyczące ochrony danych dla wszystkich pracowników"
        }
      ]
    },
    "Czy organizacja wykorzystuje technologie dotyczące cyberbezpieczeństwa?": {
      "present": {
        "level": "C",
        "description": "Częściowe wdrożenie technologii cyberbezpieczeństwa"
      },
      "steps": [
        {
          "level": "D",
          "description": "Większość obszarów objęta technologiami cyberbezpieczeństwa"
        },
        {
          "level": "E",
          "description": "W pełni wdrożone technologie cyberbezpieczeństwa we wszystkich obszarach organizacji"
        }
      ]
    },
    "Czy Twoja organizacja utrzymuje dokumentację dotyczącą użycia generatywnej Al (np. przypadki użycia, logi systemowe, kontrola wersji)?": {
      "present": {
        "level": "E",
        "description": "Pełna i bieżąca dokumentacja dotycząca wszystkich przypadków użycia Al"
      },
      "steps": []
    }
  }
}