{
  "TECHNOLOGIA I INFRASTRUKTURA": {
    "Czy Twoja organizacja posiada skalowalną infrastrukturę IT wspierającą AI?": {
      "present": {
        "level": "A",
        "description": "Brak skalowalnej infrastruktury, brak uwzględnienia Al"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowa infrastruktura, ale nie skalowalna"
        },
        {
          "level": "C",
          "description": "Infrastruktura istnieje, ale skalowalność jest ograniczona"
        },
        {
          "level": "D",
          "description": "Skalowalna infrastruktura, ograniczona integracja Al"
        },
        {
          "level": "E",
          "description": "W pełni skalowalna infrastruktura zoptymalizowana pod Al"
        }
      ]
    },
    "Czy technologia generatywnej Al jest zintegrowana z innymi systemami (np. ERP, CRM)?": {
      "present": {
        "level": "C",
        "description": "Częściowa integracja z kluczowymi systemami (np. ERP)"
      },
      "steps": [
        {
          "level": "D",
          "description": "Integracja z większością systemów, z pewnymi lukami"
        },
        {
          "level": "E",
          "description": "W pełni zintegrowana generatywna Al we wszystkich głównych systemach"
        }
      ]
    },
    "Na ile zautomatyzowane jest wdrażanie modeli generatywnej AI?": {
      "present": {
        "level": "E",
        "description": "W pełni zautomatyzowane wdrażanie modeli generatywnej Al"
      },
      "steps": []
    },
    "Czy organizacja korzysta z chmury do przechowywania i przetwarzania danych AI?": {
      "present": {
        "level": "C",
        "description": "Częściowa adopcja chmury do przechowywania i przetwarzania danych"
      },
      "steps": [
        {
          "level": "D",
          "description": "Większość danych Al przechowywana i przetwarzana w chmurze"
        },
        {
          "level": "E",
          "description": "Pełna adopcja chmury dla wszystkich działań związanych z Al"
        }
      ]
    },
    "Czy organizacja korzysta z narzędzi do zarządzania cyklem życia modeli AI?": {
      "present": {
        "level": "C",
        "description": "Niektóre narzędzia wykorzystywane, brak standaryzacji"
      },
      "steps": [
        {
          "level": "D",
          "description": "Standaryzowane narzędzia dla większości procesów Al"
        },
        {
          "level": "E",
          "description": "W pełni wdrożone i zoptymalizowane narzędzia do zarządzania cyklem życia modeli Al"
        }
      ]
    },
    "Czy infrastruktura organizacji jest przygotowana do obsługi dużych zbiorów danych dla AI?": {
      "present": {
        "level": "D",
        "description": "Infrastruktura obsługuje większość dużych zbiorów danych"
      },
      "steps": [
        {
          "level": "E",
          "description": "Zoptymalizowana infrastruktura do obsługi ogromnych zbiorów danych"
        }
      ]
    },
    "Czy organizacja jest zdolna do przetwarzania danych w czasie rzeczywistym dla AI?": {
      "present": {
        "level": "B",
        "description": "Podstawowe przetwarzanie wsadowe"
      },
      "steps": [
        {
          "level": "C",
          "description": "Przetwarzanie danych w czasie rzeczywistym dla niektórych zadań"
        },
        {
          "level": "D",
          "description": "Przetwarzanie danych w czasie rzeczywistym, z niewielkimi opóźnieniami"
        },
        {
          "level": "E",
          "description": "W pełni zoptymalizowane przetwarzanie danych w czasie rzeczywistym dla wszystkich zadań Al"
        }
      ]
    },
    "Czy Twoja organizacja posiada moc obliczeniową niezbędną do wdrażania i utrzymania modeli Al?": {
      "present": {
        "level": "E",
        "description": "Zaawansowana moc obliczeniowa zoptymalizowana pod potrzeby Al"
      },
      "steps": []
    },
    "Czy w codziennej pracy wykorzystywane są wewnętrzne lub zewnętrzne narzędzia Al (np. ChatGPT, MS Copilot)?": {
      "present": {
        "level": "A",
        "description": "Brak narzędzi Al w codziennych zadaniach"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowe wykorzystanie narzędzi Al do wybranych zadań"
        },
        {
          "level": "C",
          "description": "Niektóre narzędzia Al wykorzystywane, ale nie powszechnie"
        },
        {
          "level": "D",
          "description": "Narzędzia Al wykorzystywane w większości działów do różnych zadań"
        },
        {
          "level": "E",
          "description": "W pełni zintegrowane narzędzia Al w codziennej pracy w całej organizacji"
        }
      ]
    },
    "Jak skalowalne są rozwiązania generatywnej Al w Twojej organizacji?": {
      "present": {
        "level": "E",
        "description": "W pełni skalowalne rozwiązania Al wdrożone w całej organizacji"
      },
      "steps": []
    }
  },
  "DANE": {
    "Czy Twoja organizacja buduje wysokiej jakości zbiory danych?": {
      "present": {
        "level": "A",
        "description": "Brak systematycznego budowania zbiorów danych"
      },
      "steps": [
        {
          "level": "B",
          "description": "Sporadyczne działania w kierunku poprawy jakości danych"
        },
        {
          "level": "C",
          "description": "Budowanie zbiorów danych z umiarkowaną jakością"
        },
        {
          "level": "D",
          "description": "Zbiory danych wysokiej jakości dla większości procesów"
        },
        {
          "level": "E",
          "description": "W pełni zoptymalizowane zbiory danych o najwyższej jakości"
        }
      ]
    },
    "Na ile Twoja organizacja automatyzuje analizę i przetwarzanie danych?": {
      "present": {
        "level": "C",
        "description": "Częściowa automatyzacja dla niektórych procesów"
      },
      "steps": [
        {
          "level": "D",
          "description": "Wysoka automatyzacja analiz i przetwarzania danych"
        },
        {
          "level": "E",
          "description": "W pełni zautomatyzowane procesy analizy i przetwarzania danych"
        }
      ]
    },
    "Czy Twoja organizacja centralizuje zbiory danych (np. jeden słownik danych)?": {
      "present": {
        "level": "D",
        "description": "Większość danych zcentralizowana, kilka wyjątków"
      },
      "steps": [
        {
          "level": "E",
          "description": "Pełna centralizacja danych, jeden słownik danych w całej organizacji"
        }
      ]
    },
    "Czy organizacja korzysta z zaawansowanych narzędzi do oceny jakości danych?": {
      "present": {
        "level": "D",
        "description": "Narzędzia do oceny jakości danych wykorzystywane w większości przypadków"
      },
      "steps": [
        {
          "level": "E",
          "description": "W pełni zoptymalizowane narzędzia do oceny jakości danych"
        }
      ]
    },
    "Czy Twoja organizacja ma strategię zarządzania danymi?": {
      "present": {
        "level": "B",
        "description": "Podstawowa strategia, ale niekompletnie wdrożona"
      },
      "steps": [
        {
          "level": "C",
          "description": "Strategia zarządzania danymi stosowana w wybranych obszarach"
        },
        {
          "level": "D",
          "description": "Strategia zarządzania danymi wdrożona w większości procesów"
        },
        {
          "level": "E",
          "description": "W pełni wdrożona i zoptymalizowana strategia zarządzania danymi"
        }
      ]
    },
    "Na ile Twoja organizacja automatyzuje proces zbierania i czyszczenia danych?": {
      "present": {
        "level": "B",
        "description": "Podstawowa automatyzacja niektórych etapów procesu"
      },
      "steps": [
        {
          "level": "C",
          "description": "Częściowa automatyzacja zbierania i czyszczenia danych"
        },
        {
          "level": "D",
          "description": "Automatyzacja dla większości procesów zbierania i czyszczenia danych"
        },
        {
          "level": "E",
          "description": "Pełna automatyzacja procesów zbierania i czyszczenia danych"
        }
      ]
    },
    "Czy organizacja identyfikuje i integruje dane z wewnętrznych i zewnętrznych źródeł?": {
      "present": {
        "level": "A",
        "description": "Brak identyfikacji i integracji danych z różnych źródeł"
      },
      "steps": [
        {
          "level": "B",
          "description": "Dane zidentyfikowane, ale nie w pełni zintegrowane"
        },
        {
          "level": "C",
          "description": "Częściowa integracja danych z wybranych źródeł"
        },
        {
          "level": "D",
          "description": "Większość danych zidentyfikowana i zintegrowana"
        },
        {
          "level": "E",
          "description": "W pełni zintegrowane dane z wewnętrznych i zewnętrznych źródeł"
        }
      ]
    },
    "Czy organizacja posiada jeden standardowy model danych i zestaw metadanych?": {
      "present": {
        "level": "C",
        "description": "Częściowe wdrożenie modelu danych i metadanych"
      },
      "steps": [
        {
          "level": "D",
          "description": "Większość procesów oparta na jednym modelu danych"
        },
        {
          "level": "E",
          "description": "W pełni wdrożony jeden standardowy model danych i zbiór metadanych"
        }
      ]
    },
    "Czy Twoja organizacja korzysta z generatywnej Al do wspomagania wizualizacji danych?": {
      "present": {
        "level": "C",
        "description": "Częściowe wykorzystanie generatywnej Al w wybranych obszarach"
      },
      "steps": [
        {
          "level": "D",
          "description": "generatywna Al wykorzystywana do większości wizualizacji danych"
        },
        {
          "level": "E",
          "description": "W pełni zintegrowane narzędzia Al do wspomagania wizualizacji danych"
        }
      ]
    }
  },
  "ORGANIZACJA I PROCESY": {
    "Czy Twoja organizacja integruje Al z istniejącymi procesami rozwoju nowego produktu?": {
      "present": {
        "level": "A",
        "description": "Brak integracji Al w procesach rozwoju nowego produktu"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowa integracja w procesach rozwoju wybranych produktów"
        },
        {
          "level": "C",
          "description": "Częściowa integracja w procesach rozwoju kilku produktów"
        },
        {
          "level": "D",
          "description": "Integracja Al w procesów rozwoju większości produktów"
        },
        {
          "level": "E",
          "description": "Pełna integracja Al w procesach rozwoju wszystkich produktów"
        }
      ]
    },
    "Na ile Twoja organizacja automatyzuje procesy rozwoju produktu z wykorzystaniem generatywnej AI?": {
      "present": {
        "level": "D",
        "description": "Automatyzacja większości procesów rozwoju produktu"
      },
      "steps": [
        {
          "level": "E",
          "description": "W pełni zautomatyzowane procesy rozwoju produktu z wykorzystaniem Al"
        }
      ]
    },
    "Czy organizacja wykorzystuje Al do wsparcia podejmowania decyzji?": {
      "present": {
        "level": "C",
        "description": "Al wspiera podejmowanie decyzji w ograniczonym zakresie"
      },
      "steps": [
        {
          "level": "D",
          "description": "Al wspiera większość decyzji w kluczowych obszarach"
        },
        {
          "level": "E",
          "description": "Al zintegrowana we wszystkich procesach decyzyjnych organizacji"
        }
      ]
    },
    "Czy organizacja wdraża narzędzia wspierające pracę zespołów AI?": {
      "present": {
        "level": "A",
        "description": "Brak narzędzi wspierających pracę zespołów Al"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowe narzędzia, ale nie są powszechnie używane"
        },
        {
          "level": "C",
          "description": "Częściowe wdrożenie narzędzi wspierających pracę zespołów Al"
        },
        {
          "level": "D",
          "description": "Narzędzia Al wspierają pracę większości zespołów"
        },
        {
          "level": "E",
          "description": "W pełni wdrożone narzędzia Al wspierające codzienną pracę zespołów"
        }
      ]
    },
    "Czy organizacja wprowadza cykle ciągłego doskonalenia we wdrażaniu rozwiązań generatywnej Al?": {
      "present": {
        "level": "E",
        "description": "W pełni wdrożone cykle ciągłego doskonalenia dla wszystkich wdrożeń Al"
      },
      "steps": []
    },
    "Czy organizacja zdefiniowała proces zarządzania cyklem życia dla oprogramowania AI?": {
      "present": {
        "level": "C",
        "description": "Zdefiniowany proces zarządzania cyklem życia w kilku projektach"
      },
      "steps": [
        {
          "level": "D",
          "description": "Zdefiniowany proces zarządzania cyklem życia w większości projektów"
        },
        {
          "level": "E",
          "description": "Pełny proces zarządzania cyklem życia dla oprogramowania Al wdrożony we wszystkich projektach"
        }
      ]
    },
    "Czy organizacja posiada przewodnik po procesie rozwoju produktu opartym o generatywną AI?": {
      "present": {
        "level": "A",
        "description": "Brak przewodnika Al po procesie rozwoju produktu"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowy przewodnik opracowany, ale rzadko używany"
        },
        {
          "level": "C",
          "description": "Przewodnik częściowo wdrożony w kilku projektach"
        },
        {
          "level": "D",
          "description": "Przewodnik po procesie rozwoju produktu stosowany w większości projektów"
        },
        {
          "level": "E",
          "description": "W pełni wdrożony przewodnik Al po procesie rozwoju produktu w całej organizacji"
        }
      ]
    }
  }
}