{
  "TECHNOLOGIA I INFRASTRUKTURA": {
    "Czy Twoja organizacja posiada skalowalną infrastrukturę IT wspierającą AI?": {
      "present": {
        "level": "D",
        "description": "Skalowalna infrastruktura, ograniczona integracja Al"
      },
      "steps": [
        {
          "level": "E",
          "description": "W pełni skalowalna infrastruktura zoptymalizowana pod Al"
        }
      ]
    },
    "Czy technologia generatywnej Al jest zintegrowana z innymi systemami (np. ERP, CRM)?": {
      "present": {
        "level": "D",
        "description": "Integracja z większością systemów, z pewnymi lukami"
      },
      "steps": [
        {
          "level": "E",
          "description": "W pełni zintegrowana generatywna Al we wszystkich głównych systemach"
        }
      ]
    },
    "Na ile zautomatyzowane jest wdrażanie modeli generatywnej AI?": {
      "present": {
        "level": "E",
        "description": "W pełni zautomatyzowane wdrażanie modeli generatywnej Al"
      },
      "steps": []
    },
    "Czy organizacja korzysta z chmury do przechowywania i przetwarzania danych AI?": {
      "present": {
        "level": "A",
        "description": "Brak wykorzystania chmury dla Al, dane przechowywane lokalnie"
      },
      "steps": [
        {
          "level": "B",
          "description": "Minimalne korzystanie z chmury do przechowywania danych"
        },
        {
          "level": "C",
          "description": "Częściowa adopcja chmury do przechowywania i przetwarzania danych"
        },
        {
          "level": "D",
          "description": "Większość danych Al przechowywana i przetwarzana w chmurze"
        },
        {
          "level": "E",
          "description": "Pełna adopcja chmury dla wszystkich działań związanych z Al"
        }
      ]
    },
    "Czy organizacja korzysta z narzędzi do zarządzania cyklem życia modeli AI?": {
      "present": {
        "level": "E",
        "description": "W pełni wdrożone i zoptymalizowane narzędzia do zarządzania cyklem życia modeli Al"
      },
      "steps": []
    },
    "Czy infrastruktura organizacji jest przygotowana do obsługi dużych zbiorów danych dla AI?": {
      "present": {
        "level": "D",
        "description": "Infrastruktura obsługuje większość dużych zbiorów danych"
      },
      "steps": [
        {
          "level": "E",
          "description": "Zoptymalizowana infrastruktura do obsługi ogromnych zbiorów danych"
        }
      ]
    },
    "Czy organizacja jest zdolna do przetwarzania danych w czasie rzeczywistym dla AI?": {
      "present": {
        "level": "E",
        "description": "W pełni zoptymalizowane przetwarzanie danych w czasie rzeczywistym dla wszystkich zadań Al"
      },
      "steps": []
    },
    "Czy Twoja organizacja posiada moc obliczeniową niezbędną do wdrażania i utrzymania modeli Al?": {
      "present": {
        "level": "E",
        "description": "Zaawansowana moc obliczeniowa zoptymalizowana pod potrzeby Al"
      },
      "steps": []
    },
    "Czy w codziennej pracy wykorzystywane są wewnętrzne lub zewnętrzne narzędzia Al (np. ChatGPT, MS Copilot)?": {
      "present": {
        "level": "D",
        "description": "Narzędzia Al wykorzystywane w większości działów do różnych zadań"
      },
      "steps": [
        {
          "level": "E",
          "description": "W pełni zintegrowane narzędzia Al w codziennej pracy w całej organizacji"
        }
      ]
    },
    "Jak skalowalne są rozwiązania generatywnej Al w Twojej organizacji?": {
      "present": {
        "level": "D",
        "description": "Większość rozwiązań Al jest skalowalna"
      },
      "steps": [
        {
          "level": "E",
          "description": "W pełni skalowalne rozwiązania Al wdrożone w całej organizacji"
        }
      ]
    }
  },
  "DANE": {
    "Czy Twoja organizacja buduje wysokiej jakości zbiory danych?": {
      "present": {
        "level": "C",
        "description": "Budowanie zbiorów danych z umiarkowaną jakością"
      },
      "steps": [
        {
          "level": "D",
          "description": "Zbiory danych wysokiej jakości dla większości procesów"
        },
        {
          "level": "E",
          "description": "W pełni zoptymalizowane zbiory danych o najwyższej jakości"
        }
      ]
    },
    "Na ile Twoja organizacja automatyzuje analizę i przetwarzanie danych?": {
      "present": {
        "level": "E",
        "description": "W pełni zautomatyzowane procesy analizy i przetwarzania danych"
      },
      "steps": []
    },
    "Czy Twoja organizacja centralizuje zbiory danych (np. jeden słownik danych)?": {
      "present": {
        "level": "C",
        "description": "Częściowa centralizacja z danymi w różnych systemach"
      },
      "steps": [
        {
          "level": "D",
          "description": "Większość danych zcentralizowana, kilka wyjątków"
        },
        {
          "level": "E",
          "description": "Pełna centralizacja danych, jeden słownik danych w całej organizacji"
        }
      ]
    },
    "Czy organizacja korzysta z zaawansowanych narzędzi do oceny jakości danych?": {
      "present": {
        "level": "E",
        "description": "W pełni zoptymalizowane narzędzia do oceny jakości danych"
      },
      "steps": []
    },
    "Czy Twoja organizacja ma strategię zarządzania danymi?": {
      "present": {
        "level": "B",
        "description": "Podstawowa strategia, ale niekompletnie wdrożona"
      },
      "steps": [
        {
          "level": "C",
          "description": "Strategia zarządzania danymi stosowana w wybranych obszarach"
        },
        {
          "level": "D",
          "description": "Strategia zarządzania danymi wdrożona w większości procesów"
        },
        {
          "level": "E",
          "description": "W pełni wdrożona i zoptymalizowana strategia zarządzania danymi"
        }
      ]
    },
    "Na ile Twoja organizacja automatyzuje proces zbierania i czyszczenia danych?": {
      "present": {
        "level": "A",
        "description": "Brak automatyzacji, dane zbierane i czyszczone ręcznie"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowa automatyzacja niektórych etapów procesu"
        },
        {
          "level": "C",
          "description": "Częściowa automatyzacja zbierania i czyszczenia danych"
        },
        {
          "level": "D",
          "description": "Automatyzacja dla większości procesów zbierania i czyszczenia danych"
        },
        {
          "level": "E",
          "description": "Pełna automatyzacja procesów zbierania i czyszczenia danych"
        }
      ]
    },
    "Czy organizacja identyfikuje i integruje dane z wewnętrznych i zewnętrznych źródeł?": {
      "present": {
        "level": "C",
        "description": "Częściowa integracja danych z wybranych źródeł"
      },
      "steps": [
        {
          "level": "D",
          "description": "Większość danych zidentyfikowana i zintegrowana"
        },
        {
          "level": "E",
          "description": "W pełni zintegrowane dane z wewnętrznych i zewnętrznych źródeł"
        }
      ]
    },
    "Czy organizacja posiada jeden standardowy model danych i zestaw metadanych?": {
      "present": {
        "level": "A",
        "description": "Brak standardowego modelu danych"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowy model danych wdrożony w niektórych obszarach"
        },
        {
          "level": "C",
          "description": "Częściowe wdrożenie modelu danych i metadanych"
        },
        {
          "level": "D",
          "description": "Większość procesów oparta na jednym modelu danych"
        },
        {
          "level": "E",
          "description": "W pełni wdrożony jeden standardowy model danych i zbiór metadanych"
        }
      ]
    },
    "Czy Twoja organizacja korzysta z generatywnej Al do wspomagania wizualizacji danych?": {
      "present": {
        "level": "C",
        "description": "Częściowe wykorzystanie generatywnej Al w wybranych obszarach"
      },
      "steps": [
        {
          "level": "D",
          "description": "generatywna Al wykorzystywana do większości wizualizacji danych"
        },
        {
          "level": "E",
          "description": "W pełni zintegrowane narzędzia Al do wspomagania wizualizacji danych"
        }
      ]
    }
  },
  "ETYKA I REGULACJE": {
    "Czy Twoja organizacja przestrzega zasad etyki w projektowaniu generatywnej AI?": {
      "present": {
        "level": "B",
        "description": "Sporadyczne uwzględnienie etyki w wybranych projektach"
      },
      "steps": [
        {
          "level": "C",
          "description": "Częściowe uwzględnienie zasad etyki w niektórych projektach"
        },
        {
          "level": "D",
          "description": "Większość projektów uwzględnia zasady etyki"
        },
        {
          "level": "E",
          "description": "W pełni uwzględnione zasady etyki we wszystkich projektach Al"
        }
      ]
    },
    "Czy Twoja organizacja zapewnia bezpieczeństwo i prywatność danych związanych z rozwojem produktów?": {
      "present": {
        "level": "D",
        "description": "Większość projektów przestrzega polityk bezpieczeństwa i prywatności danych"
      },
      "steps": [
        {
          "level": "E",
          "description": "W pełni wdrożone systemy bezpieczeństwa i prywatności danych dla wszystkich projektów"
        }
      ]
    },
    "Czy Twoja organizacja dba o zaufanie do danych i możliwość ich wyjaśnienia?": {
      "present": {
        "level": "C",
        "description": "Częściowe wdrożenie mechanizmów budujących zaufanie i możliwości wyjaśnienia"
      },
      "steps": [
        {
          "level": "D",
          "description": "Większość danych posiada mechanizmy możliwości wyjaśnienia"
        },
        {
          "level": "E",
          "description": "Pełne zaufanie do danych i mechanizmy możliwości wyjaśnienia wdrożone we wszystkich procesach"
        }
      ]
    },
    "Czy organizacja wdraża standardy ochrony i mechanizmy dotyczące kopii zapasowych danych?": {
      "present": {
        "level": "C",
        "description": "Częściowe wdrożenie mechanizmów ochrony i kopii zapasowych"
      },
      "steps": [
        {
          "level": "D",
          "description": "Większość obszarów objęta standardami ochrony i kopiami zapasowymi danych"
        },
        {
          "level": "E",
          "description": "W pełni wdrożone standardy ochrony i mechanizmy kopii zapasowych we wszystkich obszarach"
        }
      ]
    },
    "Czy Twoja organizacja przeciwdziała uprzedzeniom i niesprawiedliwości w algorytmach generatywnej Al?": {
      "present": {
        "level": "A",
        "description": "Brak działań w zakresie przeciwdziałania uprzedzeniom"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowe działania w zakresie eliminacji uprzedzeń"
        },
        {
          "level": "C",
          "description": "Częściowe wdrożenie działań przeciwdziałających uprzedzeniom w algorytmach"
        },
        {
          "level": "D",
          "description": "Większość algorytmów jest weryfikowana pod kątem uprzedzeń"
        },
        {
          "level": "E",
          "description": "Pełna eliminacja uprzedzeń i niesprawiedliwości w algorytmach Al"
        }
      ]
    },
    "Czy organizacja regularnie ocenia zgodność algorytmów generatywnej Al z regulacjami prawnymi?": {
      "present": {
        "level": "C",
        "description": "Częściowe wdrożenie procedur oceny zgodności algorytmów"
      },
      "steps": [
        {
          "level": "D",
          "description": "Większość algorytmów jest regularnie weryfikowana pod kątem zgodności z regulacjami"
        },
        {
          "level": "E",
          "description": "W pełni wdrożone procedury regularnej oceny zgodności algorytmów Al z przepisami"
        }
      ]
    },
    "Czy Twoja organizacja tworzy systemy audytu decyzji podejmowanych przez generatywną AI?": {
      "present": {
        "level": "B",
        "description": "Podstawowe systemy audytu wprowadzane w wybranych projektach"
      },
      "steps": [
        {
          "level": "C",
          "description": "Częściowe wdrożenie systemów audytu decyzji Al"
        },
        {
          "level": "D",
          "description": "Systemy audytu funkcjonują dla większości decyzji Al"
        },
        {
          "level": "E",
          "description": "W pełni wdrożone systemy audytu i odpowiedzialności za decyzje podejmowane przez Al"
        }
      ]
    },
    "Czy Twoja organizacja poszerza świadomość dotyczącą ochrony danych wśród pracowników?": {
      "present": {
        "level": "A",
        "description": "Brak programów edukacyjnych dotyczących ochrony danych"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowe programy szkoleniowe, ale ograniczone do wybranych zespołów"
        },
        {
          "level": "C",
          "description": "Częściowe programy szkoleniowe dla wybranych zespołów"
        },
        {
          "level": "D",
          "description": "Regularne szkolenia w zakresie ochrony danych w większości zespołów"
        },
        {
          "level": "E",
          "description": "Pełne programy edukacyjne dotyczące ochrony danych dla wszystkich pracowników"
        }
      ]
    },
    "Czy organizacja wykorzystuje technologie dotyczące cyberbezpieczeństwa?": {
      "present": {
        "level": "B",
        "description": "Podstawowe technologie wdrożone w wybranych obszarach"
      },
      "steps": [
        {
          "level": "C",
          "description": "Częściowe wdrożenie technologii cyberbezpieczeństwa"
        },
        {
          "level": "D",
          "description": "Większość obszarów objęta technologiami cyberbezpieczeństwa"
        },
        {
          "level": "E",
          "description": "W pełni wdrożone technologie cyberbezpieczeństwa we wszystkich obszarach organizacji"
        }
      ]
    },
    "Czy Twoja organizacja utrzymuje dokumentację dotyczącą użycia generatywnej Al (np. przypadki użycia, logi systemowe, kontrola wersji)?": {
      "present": {
        "level": "C",
        "description": "Częściowa dokumentacja dla wybranych obszarów"
      },
      "steps": [
        {
          "level": "D",
          "description": "Dokumentacja prowadzona regularnie w większości przypadków"
        },
        {
          "level": "E",
          "description": "Pełna i bieżąca dokumentacja dotycząca wszystkich przypadków użycia Al"
        }
      ]
    }
  }
}