{
  "ORGANIZATION AND PROCESSES": {
    "Czy Twoja organizacja integruje Al z istniejącymi procesami rozwoju nowego produktu?": {
      "present": {
        "level": "B",
        "description": "Podstawowa integracja w procesach rozwoju wybranych produktów"
      },
      "steps": [
        {
          "level": "C",
          "description": "Częściowa integracja w procesach rozwoju kilku produktów"
        },
        {
          "level": "D",
          "description": "Integracja Al w procesów rozwoju większości produktów"
        },
        {
          "level": "E",
          "description": "Pełna integracja Al w procesach rozwoju wszystkich produktów"
        }
      ]
    },
    "Na ile Twoja organizacja automatyzuje procesy rozwoju produktu z wykorzystaniem generatywnej AI?": {
      "present": {
        "level": "D",
        "description": "Automatyzacja większości procesów rozwoju produktu"
      },
      "steps": [
        {
          "level": "E",
          "description": "W pełni zautomatyzowane procesy rozwoju produktu z wykorzystaniem Al"
        }
      ]
    },
    "Czy organizacja wykorzystuje Al do wsparcia podejmowania decyzji?": {
      "present": {
        "level": "D",
        "description": "Al wspiera większość decyzji w kluczowych obszarach"
      },
      "steps": [
        {
          "level": "E",
          "description": "Al zintegrowana we wszystkich procesach decyzyjnych organizacji"
        }
      ]
    },
    "Czy organizacja wdraża narzędzia wspierające pracę zespołów AI?": {
      "present": {
        "level": "A",
        "description": "Brak narzędzi wspierających pracę zespołów Al"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowe narzędzia, ale nie są powszechnie używane"
        },
        {
          "level": "C",
          "description": "Częściowe wdrożenie narzędzi wspierających pracę zespołów Al"
        },
        {
          "level": "D",
          "description": "Narzędzia Al wspierają pracę większości zespołów"
        },
        {
          "level": "E",
          "description": "W pełni wdrożone narzędzia Al wspierające codzienną pracę zespołów"
        }
      ]
    },
    "Czy organizacja wprowadza cykle ciągłego doskonalenia we wdrażaniu rozwiązań generatywnej Al?": {
      "present": {
        "level": "B",
        "description": "Sporadyczne działania w kierunku doskonalenia procesów"
      },
      "steps": [
        {
          "level": "C",
          "description": "Cykle doskonalenia w wybranych procesach Al"
        },
        {
          "level": "D",
          "description": "Doskonalenie wdrożeń Al w większości projektów"
        },
        {
          "level": "E",
          "description": "W pełni wdrożone cykle ciągłego doskonalenia dla wszystkich wdrożeń Al"
        }
      ]
    },
    "Czy organizacja zdefiniowała proces zarządzania cyklem życia dla oprogramowania AI?": {
      "present": {
        "level": "E",
        "description": "Pełny proces zarządzania cyklem życia dla oprogramowania Al wdrożony we wszystkich projektach"
      },
      "steps": []
    },
    "Czy organizacja posiada przewodnik po procesie rozwoju produktu opartym o generatywną AI?": {
      "present": {
        "level": "A",
        "description": "Brak przewodnika Al po procesie rozwoju produktu"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowy przewodnik opracowany, ale rzadko używany"
        },
        {
          "level": "C",
          "description": "Przewodnik częściowo wdrożony w kilku projektach"
        },
        {
          "level": "D",
          "description": "Przewodnik po procesie rozwoju produktu stosowany w większości projektów"
        },
        {
          "level": "E",
          "description": "W pełni wdrożony przewodnik Al po procesie rozwoju produktu w całej organizacji"
        }
      ]
    }
  },
  "BUDGET": {
    "Czy Twoja organizacja prowadzi długoterminowe planowanie budżetu na rozwój rozwiązań i infrastruktury wspierającej generatywną AI?": {
      "present": {
        "level": "C",
        "description": "Częściowe planowanie długoterminowe, ograniczone do niektórych projektów"
      },
      "steps": [
        {
          "level": "D",
          "description": "Długoterminowe planowanie budżetowe w większości projektów"
        },
        {
          "level": "E",
          "description": "Pełne długoterminowe planowanie budżetu na wszystkie projekty i infrastrukturę Al"
        }
      ]
    },
    "Czy Twoja organizacja przeznacza środki na rozwój kompetencji pracowników w zakresie generatywnej AI?": {
      "present": {
        "level": "C",
        "description": "Częściowe przeznaczanie środków na rozwój kompetencji"
      },
      "steps": [
        {
          "level": "D",
          "description": "Stałe finansowanie rozwoju kompetencji większości pracowników"
        },
        {
          "level": "E",
          "description": "Pełne finansowanie rozwoju kompetencji w zakresie Al dla wszystkich pracowników"
        }
      ]
    },
    "Czy Twoja organizacja finansuje projekty pilotażowe i innowacyjne związane z generatywną AI?": {
      "present": {
        "level": "B",
        "description": "Ograniczone finansowanie pojedynczych projektów"
      },
      "steps": [
        {
          "level": "C",
          "description": "Częściowe finansowanie projektów pilotażowych i innowacyjnych"
        },
        {
          "level": "D",
          "description": "Regularne finansowanie większości projektów pilotażowych"
        },
        {
          "level": "E",
          "description": "Pełne wsparcie finansowe dla wszystkich projektów pilotażowych i innowacyjnych związanych z Al"
        }
      ]
    },
    "Czy organizacja alokuje środki na zewnętrzne konsultacje dotyczące generatywnej AI?": {
      "present": {
        "level": "A",
        "description": "Brak alokacji środków na zewnętrzne konsultacje dotyczące Al"
      },
      "steps": [
        {
          "level": "B",
          "description": "Sporadyczne alokowanie środków na konsultacje w wybranych projektach"
        },
        {
          "level": "C",
          "description": "Częściowa alokacja środków na zewnętrzne konsultacje"
        },
        {
          "level": "D",
          "description": "Regularna alokacja środków na konsultacje w większości projektów"
        },
        {
          "level": "E",
          "description": "Pełna alokacja środków na zewnętrzne konsultacje we wszystkich strategicznych projektach"
        }
      ]
    },
    "Czy organizacja priorytetyzuje projekty generujące wysoką wartość dodaną dzięki generatywnej AI?": {
      "present": {
        "level": "E",
        "description": "Pełna priorytetyzacja projektów Al o najwyższej wartości dodanej"
      },
      "steps": []
    }
  },
  "ETHICS AND REGULATIONS": {
    "Czy Twoja organizacja przestrzega zasad etyki w projektowaniu generatywnej AI?": {
      "present": {
        "level": "C",
        "description": "Częściowe uwzględnienie zasad etyki w niektórych projektach"
      },
      "steps": [
        {
          "level": "D",
          "description": "Większość projektów uwzględnia zasady etyki"
        },
        {
          "level": "E",
          "description": "W pełni uwzględnione zasady etyki we wszystkich projektach Al"
        }
      ]
    },
    "Czy Twoja organizacja zapewnia bezpieczeństwo i prywatność danych związanych z rozwojem produktów?": {
      "present": {
        "level": "D",
        "description": "Większość projektów przestrzega polityk bezpieczeństwa i prywatności danych"
      },
      "steps": [
        {
          "level": "E",
          "description": "W pełni wdrożone systemy bezpieczeństwa i prywatności danych dla wszystkich projektów"
        }
      ]
    },
    "Czy Twoja organizacja dba o zaufanie do danych i możliwość ich wyjaśnienia?": {
      "present": {
        "level": "B",
        "description": "Minimalne działania w zakresie zaufania i możliwości wyjaśnienia danych"
      },
      "steps": [
        {
          "level": "C",
          "description": "Częściowe wdrożenie mechanizmów budujących zaufanie i możliwości wyjaśnienia"
        },
        {
          "level": "D",
          "description": "Większość danych posiada mechanizmy możliwości wyjaśnienia"
        },
        {
          "level": "E",
          "description": "Pełne zaufanie do danych i mechanizmy możliwości wyjaśnienia wdrożone we wszystkich procesach"
        }
      ]
    },
    "Czy organizacja wdraża standardy ochrony i mechanizmy dotyczące kopii zapasowych danych?": {
      "present": {
        "level": "D",
        "description": "Większość obszarów objęta standardami ochrony i kopiami zapasowymi danych"
      },
      "steps": [
        {
          "level": "E",
          "description": "W pełni wdrożone standardy ochrony i mechanizmy kopii zapasowych we wszystkich obszarach"
        }
      ]
    },
    "Czy Twoja organizacja przeciwdziała uprzedzeniom i niesprawiedliwości w algorytmach generatywnej Al?": {
      "present": {
        "level": "D",
        "description": "Większość algorytmów jest weryfikowana pod kątem uprzedzeń"
      },
      "steps": [
        {
          "level": "E",
          "description": "Pełna eliminacja uprzedzeń i niesprawiedliwości w algorytmach Al"
        }
      ]
    },
    "Czy organizacja regularnie ocenia zgodność algorytmów generatywnej Al z regulacjami prawnymi?": {
      "present": {
        "level": "E",
        "description": "W pełni wdrożone procedury regularnej oceny zgodności algorytmów Al z przepisami"
      },
      "steps": []
    },
    "Czy Twoja organizacja tworzy systemy audytu decyzji podejmowanych przez generatywną AI?": {
      "present": {
        "level": "D",
        "description": "Systemy audytu funkcjonują dla większości decyzji Al"
      },
      "steps": [
        {
          "level": "E",
          "description": "W pełni wdrożone systemy audytu i odpowiedzialności za decyzje podejmowane przez Al"
        }
      ]
    },
    "Czy Twoja organizacja poszerza świadomość dotyczącą ochrony danych wśród pracowników?": {
      "present": {
        "level": "A",
        "description": "Brak programów edukacyjnych dotyczących ochrony danych"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowe programy szkoleniowe, ale ograniczone do wybranych zespołów"
        },
        {
          "level": "C",
          "description": "Częściowe programy szkoleniowe dla wybranych zespołów"
        },
        {
          "level": "D",
          "description": "Regularne szkolenia w zakresie ochrony danych w większości zespołów"
        },
        {
          "level": "E",
          "description": "Pełne programy edukacyjne dotyczące ochrony danych dla wszystkich pracowników"
        }
      ]
    },
    "Czy organizacja wykorzystuje technologie dotyczące cyberbezpieczeństwa?": {
      "present": {
        "level": "B",
        "description": "Podstawowe technologie wdrożone w wybranych obszarach"
      },
      "steps": [
        {
          "level": "C",
          "description": "Częściowe wdrożenie technologii cyberbezpieczeństwa"
        },
        {
          "level": "D",
          "description": "Większość obszarów objęta technologiami cyberbezpieczeństwa"
        },
        {
          "level": "E",
          "description": "W pełni wdrożone technologie cyberbezpieczeństwa we wszystkich obszarach organizacji"
        }
      ]
    },
    "Czy Twoja organizacja utrzymuje dokumentację dotyczącą użycia generatywnej Al (np. przypadki użycia, logi systemowe, kontrola wersji)?": {
      "present": {
        "level": "D",
        "description": "Dokumentacja prowadzona regularnie w większości przypadków"
      },
      "steps": [
        {
          "level": "E",
          "description": "Pełna i bieżąca dokumentacja dotycząca wszystkich przypadków użycia Al"
        }
      ]
    }
  }
}