{
  "TECHNOLOGY AND INFRASTRUCTURE": {
    "Czy Twoja organizacja posiada skalowalną infrastrukturę IT wspierającą AI?": {
      "present": {
        "level": "E",
        "description": "W pełni skalowalna infrastruktura zoptymalizowana pod Al"
      },
      "steps": []
    },
    "Czy technologia generatywnej Al jest zintegrowana z innymi systemami (np. ERP, CRM)?": {
      "present": {
        "level": "A",
        "description": "Brak integracji Al z innymi systemami"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowa integracja w jednym procesie lub systemie"
        },
        {
          "level": "C",
          "description": "Częściowa integracja z kluczowymi systemami (np. ERP)"
        },
        {
          "level": "D",
          "description": "Integracja z większością systemów, z pewnymi lukami"
        },
        {
          "level": "E",
          "description": "W pełni zintegrowana generatywna Al we wszystkich głównych systemach"
        }
      ]
    },
    "Na ile zautomatyzowane jest wdrażanie modeli generatywnej AI?": {
      "present": {
        "level": "B",
        "description": "Podstawowa automatyzacja małych modeli"
      },
      "steps": [
        {
          "level": "C",
          "description": "Częściowa automatyzacja z pewną ingerencją człowieka"
        },
        {
          "level": "D",
          "description": "W dużej mierze zautomatyzowane, sporadyczna ingerencja"
        },
        {
          "level": "E",
          "description": "W pełni zautomatyzowane wdrażanie modeli generatywnej Al"
        }
      ]
    },
    "Czy organizacja korzysta z chmury do przechowywania i przetwarzania danych AI?": {
      "present": {
        "level": "E",
        "description": "Pełna adopcja chmury dla wszystkich działań związanych z Al"
      },
      "steps": []
    },
    "Czy organizacja korzysta z narzędzi do zarządzania cyklem życia modeli AI?": {
      "present": {
        "level": "C",
        "description": "Niektóre narzędzia wykorzystywane, brak standaryzacji"
      },
      "steps": [
        {
          "level": "D",
          "description": "Standaryzowane narzędzia dla większości procesów Al"
        },
        {
          "level": "E",
          "description": "W pełni wdrożone i zoptymalizowane narzędzia do zarządzania cyklem życia modeli Al"
        }
      ]
    },
    "Czy infrastruktura organizacji jest przygotowana do obsługi dużych zbiorów danych dla AI?": {
      "present": {
        "level": "E",
        "description": "Zoptymalizowana infrastruktura do obsługi ogromnych zbiorów danych"
      },
      "steps": []
    },
    "Czy organizacja jest zdolna do przetwarzania danych w czasie rzeczywistym dla AI?": {
      "present": {
        "level": "A",
        "description": "Brak przetwarzania danych w czasie rzeczywistym"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowe przetwarzanie wsadowe"
        },
        {
          "level": "C",
          "description": "Przetwarzanie danych w czasie rzeczywistym dla niektórych zadań"
        },
        {
          "level": "D",
          "description": "Przetwarzanie danych w czasie rzeczywistym, z niewielkimi opóźnieniami"
        },
        {
          "level": "E",
          "description": "W pełni zoptymalizowane przetwarzanie danych w czasie rzeczywistym dla wszystkich zadań Al"
        }
      ]
    },
    "Czy Twoja organizacja posiada moc obliczeniową niezbędną do wdrażania i utrzymania modeli Al?": {
      "present": {
        "level": "A",
        "description": "Brak mocy obliczeniowej dla wdrożenia i utrzymania modeli Al"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowa moc obliczeniowa, wystarczająca dla małych modeli"
        },
        {
          "level": "C",
          "description": "Umiarkowana moc obliczeniowa, wystarczająca dla niektórych modeli"
        },
        {
          "level": "D",
          "description": "Wysoka moc obliczeniowa, wystarczająca dla większości aplikacji Al"
        },
        {
          "level": "E",
          "description": "Zaawansowana moc obliczeniowa zoptymalizowana pod potrzeby Al"
        }
      ]
    },
    "Czy w codziennej pracy wykorzystywane są wewnętrzne lub zewnętrzne narzędzia Al (np. ChatGPT, MS Copilot)?": {
      "present": {
        "level": "A",
        "description": "Brak narzędzi Al w codziennych zadaniach"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowe wykorzystanie narzędzi Al do wybranych zadań"
        },
        {
          "level": "C",
          "description": "Niektóre narzędzia Al wykorzystywane, ale nie powszechnie"
        },
        {
          "level": "D",
          "description": "Narzędzia Al wykorzystywane w większości działów do różnych zadań"
        },
        {
          "level": "E",
          "description": "W pełni zintegrowane narzędzia Al w codziennej pracy w całej organizacji"
        }
      ]
    },
    "Jak skalowalne są rozwiązania generatywnej Al w Twojej organizacji?": {
      "present": {
        "level": "E",
        "description": "W pełni skalowalne rozwiązania Al wdrożone w całej organizacji"
      },
      "steps": []
    }
  },
  "PEOPLE AND COMPETENCIES": {
    "Czy Twoja organizacja rozwija świadomość i zrozumienie rozwiązań generatywnej AI?": {
      "present": {
        "level": "A",
        "description": "Brak świadomości rozwiązań generatywnej Al"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowa świadomość wśród wybranych zespołów"
        },
        {
          "level": "C",
          "description": "Częściowe zrozumienie i świadomość w wybranych obszarach"
        },
        {
          "level": "D",
          "description": "Świadomość i zrozumienie w większości działów"
        },
        {
          "level": "E",
          "description": "Pełne zrozumienie i świadomość generatywnej Al w całej organizacji"
        }
      ]
    },
    "Czy organizacja szkoli zespoły w zakresie programowania (także promptingu) i analizy danych?": {
      "present": {
        "level": "A",
        "description": "Brak szkoleń z programowania i analizy danych"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowe szkolenia w wybranych zespołach"
        },
        {
          "level": "C",
          "description": "Częściowe szkolenia, ale ograniczone do kilku zespołów"
        },
        {
          "level": "D",
          "description": "Regularne szkolenia obejmujące większość zespołów"
        },
        {
          "level": "E",
          "description": "W pełni rozwinięty program szkoleń dla wszystkich zespołów w zakresie Al i analizy danych"
        }
      ]
    },
    "Czy Twoja organizacja tworzy interdyscyplinarne zespoły ds. AI?": {
      "present": {
        "level": "A",
        "description": "Brak interdyscyplinarnych zespołów ds. Al"
      },
      "steps": [
        {
          "level": "B",
          "description": "Tworzenie zespołów w niektórych projektach"
        },
        {
          "level": "C",
          "description": "Częściowe tworzenie zespołów, ale nie w każdej inicjatywie"
        },
        {
          "level": "D",
          "description": "Większość projektów posiada interdyscyplinarne zespoły"
        },
        {
          "level": "E",
          "description": "W pełni zintegrowane interdyscyplinarne zespoły ds. Al we wszystkich projektach"
        }
      ]
    },
    "Czy organizacja angażuje zewnętrznych konsultantów ds. generatywnej Al do zespołów?": {
      "present": {
        "level": "C",
        "description": "Konsultanci zewnętrzni angażowani przy wybranych projektach"
      },
      "steps": [
        {
          "level": "D",
          "description": "Regularne angażowanie konsultantów do kluczowych inicjatyw"
        },
        {
          "level": "E",
          "description": "W pełni zintegrowane wsparcie konsultantów Al we wszystkich istotnych projektach"
        }
      ]
    },
    "Czy Twoja organizacja szkoli w zakresie zarządzania projektami opartymi o generatywną Al?": {
      "present": {
        "level": "C",
        "description": "Częściowe szkolenia z zarządzania projektami dla wybranych zespołów"
      },
      "steps": [
        {
          "level": "D",
          "description": "Regularne szkolenia w zakresie projektów opartych o generatywną Al"
        },
        {
          "level": "E",
          "description": "Pełny program szkoleń z zarządzania projektami generatywnymi Al dla wszystkich odpowiednich zespołów"
        }
      ]
    },
    "Czy istnieje zarządzanie wiedzą w dziedzinie generatywnej Al, aby ułatwić transfer wiedzy między wszystkimi pracownikami?": {
      "present": {
        "level": "E",
        "description": "Scentralizowana platforma do gromadzenia wiedzy jest używana przez wszystkich pracowników i jest stale rozbudowywana."
      },
      "steps": []
    }
  },
  "ORGANIZATION AND PROCESSES": {
    "Czy Twoja organizacja integruje Al z istniejącymi procesami rozwoju nowego produktu?": {
      "present": {
        "level": "D",
        "description": "Integracja Al w procesów rozwoju większości produktów"
      },
      "steps": [
        {
          "level": "E",
          "description": "Pełna integracja Al w procesach rozwoju wszystkich produktów"
        }
      ]
    },
    "Na ile Twoja organizacja automatyzuje procesy rozwoju produktu z wykorzystaniem generatywnej AI?": {
      "present": {
        "level": "D",
        "description": "Automatyzacja większości procesów rozwoju produktu"
      },
      "steps": [
        {
          "level": "E",
          "description": "W pełni zautomatyzowane procesy rozwoju produktu z wykorzystaniem Al"
        }
      ]
    },
    "Czy organizacja wykorzystuje Al do wsparcia podejmowania decyzji?": {
      "present": {
        "level": "C",
        "description": "Al wspiera podejmowanie decyzji w ograniczonym zakresie"
      },
      "steps": [
        {
          "level": "D",
          "description": "Al wspiera większość decyzji w kluczowych obszarach"
        },
        {
          "level": "E",
          "description": "Al zintegrowana we wszystkich procesach decyzyjnych organizacji"
        }
      ]
    },
    "Czy organizacja wdraża narzędzia wspierające pracę zespołów AI?": {
      "present": {
        "level": "E",
        "description": "W pełni wdrożone narzędzia Al wspierające codzienną pracę zespołów"
      },
      "steps": []
    },
    "Czy organizacja wprowadza cykle ciągłego doskonalenia we wdrażaniu rozwiązań generatywnej Al?": {
      "present": {
        "level": "E",
        "description": "W pełni wdrożone cykle ciągłego doskonalenia dla wszystkich wdrożeń Al"
      },
      "steps": []
    },
    "Czy organizacja zdefiniowała proces zarządzania cyklem życia dla oprogramowania AI?": {
      "present": {
        "level": "D",
        "description": "Zdefiniowany proces zarządzania cyklem życia w większości projektów"
      },
      "steps": [
        {
          "level": "E",
          "description": "Pełny proces zarządzania cyklem życia dla oprogramowania Al wdrożony we wszystkich projektach"
        }
      ]
    },
    "Czy organizacja posiada przewodnik po procesie rozwoju produktu opartym o generatywną AI?": {
      "present": {
        "level": "A",
        "description": "Brak przewodnika Al po procesie rozwoju produktu"
      },
      "steps": [
        {
          "level": "B",
          "description": "Podstawowy przewodnik opracowany, ale rzadko używany"
        },
        {
          "level": "C",
          "description": "Przewodnik częściowo wdrożony w kilku projektach"
        },
        {
          "level": "D",
          "description": "Przewodnik po procesie rozwoju produktu stosowany w większości projektów"
        },
        {
          "level": "E",
          "description": "W pełni wdrożony przewodnik Al po procesie rozwoju produktu w całej organizacji"
        }
      ]
    }
  },
  "BUDGET": {
    "Czy Twoja organizacja prowadzi długoterminowe planowanie budżetu na rozwój rozwiązań i infrastruktury wspierającej generatywną AI?": {
      "present": {
        "level": "B",
        "description": "Krótkoterminowe planowanie budżetowe w wybranych projektach"
      },
      "steps": [
        {
          "level": "C",
          "description": "Częściowe planowanie długoterminowe, ograniczone do niektórych projektów"
        },
        {
          "level": "D",
          "description": "Długoterminowe planowanie budżetowe w większości projektów"
        },
        {
          "level": "E",
          "description": "Pełne długoterminowe planowanie budżetu na wszystkie projekty i infrastrukturę Al"
        }
      ]
    },
    "Czy Twoja organizacja przeznacza środki na rozwój kompetencji pracowników w zakresie generatywnej AI?": {
      "present": {
        "level": "D",
        "description": "Stałe finansowanie rozwoju kompetencji większości pracowników"
      },
      "steps": [
        {
          "level": "E",
          "description": "Pełne finansowanie rozwoju kompetencji w zakresie Al dla wszystkich pracowników"
        }
      ]
    },
    "Czy Twoja organizacja finansuje projekty pilotażowe i innowacyjne związane z generatywną AI?": {
      "present": {
        "level": "D",
        "description": "Regularne finansowanie większości projektów pilotażowych"
      },
      "steps": [
        {
          "level": "E",
          "description": "Pełne wsparcie finansowe dla wszystkich projektów pilotażowych i innowacyjnych związanych z Al"
        }
      ]
    },
    "Czy organizacja alokuje środki na zewnętrzne konsultacje dotyczące generatywnej AI?": {
      "present": {
        "level": "D",
        "description": "Regularna alokacja środków na konsultacje w większości projektów"
      },
      "steps": [
        {
          "level": "E",
          "description": "Pełna alokacja środków na zewnętrzne konsultacje we wszystkich strategicznych projektach"
        }
      ]
    },
    "Czy organizacja priorytetyzuje projekty generujące wysoką wartość dodaną dzięki generatywnej AI?": {
      "present": {
        "level": "E",
        "description": "Pełna priorytetyzacja projektów Al o najwyższej wartości dodanej"
      },
      "steps": []
    }
  }
}